{
  "title": "File:Arnie Reisman, Martha's Vineyard Poet Laureate.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/10/Arnie_Reisman%2C_Martha%27s_Vineyard_Poet_Laureate.jpg/1280px-Arnie_Reisman%2C_Martha%27s_Vineyard_Poet_Laureate.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/1/10/Arnie_Reisman%2C_Martha%27s_Vineyard_Poet_Laureate.jpg",
  "license": "CC BY-SA 3.0",
  "license_url": "https://creativecommons.org/licenses/by-sa/3.0",
  "author": "<a href=\"//commons.wikimedia.org/wiki/User:Williamwaterway\" title=\"User:Williamwaterway\">Williamwaterway</a>",
  "description": "Photo of Arnie Reisman - the new Martha’s Vineyard Poet Laureate. He was selected as the new Martha's Vineyard Poet Laureate from a field of twenty-four contestants by ten judges representing the Martha’s Vineyard Poetry Society.\n<p>Mr. Reisman is a \"closet poet\", who is also an award-winning writer, producer and performer, and is featured in commercial and public television, radio, corporate video, private and public media publications, theatre and film.\n</p><p>Since its inception on NPR in 1996, Reisman has been a panelist on National Public Radio's \"Says You!\", the weekly comedy quiz show airing in more than 120 markets, that also includes his wife, Paula Lyons, former national consumer reporter. \n</p><p>For more than 25 years, Arnie Reisman has served as a writer-producer and on-air performer and commentator at Boston TV stations WCVB (ABC) and WGBH (PBS). In 2009, with Ann Carol Grossman, he produced for PBS The Powder &amp; the Glory, the award-winning film focusing on the business rivalry and cultural influences of Helena Rubinstein and Elizabeth Arden. PBS has broadcast the film every March -- Women’s History Month.\n</p><p>His national telecasts include Hollywood On Trial (Oscar-nominated documentary on the blacklist), The Other Side of the Moon (90-minute PBS special for 20th anniversary of the lunar landing) and PBS' AIDS Quarterly with Peter Jennings. He was also the executive editor of the news weekly, Boston After Dark (now the late Boston Phoenix), and serves as the chair of the annual Bill of Rights Dinner for the American Civil Liberties Union of Massachusetts.\n</p>\nHe writes a column, \"The Washashore Chronicles\", for the \"Vineyard Gazette\" on Martha’s Vineyard, and spends his spare time writing plays and poetry.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AArnie%20Reisman%2C%20Martha%27s%20Vineyard%20Poet%20Laureate.jpg"
}