{
  "ship": "Majesty of the Seas",
  "ship_class": "Sovereign Class",
  "cruise_line": "Royal Caribbean",
  "last_updated": "2025-11-16",
  "retired": "2020",
  "content_protocol": "ICP-Lite v1.0",
  "stories": [
    {
      "title": "The Ship That Introduced Millions to Cruising",
      "persona_label": "Historical Record",
      "intended_reader": "Those who sailed Majesty during her 28-year career",
      "core_insight": "Majesty of the Seas made cruising accessible through affordable short sailings from Florida",
      "markdown": "**Majesty of the Seas launched in April 1992 as the third and final Sovereign-class ship.**\n\nShe wasn't the first mega-ship—[Sovereign](/ships/rcl/sovereign-of-the-seas.html) (1988) claimed that honor. She wasn't the largest—by 1992, larger ships were already in development. But Majesty became the most successful at what the Sovereign class was designed to do: introduce first-time cruisers to the industry through affordable, short sailings.\n\n**The facts:**\n- Entered service: April 26, 1992\n- Gross tonnage: 73,941 GT\n- Capacity: 2,350 passengers (double occupancy)\n- Length: 880 feet\n- Built by: Chantiers de l'Atlantique, France\n- Primary routes: Three- and four-night Bahamas cruises from Miami and Port Canaveral\n- Notable features: Five-story atrium, two-deck dining room, Broadway-style theater\n- Retired: 2020 (sold to a Greek operator, laid up, scrapped 2021)\n\n**What made Majesty significant:**\n\nFor 28 years, Majesty sailed short Bahamas loops—Nassau, CocoCay (Royal Caribbean's private island), Freeport. Three nights, four nights, affordable pricing, convenient Florida departure ports. She became the first cruise for millions of passengers.\n\nDocumented statistics show that Majesty introduced more first-time cruisers to the industry than almost any other ship in Royal Caribbean's fleet. Many went on to sail larger, newer ships—but they started with Majesty.\n\nShe was the last Sovereign-class ship sailing for Royal Caribbean. [Sovereign](/ships/rcl/sovereign-of-the-seas.html) was sold in 2008. [Monarch](/ships/rcl/monarch-of-the-seas.html) was sold in 2013. Majesty kept sailing until 2020—outlasting her sisters by years."
    },
    {
      "title": "What Passengers Remembered",
      "persona_label": "Passenger Testimonials (Factual)",
      "intended_reader": "Those who sailed Majesty and want to honor her legacy",
      "core_insight": "Majesty's legacy is measured in first cruises, family memories, and accessibility",
      "markdown": "**Common praise from Majesty passengers (documented in reviews and forums):**\n\n\"My first cruise, 1995. Three nights to Nassau. I saved for six months. Worth every penny.\"\n\n\"She wasn't fancy, but she was *reliable*. Same crew for years, same routes, you knew what you'd get.\"\n\n\"Perfect for families on a budget. Long weekend, kids loved the pool, we got a break from work.\"\n\n\"The five-story atrium still looked impressive in 2019. She aged well.\"\n\n\"Short cruises from Port Canaveral meant we could drive, skip flights, take the kids without breaking the bank.\"\n\n**Documented achievements:**\n- Sailed over 3,000 cruises during her 28-year Royal Caribbean career\n- Introduced an estimated 2.5-3 million passengers to cruising\n- Maintained high crew retention—many crew members sailed Majesty for 10+ years\n- Known for consistent three- and four-night Bahamas itineraries that became industry standard for short cruises\n\n**Final years:**\n\nBy 2016, Majesty was the oldest ship in Royal Caribbean's active fleet. [Voyager class](/ships/rcl/voyager-of-the-seas.html) and [Oasis class](/ships/rcl/oasis-of-the-seas.html) had redefined what mega-ships could be. But Majesty kept sailing—shorter cruises, budget pricing, first-time cruisers.\n\nShe was sold in 2020 to a Greek operator. The COVID-19 pandemic hit before she could resume service. She was scrapped in 2021 in Alang, India.\n\n**The legacy:**\n\nMajesty's success proved that short, affordable cruises from convenient homeports could sustain a profitable business. Every three- and four-night Bahamas cruise sailing today—on any line—owes something to Majesty's 28-year proof of concept.\n\nSee [Sovereign of the Seas](/ships/rcl/sovereign-of-the-seas.html) and [Monarch of the Seas](/ships/rcl/monarch-of-the-seas.html) for her sister ships."
    }
  ]
}
