{
  "ship": "Radiance of the Seas",
  "ship_class": "Radiance Class",
  "last_updated": "2025-11-15",
  "stories": [
    {
      "title": "Glass Walls and Ocean Views",
      "persona_label": "Traveler's Perspective",
      "markdown": "**The first thing you notice about Radiance is the glass.**\n\nFloor-to-ceiling windows line the promenades, glass elevators climb the outside of the ship, and even the dining rooms feel connected to the sea. It's a ship designed for travelers who want to watch the water, not just be on it.\n\nAt about 2,466 guests (double occupancy), Radiance feels mid-sized — big enough for variety, small enough that you won't get lost finding your cabin or the dining room. The layout is straightforward: decks stack vertically, no confusing neighborhood zones or hidden venues.\n\nIf you've sailed mega-ships like Oasis or Icon class, Radiance will feel intimate. If you're coming from smaller ships, it still offers Royal Caribbean's signature entertainment and dining variety without overwhelming you."
    },
    {
      "title": "What Works Well on Radiance",
      "persona_label": "Practical Notes",
      "markdown": "**Ocean-forward design.** The glass walls aren't just aesthetic — they make the ship feel open and connected to your surroundings. Alaska sailings especially benefit from this.\n\n**Mid-size navigation.** You can walk from bow to stern in a few minutes. Elevators are rarely crowded. The Windjammer buffet has actual breathing room.\n\n**Classic Royal Caribbean reliability.** Main dining room, Chops Grille, solid entertainment, familiar layout. If you've sailed Royal Caribbean before, Radiance won't surprise you — but it won't disappoint either.\n\n**Global itineraries.** Radiance has sailed everywhere: Alaska, Caribbean, Australia, Asia. It's a ship built for repositioning cruises and longer voyages."
    },
    {
      "title": "What to Know Before You Book",
      "persona_label": "Honest Expectations",
      "markdown": "**This is a 2001 ship.** Radiance entered service before neighborhood layouts, FlowRider surf simulators, or robot bartenders. It's been refurbished, but don't expect cutting-edge tech or the newest venues.\n\n**Smaller dining variety.** You'll find the essentials (main dining room, Windjammer, Chops Grille, specialty options), but not the 20+ venue spread of Oasis or Icon class.\n\n**Quieter vibe.** Families sail Radiance, but the ship attracts more couples and solo travelers than kid-heavy mega-ships. Sea days feel calm, not chaotic.\n\n**Itinerary over amenities.** If you're choosing Radiance, you're probably choosing it for *where* it goes (Alaska, Australia, unique ports) rather than onboard thrills."
    }
  ]
}
