{
  "ship": "Rhapsody of the Seas",
  "ship_class": "Vision Class",
  "cruise_line": "Royal Caribbean",
  "last_updated": "2025-11-18",
  "content_protocol": "ICP-Lite v1.0",
  "stories": [
    {
      "title": "Choosing Rhapsody Wisely",
      "persona_label": "Practical Fit Guidance",
      "intended_reader": "Travelers comparing Rhapsody to other Royal Caribbean ships",
      "core_insight": "Rhapsody suits travelers who want classic cruising, smaller ships, and intimate atmosphere over mega-ship amenities",
      "markdown": "**You'll probably love Rhapsody if:**\n- You want a [smaller ship](/ships.html) (~2,000 guests) you can navigate easily—no getting lost, no overwhelming crowds\n- You prefer intimate atmosphere over endless venues—you'd rather know your server's name than have 20 dining options\n- You value classic cruising: quality service, traditional dining room, glass-walled design for ocean views\n- You're a [solo traveler](/solo.html), couple, or multigenerational family who wants affordable [Royal Caribbean](/cruise-lines/royal-caribbean.html) reliability\n- You're sailing short Caribbean or European getaways\n- You're older, have mobility concerns, or prefer ships where elevators aren't constantly packed\n- You want to actually experience ports instead of treating the ship as the destination\n\n**You might prefer another ship if:**\n- You need cutting-edge amenities: FlowRiders, North Star, robot bartenders, waterslides (try [Odyssey](/ships/rcl/odyssey-of-the-seas.html), [Quantum](/ships/rcl/quantum-of-the-seas.html), or [Icon class](/ships/rcl/icon-of-the-seas.html))\n- You want neighborhood layouts and Central Park promenades (try [Oasis class](/ships/rcl/oasis-of-the-seas.html) or [Utopia](/ships/rcl/utopia-of-the-seas.html))\n- You're traveling with kids who need constant entertainment and activities\n- You need 15+ specialty [dining options](/restaurants.html)—Rhapsody has essentials but not extreme variety\n- You prefer mega-ships where you rarely see the same faces twice\n\n**The honest truth:** Rhapsody is a 1997 ship. It's been refurbished, but don't expect cutting-edge tech or newest venues. Cabins are smaller. Dining variety is limited. The pool deck is functional, not Instagram-worthy.\n\nBut if you want *cruising*—not theme-parking at sea—Rhapsody delivers. Attentive crew who remember your name. Traditional dining room with proper service. Manageable size where you can find the library, spa, or your cabin without a map. Glass-walled design for spectacular ocean views.\n\nRhapsody is the ship you choose when you understand what it's trying to be: a floating hotel for beautiful ports, designed for travelers who'd rather explore the Mediterranean than ride a surf simulator.\n\nSee [other Vision-class ships](/ships.html) for similar intimate experiences, or compare to [Radiance class](/ships/rcl/radiance-of-the-seas.html) for glass-wall design in a slightly larger package.",
      "author": {
        "name": "Natalie A.",
        "location": ""
      }
    }
  ]
}