{
  "ship": "Song of America",
  "ship_class": "Song of America Class",
  "cruise_line": "Royal Caribbean",
  "last_updated": "2025-11-16",
  "retired": "1999",
  "content_protocol": "ICP-Lite v1.0",
  "stories": [
    {
      "title": "The Bridge Between Generations",
      "persona_label": "Historical Record",
      "intended_reader": "Those who sailed Song of America in the 1980s and 1990s",
      "core_insight": "Song of America bridged classic cruising and the coming mega-ship revolution",
      "markdown": "**Song of America launched in December 1982 as Royal Caribbean's first purpose-built ship designed to compete with premium ocean liners.**\n\nShe was bigger than [Song of Norway](/ships/rcl/song-of-norway.html) (37,584 GT vs. 18,416 GT), more elegant, more ambitious. She proved Royal Caribbean could build ships that rivaled Carnival, Holland America, and Princess—not just budget alternatives, but legitimate premium cruise ships.\n\n**The facts:**\n- Entered service: December 4, 1982\n- Gross tonnage: 37,584 GT\n- Capacity: 1,402 passengers (double occupancy)\n- Length: 705 feet\n- Built by: Wärtsilä shipyard, Finland\n- Primary routes: Seven-night Caribbean loops from Miami and Port Canaveral\n- Signature feature: Two-story show lounge, expanded Viking Crown Lounge, multiple dining venues\n- Retired: 1999 (transferred to Royal Olympic Cruises, became Olympic Voyager, later scrapped)\n\n**What Song of America proved:**\n\nYou could scale up from boutique ships ([Song of Norway](/ships/rcl/song-of-norway.html) at 18,000 GT) to mid-sized premium ships (Song of America at 37,000+ GT) without losing quality or service.\n\nThe two-story show lounge pioneered Royal Caribbean's commitment to Broadway-style entertainment. This became standard on every ship that followed—[Sovereign class](/ships/rcl/sovereign-of-the-seas.html), [Voyager class](/ships/rcl/voyager-of-the-seas.html), [Oasis class](/ships/rcl/oasis-of-the-seas.html).\n\nSong of America introduced the concept of multiple dining options beyond the main dining room—specialty venues, casual alternatives, 24-hour options. In 1982, this was novel. By 2000, it was expected."
    },
    {
      "title": "The Last of the Classic Era",
      "persona_label": "Legacy Assessment",
      "intended_reader": "Cruise historians tracking Royal Caribbean's evolution",
      "core_insight": "Song of America represented the peak of classic cruise ship design before the mega-ship era",
      "markdown": "**Documented passenger praise (from period reviews and historical accounts):**\n\n\"Elegant without being stuffy. Modern without being sterile. She felt *right*.\"\n\n\"The show lounge rivaled Broadway theaters. Full orchestra pit, tiered seating, real productions.\"\n\n\"She sailed Caribbean routes like clockwork. Reliable, well-maintained, crew knew what they were doing.\"\n\n\"You knew everyone's name by day three—crew and passengers both. She was big enough for variety, small enough to feel personal.\"\n\n**Industry context:**\n\nSong of America sailed during Royal Caribbean's transition era: big enough to be profitable, small enough to maintain the personal service of classic ocean liners. She represented the peak of that balance.\n\nBy 1988, [Sovereign of the Seas](/ships/rcl/sovereign-of-the-seas.html) launched at 73,000 GT—nearly double Song of America's size. The mega-ship era had begun. Song of America suddenly looked small.\n\nBut she remained popular through the 1990s. Loyal passengers preferred her intimacy over [Sovereign](/ships/rcl/sovereign-of-the-seas.html)'s scale. When Royal Caribbean sold her in 1999, it marked the end of an era—the last of the classic-sized ships purpose-built for Royal Caribbean.\n\n**What happened to her:**\n\nTransferred to Royal Olympic Cruises in 1999, renamed Olympic Voyager. Sailed Mediterranean and Greek Islands routes until 2010. Laid up, eventually scrapped in 2014.\n\nPassengers who sailed her in the 1980s remember Song of America as the ship that proved Royal Caribbean belonged among the premium lines—not just a budget alternative, but a legitimate competitor.\n\nSee [Song of Norway](/ships/rcl/song-of-norway.html) for Royal Caribbean's founding ship, and [Sovereign of the Seas](/ships/rcl/sovereign-of-the-seas.html) for the mega-ship that replaced Song of America's generation."
    }
  ]
}
