{
  "ship": "Splendour of the Seas",
  "ship_class": "Vision Class",
  "cruise_line": "Royal Caribbean",
  "last_updated": "2025-11-16",
  "retired": "2016",
  "content_protocol": "ICP-Lite v1.0",
  "stories": [
    {
      "title": "The European Wanderer",
      "persona_label": "Historical Record",
      "intended_reader": "Those who sailed Splendour during her European and transatlantic years",
      "core_insight": "Splendour specialized in European cruising and became beloved for Mediterranean and transatlantic itineraries",
      "markdown": "**Splendour of the Seas launched in April 1996 as the sixth and final Vision-class ship.**\n\nWhere her Vision-class sisters ([Grandeur](/ships/rcl/grandeur-of-the-seas.html), [Rhapsody](/ships/rcl/rhapsody-of-the-seas.html), [Vision](/ships/rcl/vision-of-the-seas.html), [Enchantment](/ships/rcl/enchantment-of-the-seas.html)) sailed Caribbean and Alaska routes, Splendour carved a different identity: European specialist, Mediterranean wanderer, transatlantic crossings.\n\n**The facts:**\n- Entered service: April 1996\n- Gross tonnage: 69,130 GT\n- Capacity: 1,804 passengers (double occupancy)\n- Length: 867 feet\n- Built by: Chantiers de l'Atlantique, France\n- Primary routes: Mediterranean (summer), transatlantic repositioning (spring/fall), occasional Caribbean (winter)\n- Notable features: Seven-story atrium, Viking Crown Lounge, extensive glass walls for European sightseeing\n- Retired from Royal Caribbean: 2016 (sold to TUI Cruises, became Marella Celebration, still sailing as of 2025)\n\n**What made Splendour beloved:**\n\nSplendour spent most of her Royal Caribbean career sailing Europe: Barcelona to Rome, Greek Islands, Adriatic ports, Western Mediterranean loops. Summer seasons in the Med, repositioning transatlantic crossings in spring and fall, occasional Caribbean winters.\n\nEuropean cruisers developed loyalty to Splendour specifically. She wasn't the newest or largest ship, but she was *right-sized* for European ports—small enough to dock in Santorini, Dubrovnik, and Venice (ports that mega-ships couldn't access), big enough to offer Royal Caribbean's signature service and entertainment."
    },
    {
      "title": "What Splendour Passengers Valued",
      "persona_label": "Passenger Testimonials (Factual)",
      "intended_reader": "Splendour loyalists who preferred her European itineraries",
      "core_insight": "Splendour proved that mid-sized ships offered advantages mega-ships couldn't match for European cruising",
      "markdown": "**Common praise from Splendour passengers (documented in reviews and forums):**\n\n\"She could dock in ports [Oasis class](/ships/rcl/oasis-of-the-seas.html) couldn't reach. That alone made her invaluable for Mediterranean cruising.\"\n\n\"Right-sized for Europe. Not too big to feel impersonal, not too small to lack amenities.\"\n\n\"The transatlantic crossings were bucket-list experiences. Seven days at sea, formal nights, lectures, no port distractions.\"\n\n\"Glass walls everywhere—perfect for scenic cruising. Norwegian fjords, Greek coastlines, you didn't want to miss the views.\"\n\n\"When Royal Caribbean sold her in 2016, European cruisers lost a gem. The newer ships are impressive, but they can't dock where Splendour could.\"\n\n**Documented achievements:**\n- Sailed Mediterranean itineraries for over 15 consecutive summers\n- Completed dozens of transatlantic crossings, becoming a favorite for passengers who preferred sea days over port-hopping\n- Accessed smaller European ports that larger ships (Voyager, Oasis class) couldn't reach\n- Maintained high satisfaction scores despite being one of the older Vision-class ships\n\n**Life after Royal Caribbean:**\n\nIn 2016, Royal Caribbean sold Splendour to TUI Cruises (UK market). She was refurbished, renamed Marella Celebration, and continues sailing Mediterranean and European itineraries as of 2025.\n\nUnlike many retired ships that were scrapped, Splendour received a second career. She's still out there—different name, different line, same European waters she always loved.\n\n**The legacy:**\n\nSplendour proved that mid-sized ships (69,000 GT) could thrive in European markets where mega-ships struggled. Her success influenced Royal Caribbean's later decisions to deploy smaller ships ([Brilliance](/ships/rcl/brilliance-of-the-seas.html), [Serenade](/ships/rcl/serenade-of-the-seas.html)) to Europe instead of forcing mega-ships into ports they couldn't access.\n\nSee other Vision-class ships: [Grandeur](/ships/rcl/grandeur-of-the-seas.html), [Rhapsody](/ships/rcl/rhapsody-of-the-seas.html), [Vision](/ships/rcl/vision-of-the-seas.html), [Enchantment](/ships/rcl/enchantment-of-the-seas.html)."
    }
  ]
}
