{
  "ship": "Star of the Seas",
  "ship_class": "Icon Class",
  "cruise_line": "Royal Caribbean",
  "stories": [
    {
      "title": "Choosing Star Wisely",
      "persona_label": "Practical Fit Guidance",
      "markdown": "**You'll probably love Star of the Seas if:**\n- You want Royal Caribbean's newest innovations (Icon Class, launched 2025)\n- You prefer the world's largest cruise ship experience (~7,600 guests max)\n- You enjoy Thrill Island aqua park and AquaDome entertainment\n- You want eight distinct neighborhoods with cutting-edge dining\n- You appreciate modern design and extensive family amenities\n\n**You might prefer a different ship if:**\n- You want a smaller, more intimate cruise experience (try Radiance or Vision Class)\n- You prefer classic Royal Caribbean designs (try Voyager or Freedom Class)\n- You want proven favorites over newest innovations\n- You're sailing solo and want lower single supplements (try smaller ships)\n- You prefer traditional cruising over mega-ship resort experience\n\n**Good to know:**\n- Star is Icon's sister ship with nearly identical features and layout\n- Thrill Island aqua park features the Frighteningly Fun category slides\n- AquaDome offers multi-story entertainment venue with transforming spaces\n- Eight neighborhoods include Suite Neighborhood, Central Park, and more\n- Launched 2025 as Royal Caribbean's second Icon Class ship\n- Most specialty dining and bars operate at similar prices fleet-wide\n- Check deck plans carefully — Icon Class layout differs from older classes\n\n*Star of the Seas brings Icon Class innovations to more guests with the same groundbreaking design as Icon of the Seas.*",
      "author": {
        "name": "Jane B.",
        "location": ""
      }
    },
    {
      "title": "Lincoln Park Supper Club: The 1930s Chicago Experience",
      "persona_label": "Specialty Dining Review",
      "intended_reader": "Foodies and travelers considering specialty dining on Star of the Seas",
      "core_insight": "Star's Lincoln Park Supper Club combines theatrical dining with live entertainment in ways other specialty restaurants don't",
      "markdown": "**Eight courses. Live jazz trio. A storyline that unfolds between plates. This isn't just dinner — it's theater.**\n\nLincoln Park Supper Club is Star's signature specialty restaurant, unique to this ship. It's inspired by 1930s Chicago's legendary dining clubs — the Chez Paree, the Pump Room — where dinner was entertainment and entertainment was art.\n\nMy wife was skeptical. \"It's a gimmick,\" she said when I showed her the menu. Eight courses at $175 per person seemed excessive. But I'd read about the live performers, the themed courses, the way they integrated story into every dish. I convinced her to try it.\n\nWe arrived to dim lighting, art deco design, velvet curtains, and a jazz trio already playing. Our server greeted us in character — a 1930s maitre d' welcoming us to the club. The menu was presented as a \"program\" for the evening's performance.\n\nEach course had a story. The amuse-bouche was inspired by prohibition-era speakeasies. The seafood course referenced Lake Michigan. The wagyu beef paid homage to Chicago stockyards. Between courses, performers appeared — a torch singer, a tap dancer, a magician who did close-up tricks at our table.\n\nThe food was exceptional. Not just \"cruise ship specialty dining good\" — actually exceptional. The kind of plating and flavors you'd expect from a Michelin-starred restaurant. But the entertainment elevated it beyond just a meal.\n\nBy course six, my wife leaned over: \"Okay, this was worth it.\"\n\nHere's what makes Lincoln Park different from [150 Central Park](/restaurants/150-central-park.html) or [Chops Grille](/restaurants/chops.html): it's immersive. You're not just eating; you're experiencing. The performers aren't background noise — they're part of the meal. The story isn't decoration — it's the framework.\n\nIs it expensive? Yes. Is it worth it for a special occasion? Absolutely. Book it for an anniversary, milestone birthday, or that one night you want to remember.\n\n**Note:** Lincoln Park is only on Star of the Seas. Icon has Empire Supper Club instead (different theme, similar concept). Both are Icon Class exclusives.\n\nSee our [specialty dining guide](/restaurants.html) for more options.",
      "author": {
        "name": "Stanley L.",
        "location": ""
      }
    },
    {
      "title": "Icon vs. Star: Sister Ships, Different Vibes",
      "persona_label": "Ship Comparison",
      "intended_reader": "Travelers deciding between Icon and Star of the Seas",
      "core_insight": "Icon and Star are virtually identical in layout but differ in signature venues and launch timing",
      "markdown": "**\"Which one should we book?\" The most common question I get about Icon Class ships.**\n\nI've sailed both [Icon of the Seas](/ships/rcl/icon-of-the-seas.html) and Star of the Seas. Same class. Nearly identical deck plans. Same neighborhoods (Thrill Island, AquaDome, Surfside, Central Park, The Hideaway). Same waterpark. Same pools. Same Royal Promenade layout.\n\nSo what's actually different?\n\n**The signature restaurant:** Icon has Empire Supper Club. Star has Lincoln Park Supper Club. Both are themed dinner-theater experiences, but Empire leans modern Vegas, Lincoln Park leans 1930s Chicago. Pick the theme that appeals to you.\n\n**Launch timing:** Icon debuted January 2024. Star debuted August 2025. Star has minor refinements based on Icon's first year — slightly adjusted signage, a few operational improvements, but nothing dramatic.\n\n**Itineraries:** Both sail 7-night Eastern and Western Caribbean from Port Canaveral year-round, but check specific dates and ports. Sometimes one has the itinerary you want when the other doesn't.\n\n**Pricing:** Star was slightly cheaper at launch (newer ships often have introductory pricing), but prices fluctuate. Compare both for your dates.\n\n**That's... it.** Seriously. Same Category 6 waterpark. Same Crown's Edge thrill ride. Same AquaDome shows. Same [Surfside](/ships/rcl/star-of-the-seas.html) family neighborhood. Same suite perks. Same everything.\n\nIf someone tells you one is dramatically better than the other, they're selling something. These are sister ships in the truest sense — same parent, same DNA, tiny cosmetic differences.\n\n**My advice:**\n1. Compare prices for your dates\n2. Check itineraries (which ports do you want?)\n3. Look at dining options (Empire vs. Lincoln Park theme preference)\n4. Book whichever is available/affordable\n\nYou can't go wrong with either. They're both incredible ships. The biggest mistake would be agonizing over which one instead of just booking the cruise.\n\nFor Icon Class details, see [Icon of the Seas](/ships/rcl/icon-of-the-seas.html) or our [ship comparison guide](/ships.html).",
      "author": {
        "name": "Clifford M.",
        "location": ""
      }
    },
    {
      "title": "When the Biggest Ship Still Feels Too Small",
      "persona_label": "Family Overwhelm",
      "intended_reader": "Large families or groups considering mega-ships",
      "core_insight": "Even on the world's largest cruise ship, coordinating groups requires planning and realistic expectations",
      "markdown": "**Three families. Fourteen people total. Seven cabins spread across four decks. One cruise.**\n\nWe thought Star of the Seas would be perfect for our extended family reunion. Biggest ship in the world! Eight neighborhoods! Something for everyone! How could we possibly run out of space or activities?\n\nTurns out, logistics on a ship with 7,600 guests require military-level coordination.\n\nDay one, we tried to meet for breakfast. Half the family went to [Windjammer](/restaurants/windjammer.html) (buffet). The other half went to [AquaDome Market](/restaurants/aquadome-market.html) (food hall). My brother-in-law took his kids to [Surfside Eatery](/ships/rcl/star-of-the-seas.html) (family dining). We gave up and ate separately.\n\nThe pool deck was packed. Not \"busy\" — *packed*. We couldn't find fourteen lounge chairs together. Ever. The kids wanted the waterslides, but the lines were 45 minutes. The adults wanted quiet, but every pool area had music, activities, or hundreds of kids.\n\nReservations for shows and specialty dining required booking months in advance or racing to the app the moment they opened. We managed to get everyone into one [Lincoln Park Supper Club](/ships/rcl/star-of-the-seas.html) reservation by sheer luck and aggressive refreshing.\n\n**Here's what we learned:**\n\n1. **Use group messaging religiously.** WhatsApp, the Royal Caribbean app, something. Texting doesn't work at sea without expensive plans.\n\n2. **Plan one coordinated activity per day max.** Dinner together. That's it. Everything else, split up and report back.\n\n3. **Book everything early.** Shows, restaurants, excursions. The ship holds 7,600 people. Popular things sell out.\n\n4. **Embrace separation.** The teenagers wanted Thrill Island waterslides. The toddlers needed Surfside. The adults wanted The Hideaway adults-only area. That's fine. Meet for dinner.\n\n5. **Lower expectations.** You won't do everything together. You won't hit every venue. That's okay.\n\nBy day four, we stopped trying to coordinate everything and just... cruised. The kids did their thing. The adults did ours. We'd meet for dinner, share stories, laugh about the chaos. It was better that way.\n\nStar is an incredible ship. But it's still a ship. Physics exists. You can't have 14 people in 7 different cabins experiencing everything together without frustration.\n\nGo smaller if togetherness matters most. Or go Star and embrace beautiful, chaotic independence.\n\nSee our [group cruise planning](/planning.html) guide for more realistic expectations.",
      "author": {
        "name": "Constance W.",
        "location": ""
      }
    },
    {
      "title": "Solo on the World's Largest Ship",
      "persona_label": "Solo Cruiser",
      "intended_reader": "Solo travelers considering Star of the Seas",
      "core_insight": "Mega-ships offer solo travelers anonymity and endless activities, but require proactive socializing",
      "markdown": "**I booked Star of the Seas alone. Seven thousand guests, and I knew none of them.**\n\nMy friends thought I was crazy. \"You're going to be lonely,\" they warned. \"You'll feel like the only single person surrounded by families and couples.\" They weren't entirely wrong, but they weren't right either.\n\nHere's what I learned about solo cruising on a mega-ship:\n\n**The anonymity is liberating.** On a smaller ship, everyone knows you're alone by day two. On Star, I was just another face. I could eat breakfast alone without anyone asking where my companion was. I could sit at the bar without being pitied.\n\n**Activities are easy solo.** I didn't need a partner for Category 6 waterpark slides. I didn't need company for the [AquaDome](/ships/rcl/star-of-the-seas.html) shows. Crown's Edge was actually better solo — shorter wait, no one to coordinate with. Every pool, every venue, every deck was accessible without feeling awkward.\n\n**The single supplement hurts.** Royal Caribbean charges 200% fare for solo travelers in standard cabins (you pay for two people even though you're one). There are no dedicated solo cabins like Norwegian's Studio class. Budget accordingly.\n\n**Socializing requires effort.** Unlike smaller ships with community dinners or solo meetups, Star doesn't push connection. You have to seek it out. I found my people at the Schooner Bar (trivia nights), the casino (poker table banter), and the pool deck (random conversations).\n\n**Dining is flexible.** Main dining room? Request a table for one or ask to join others. [Windjammer buffet](/restaurants/windjammer.html)? Grab a seat anywhere. Specialty restaurants? Solo reservations are easy.\n\n**The best solo moments:**\n- Watching sunrise from Deck 17 with coffee in hand\n- Reading in Central Park while families rushed past\n- Category 6 slides at opening — no waiting, no negotiating\n- Late-night pizza alone, watching the wake\n\nWould I do it again? Absolutely. Star of the Seas gave me exactly what I needed: adventure without obligation, entertainment without commitment, and the freedom to be alone without being lonely.\n\nFor solo cruise tips, see our [solo cruising guide](/solo.html).",
      "author": {
        "name": "Marcus T.",
        "location": "Austin, TX"
      }
    },
    {
      "title": "Our Icon Class Honeymoon",
      "persona_label": "Honeymoon Story",
      "intended_reader": "Couples planning honeymoon cruises",
      "core_insight": "Star of the Seas offers luxury honeymoon experiences through Suite Class and specialty dining",
      "markdown": "**We got married on a Saturday and sailed on Star of the Seas that Sunday.**\n\nOur honeymoon plan was simple: seven nights of doing absolutely nothing. No itineraries. No obligations. Just each other, endless food, and the Caribbean sun.\n\nWe splurged on a Sky Class junior suite. The private Coastal Kitchen restaurant. The Solarium reserved for suite guests. Butler service. Espresso machine in the cabin. Worth every penny for a honeymoon.\n\nThe first thing our butler asked: \"Is this a celebration?\" When we told him honeymoon, he brought champagne within the hour. Our cabin had rose petals on the bed. Every dinner reservation noted our celebration. The crew made us feel special without being intrusive.\n\n**Our favorite honeymoon moments:**\n\n[Lincoln Park Supper Club](/ships/rcl/star-of-the-seas.html) was our anniversary-dinner-in-advance. Eight courses, live jazz, just the two of us in a corner booth. We held hands through the entire meal. The performers serenaded us. Pure romance.\n\nThe Hideaway — Star's adults-only sundeck — became our daily retreat. No kids screaming. No pool games. Just sun loungers, cocktails, and each other. We'd spend hours there, talking about our future, planning nothing.\n\nAquaDome shows surprised us. We expected cheesy. We got actual theater — acrobatics, water effects, storylines. We attended three performances. Each one was a date night.\n\nOur balcony at sunset. Every single evening. We'd order room service, sit outside, watch the horizon turn orange. My wife said those moments were her favorite part of the cruise.\n\n**Honeymoon tips for Star:**\n1. Book Suite Class if budget allows — the perks are worth it for special occasions\n2. Tell your butler and servers about your honeymoon — unexpected treats follow\n3. Make specialty dining reservations early — [Lincoln Park](/ships/rcl/star-of-the-seas.html) especially\n4. Skip the pool deck chaos — The Hideaway and Solarium are your friends\n5. Get balcony cabin — sunset views are non-negotiable for romance\n\nWe sailed expecting relaxation. We got magic. Star of the Seas might be the biggest ship afloat, but it made our honeymoon feel intimate.\n\nFor honeymoon cruise planning, see our [couples cruise guide](/packing-lists/couples-cruise.html).",
      "author": {
        "name": "Derek & Samantha R.",
        "location": "Charlotte, NC"
      }
    },
    {
      "title": "Cruising at 78: Star of the Seas with Mobility Challenges",
      "persona_label": "Elderly Traveler",
      "intended_reader": "Older travelers and those with mobility limitations",
      "core_insight": "Star's massive size means long walking distances, but accessibility features and thoughtful planning make it manageable",
      "markdown": "**I'm 78 years old with two knee replacements. My doctor said to stay active. My daughter said to try a cruise. I picked the biggest ship possible.**\n\nMy reasoning was simple: bigger ship means more elevators, more options, more space to rest. I wasn't entirely right, but I wasn't entirely wrong either.\n\n**The walking distance reality:**\n\nStar of the Seas is 1,198 feet long. End to end. That's four football fields. When my cabin was midship Deck 8 and [Windjammer](/restaurants/windjammer.html) was forward Deck 16, I faced a genuine journey. Some days my knees said no.\n\nThe elevators helped. Star has 20 of them, but they're often crowded. I learned to wait, to plan around elevator rush times, to sit when needed. The crew always let me board first when they noticed my careful walking.\n\n**What worked for me:**\n\n1. **Accessible cabin.** Wider door, roll-in shower, grab bars. I hadn't thought I needed it, but I did. The extra space for maneuvering was essential.\n\n2. **Mobility scooter rental.** Royal Caribbean rents them onboard or you can bring your own. I resisted at first — pride, I suppose. By day three, I rented one. Freedom returned.\n\n3. **Strategic timing.** I ate breakfast at 7am when venues were empty. I watched shows at matinees, not evenings. I used the pool during morning hours. Crowds exhausted me faster than walking.\n\n4. **Central Park for rest.** Star's Central Park neighborhood has benches, shade, and quiet. When my knees ached, I sat there. Trees, plants, no rushing crowds. Perfect for elderly bones.\n\n5. **Room service for rough days.** Some mornings, walking anywhere felt impossible. I ordered breakfast to my cabin. No shame in that.\n\n**What challenged me:**\n\n- Tender ports. Getting from ship to small boats to shore is difficult with limited mobility. I stayed onboard some port days.\n- Pool deck chaos. Not accessible-friendly when crowded. I avoided it entirely.\n- Long show lines. Standing hurts. I asked crew for priority seating — they always accommodated.\n\nMy daughter worried I'd picked the wrong ship. Too big, too busy, too much walking. But Star of the Seas surprised me. The crew was attentive. The accessibility features were genuine. I just had to ask for help.\n\nAt 78, I rode a waterslide. Slowly, carefully, with crew assistance. But I did it.\n\nFor accessibility cruise planning, see our [accessible cruising guide](/solo/accessible-cruising.html).",
      "author": {
        "name": "Dorothy P.",
        "location": "Sarasota, FL"
      }
    },
    {
      "title": "My First Cruise Without Richard",
      "persona_label": "Widow/Widower Story",
      "intended_reader": "Those cruising alone after losing a spouse",
      "core_insight": "Mega-ships offer distraction and anonymity that can help with grief, but triggers appear unexpectedly",
      "markdown": "**Richard and I were supposed to cruise Star of the Seas together. He died four months before the sailing.**\n\nI almost canceled. Every time I looked at our booking, I saw his name next to mine. The cabin we'd chosen together. The excursions he'd researched. The specialty dinner he'd wanted to try.\n\nMy grief counselor suggested I go anyway. \"It might hurt,\" she said. \"But so does staying home staring at his empty chair.\"\n\nI changed the cabin to a single (full fare — ouch). I kept some of his excursion bookings. I went.\n\n**The first day was hardest:**\n\nBoarding alone when we should have been holding hands. The cabin that felt enormous without him. The couples everywhere — on the pool deck, in the restaurants, at the shows. I saw what we would have been.\n\nI cried in Central Park on night one. Surrounded by trees, in the middle of the world's largest cruise ship, I sobbed. A crew member noticed, brought me tissues, asked if I was okay. I told him my husband should be here. He said nothing — just sat with me until I was ready to walk again.\n\n**What helped:**\n\nThe [AquaDome shows](/ships/rcl/star-of-the-seas.html) let me feel something besides grief. For two hours, I was transported. I wasn't a widow watching a show alone — I was just watching a show.\n\nCategory 6 waterslides shocked me into joy. Richard hated waterslides. Too fast, too scary, not his style. But I'd always wanted to try them. Going alone, without his gentle teasing, I finally did. I screamed the whole way down. And laughed. First genuine laugh in months.\n\nMy anniversary dinner at [Lincoln Park Supper Club](/ships/rcl/star-of-the-seas.html) was bittersweet. We should have been there together. The empty chair hurt. But the jazz reminded me of our first date. The wine reminded me of our wedding. I toasted to him, alone, and felt him close.\n\n**What triggered grief unexpectedly:**\n\n- The formal night couples dancing. I left early.\n- Seeing the casino where he would have played poker. I walked past.\n- Sunset from the balcony — our ritual on every cruise. I made myself do it anyway.\n\n**My advice to widows and widowers considering a cruise:**\n\nGo. But go gently. Bring tissues. Allow yourself to cry. Allow yourself to laugh. Both are honoring your love.\n\nBig ships offer anonymity. No one expects you to be okay. No one tracks your emotional state. You can grieve privately, heal privately, and find unexpected joy privately.\n\nRichard would have loved Star of the Seas. I'm glad I experienced it for both of us.\n\nFor grief and solo travel, see our [In the Wake of Grief](/solo/in-the-wake-of-grief.html) guide.",
      "author": {
        "name": "Patricia B.",
        "location": "Richmond, VA"
      }
    },
    {
      "title": "Accessible Stateroom Review: What Really Works",
      "persona_label": "Accessible Travel",
      "intended_reader": "Travelers needing wheelchair-accessible accommodations",
      "core_insight": "Star's accessible cabins are well-designed, but advance planning is essential for smooth sailing",
      "markdown": "**I use a power wheelchair daily. I've cruised on twelve ships. Star of the Seas is the most accessible I've experienced.**\n\nBefore booking, I was skeptical. Mega-ships sound impressive, but size doesn't always mean accessibility. I've sailed on ships with \"accessible\" cabins that barely fit my chair, elevators that couldn't handle peak times, and crew who didn't know how to help.\n\nStar surprised me.\n\n**The accessible cabin (Category 8D - Accessible Ocean View Balcony):**\n\nThe door was genuinely wide — 32 inches, enough for any wheelchair. The bathroom had a roll-in shower with bench, grab bars at correct heights, and enough turning radius for my power chair. The balcony threshold was ramped, not stepped. The closet had lowered rods I could actually reach.\n\nMy only complaint: the bed height. It was adjustable, but the lowest setting was still higher than ideal for transfers. I managed, but someone with less upper body strength might struggle.\n\n**Ship accessibility:**\n\nAll 20 elevators accommodate wheelchairs, but during peak times (post-show, dinner hours), waits were long. I learned to use elevators at less-traveled locations — the ones near the spa, the ones near the suites — instead of the main ones near the atrium.\n\nDeck surfaces were smooth throughout. No problematic thresholds. Pool deck access was ramped. Central Park paths were paved. The theater had designated wheelchair spaces with good sightlines.\n\n**Category 6 waterpark:**\n\nYes, I went. Not the slides — those require walking — but the pool areas. The family areas have zero-entry access. I rolled in, parked my chair at the edge, and swam. Crew were attentive without hovering.\n\n**Dining accessibility:**\n\n[Windjammer buffet](/restaurants/windjammer.html) was challenging. Narrow aisles, heavy crowds, stations I couldn't reach. I asked crew to assist — they did, cheerfully. [Main dining room](/restaurants/mdr.html) was better: table with removable chair, plenty of space, no issues.\n\n**What I wish I'd known:**\n\n1. Book accessible cabin early — they sell out fast\n2. Register with Access Department before sailing — they coordinate everything\n3. Bring your own shower chair if you prefer it — ship ones are generic\n4. Request restaurant tables in advance — not all locations work for wheelchairs\n5. Tender ports are difficult — consider skipping or booking accessible excursions only\n\nStar of the Seas proved that mega-ships can do accessibility right. Not perfect, but genuinely thoughtful. I'll sail again.\n\nFor accessible cruise planning, see our [accessible cruising guide](/solo/accessible-cruising.html).",
      "author": {
        "name": "William K.",
        "location": "Denver, CO"
      }
    },
    {
      "title": "Surfside with Three Kids Under Ten",
      "persona_label": "Family Review",
      "intended_reader": "Families with young children considering Star of the Seas",
      "core_insight": "Surfside neighborhood is purpose-built for families and delivers on its promise of kid-focused cruising",
      "markdown": "**Ages 8, 6, and 4. One week. The world's largest cruise ship. What could possibly go wrong?**\n\nEverything, I thought. Three young kids on a mega-ship with 7,600 other passengers? Chaos waiting to happen.\n\nBut Royal Caribbean designed Surfside specifically for families like ours. And it worked.\n\n**Surfside basics:**\n\nStar's Surfside neighborhood is on Deck 7, forward. It includes Surfside Eatery (family-friendly food court), Splashaway Bay (water playground), Adventure Ocean (kids club), and family staterooms designed for five people.\n\nWe booked a Surfside Family Suite — two bedrooms, balcony overlooking Splashaway Bay, room for all five of us without feeling cramped. Worth the upgrade for a family our size.\n\n**What our kids loved:**\n\n1. **Splashaway Bay all day.** My 4-year-old would have lived there if we'd let her. Water jets, splash pads, mini slides, shallow wading areas. Safe for young kids, entertaining for older ones.\n\n2. **Adventure Ocean programming.** Free kids club with activities by age group. My 8-year-old did science experiments. My 6-year-old made slime. My 4-year-old had supervised play. Parents got breaks.\n\n3. **Category 6 water park.** The older kids were tall enough for the family raft slides. We rode together, screaming, laughing. My 4-year-old cheered from the sidelines.\n\n4. **Surfside Eatery dining.** Kid-friendly food (chicken nuggets, pizza, mac and cheese) without the chaos of [Windjammer](/restaurants/windjammer.html). We ate breakfast there daily.\n\n5. **In-cabin activities.** The room had a gaming console, kid-friendly movies, and a TV screen with ship info. Rainy day backup plan: successful.\n\n**Challenges:**\n\n- **Nap time logistics.** My 4-year-old still naps. Coordinating rest time while siblings wanted pool time required splitting up.\n- **Bedtime negotiation.** Ship activities run late. Kids wanted to stay up. We compromised: one late night, one early night, repeat.\n- **Pool deck crowds.** Main pool was always packed. We stuck to Surfside's Splashaway Bay — less crowded, more kid-focused.\n\n**Parent survival tips:**\n\n1. Book Adventure Ocean for evening sessions — free babysitting so parents can have dinner alone\n2. Eat early dinners (5:30pm seating) to avoid exhausted-child meltdowns\n3. Bring glow sticks and pool toys — entertainment during cabin downtime\n4. Use the Royal Caribbean app to track each other — ship is huge, kids wander\n5. Lower expectations — you won't do everything, and that's okay\n\nSurfside made this cruise possible. Without a family-dedicated neighborhood, I'd have been chasing kids through 7,000 strangers. Instead, I was relaxing while they played safely nearby.\n\nFor family cruise planning, see our [family packing list](/packing-lists.html).",
      "author": {
        "name": "Jennifer & Mark H.",
        "location": "Tampa, FL"
      }
    }
  ],
  "last_updated": "2025-12-27"
}