{
  "version": "v2.257",
  "ship_name": "Grandeur of the Seas",
  "cruise_line": "Royal Caribbean",
  "meta": {
    "disclaimer_aggregate": "Full disclosure: Until we complete an in-wake sailing on this ship, some Logbook entries are vetted aggregate perspectives — drawn from firsthand passenger accounts, crew soundings, and public voyage data — trimmed and edited to our standards.",
    "disclaimer_authored": "Authored entries reflect an in-wake sailing by our editor or contributing writer. These notes are firsthand accounts, written from experience aboard the vessel and held to the same editorial standards as our aggregate soundings.",
    "watch_nights": 12
  },
  "personas": [
    {
      "id": "p0-ken",
      "is_author": true,
      "persona_label": "Firsthand sailing account from Ken — 12 nights aboard Grandeur of the Seas, reflecting crew excellence and classic Royal warmth.",
      "title": "Grandeur of the Seas: A Personal Logbook from the Wake",
      "markdown": "## Authored Entry\nI have personally sailed *Grandeur of the Seas* for twelve nights. These reflections come from that voyage — written from experience aboard the vessel and held to our editorial standards.\n\n### Stateroom & Views\nWe sailed *Grandeur of the Seas* in an ocean-view stateroom — bright, with views of epic sunrises; a great way to start each morning.\n\n### Dining & Service\nDining was a highlight: **Chops Grille** delivered a fantastic filet, and the **Main Dining Room** impressed with thoughtful pacing and spot-on recommendations.\nService all around was warm and proactive: Miguel (Philippines) at Chops provided truly excellent, personable care; at Guest Services, Vincent D’Cruz resolved our requests quickly and professionally; and in **Windjammer**, Vergel noticed a morning pattern and brought fresh eggs to our table before we asked — a small kindness that says a lot about this crew.\n\nWe tried **Taste of Royal**: the tuna tartare was tasty; shrimp could have used a touch more heat; the fried cheesecake stole the show. (Pro tip: the Saint Peter’s spritzer really pops if you squeeze the orange wedge.)\n\n### Ports of Call\nOur Eastern Caribbean itinerary hit Aruba, Curaçao, and Bonaire. We snorkeled in Aruba (hello, flamingos), toured the Curaçao distillery and a sun-warmed cave, and in Bonaire took a quick taxi to [Buddy Dive Center](https://buddydive.com/) — great value rentals (as of Nov 2024), clear water, and a drop-off reef that rewards confident snorkelers and divers. Labadee beach time was still fun despite weather nixing our planned dive excursion. Local artists can be **very** assertive; a firm “no, thanks” works in at least three languages.\n\n### Voyage Tips\n**Drink Packages:** Deluxe Beverage Package (~$60/day), Refreshment Package, Soda Package.\n**Packing:** Shawl for chilly theater nights, swimwear for pool deck, comfortable shoes for shore tours.\n\n### Embarkation & Entertainment\nEmbark and debark in Fort Lauderdale were smooth, though port driving/parking can be confusing and pricey — off-port parking plus a taxi often beats the on-site rates.\n\nIn the evenings, we caught *Broadway Rhythm & Rhyme* and *Tango Buenos Aires* — the latter stood out with world-class dancing and vocals.\n\n### Final Thoughts\nBottom line: *Grandeur* delivers that extra dose of personal connection big ships can’t replicate, backed by classic Royal fun and friendly, attentive service."
    }
  ]
}
