{
  "ship": "Queen Mary 2",
  "ship_class": "Queen Mary 2",
  "cruise_line": "Cunard Line",
  "last_updated": "2026-01-20",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "The Last Ocean Liner",
      "persona_label": "Maritime Heritage",
      "persona": "heritage",
      "intended_reader": "Travelers interested in maritime history and tradition",
      "core_insight": "Queen Mary 2 is the only true transatlantic ocean liner in service, built for the crossing rather than cruising",
      "markdown": "**Queen Mary 2 is not a cruise ship. She is an ocean liner—the last one still in scheduled transatlantic service.**\n\nThe distinction matters profoundly. Cruise ships are built for warm-weather destinations, designed to encourage passengers outdoors. Ocean liners are built to cross oceans in any weather, designed to provide sanctuary from the North Atlantic's fury.\n\nQM2's hull is reinforced to handle waves that would damage ordinary cruise ships. Her bow rises higher than any competitor's. Her draft runs deeper. She was designed not to float between Caribbean ports but to cross the Atlantic in any season, delivering passengers from Southampton to New York as Cunard has done for 185 years.\n\nWhen you book a Transatlantic Crossing on QM2, you're not taking a cruise—you're participating in maritime tradition stretching back to Britannia in 1840. No flights. No intermediate ports. Just six days of ocean, exactly as travelers experienced before commercial aviation.\n\nFor travelers who understand what ocean liners meant: Queen Mary 2 is your only opportunity to experience it. She's not nostalgic recreation. She's continuation.",
      "author": {
        "name": "Professor Richard Morrison, Maritime Historian",
        "location": "Southampton, UK"
      }
    },
    {
      "title": "Crossing Rather Than Cruising",
      "persona_label": "Transatlantic Experience",
      "persona": "adventure",
      "intended_reader": "Travelers considering transatlantic crossings",
      "core_insight": "The Transatlantic Crossing creates fundamentally different vacation experience than Caribbean cruising",
      "markdown": "**I've cruised the Caribbean dozens of times. My first QM2 Transatlantic Crossing was different in ways I didn't expect.**\n\nNo ports mean no shore excursions. Six sea days demand self-entertainment. The realization hits around day two: you're in the middle of an ocean with nothing to do except what the ship provides.\n\nAnd QM2 provides magnificently.\n\nThe library holds 10,000 books—I read three. The Planetarium projects the same stars ancient mariners used for navigation. The lectures from Cunard Insights speakers covered everything from maritime history to astronomy. The Canyon Ranch Spa filled hours I didn't know I had.\n\nDinner became the day's anchor. Dress code mattered—two formal nights, elegant casual otherwise. The Britannia Restaurant felt like proper dining, not cruise ship feeding. Conversations developed over courses because nobody rushed to evening shows.\n\nBy day five, I understood what travelers in the 1930s knew: the crossing is the destination. The ocean becomes companion rather than obstacle. Time restructures around ship rhythms.\n\nFor travelers seeking escape: Transatlantic Crossing on QM2 delivers genuine disconnection. No ports to distract. No destinations to anticipate. Just ocean, ship, and transformation.",
      "author": {
        "name": "Elizabeth Crawford",
        "location": "Boston, MA"
      }
    },
    {
      "title": "Cunard Formality: What to Actually Expect",
      "persona_label": "Dress Code Reality",
      "persona": "first-timer",
      "intended_reader": "First-time Cunard guests uncertain about formality expectations",
      "core_insight": "Cunard formality enhances rather than restricts the experience for those who embrace it",
      "markdown": "**People warned me Cunard was stuffy. They were wrong—but they were right that it's different.**\n\nYes, dress codes exist. Gala nights require formal wear—tuxedos or dark suits for men, gowns or cocktail dresses for women. But the formality isn't pretension. It's theater. It's transformation. It's becoming someone who dresses for dinner because dinner deserves it.\n\nI bought my first tuxedo for this cruise. Standing in front of the mirror on Gala Night One, wearing proper attire for the first time since my wedding, I felt... elevated. The man looking back wasn't someone who eats quickly and returns to screens. He was someone who dines.\n\nThe Queen's Room maintains formal atmosphere throughout the voyage. Afternoon tea arrives on proper china with proper sandwiches and proper service. Again: not stuffy, but deliberate. A choice to experience elegance that modern life rarely offers.\n\nCunard formality rewards rather than restricts. If you resist it, every dress code feels like imposition. If you embrace it, every dress code becomes permission to be your most refined self.\n\nFor first-timers nervous about Cunard expectations: bring the clothes, bring the attitude, discover that formal can feel liberating rather than constraining.",
      "author": {
        "name": "James Thornton",
        "location": "Chicago, IL"
      }
    },
    {
      "title": "Kennels at Sea: Crossing with Our Dog",
      "persona_label": "Pet Travel",
      "persona": "family",
      "intended_reader": "Pet owners considering transatlantic travel options",
      "core_insight": "QM2's kennels offer the only way to cross the Atlantic with your pet without cargo hold transport",
      "markdown": "**We moved to London for work. Winston, our corgi, couldn't fly cargo. Queen Mary 2 saved our family.**\n\nQM2 maintains kennels on Deck 12—the only transatlantic passenger vessel allowing pets. The regulations are strict: UK-to-US sailings only (quarantine rules), advance veterinary certification, limited spaces that book months ahead.\n\nWinston's kennel was more comfortable than I expected. Climate-controlled, properly sized, maintained by dedicated staff. We visited four times daily—morning, midday, afternoon, evening—plus the outdoor exercise area on deck.\n\nThe kennel staff knew Winston's name by day two. They reported his meals, his mood, his behavior between our visits. The care was genuine, not perfunctory.\n\nWatching Winston explore the deck—salt air in his fur, Atlantic spray nearby—was worth every moment of logistics. He crossed an ocean on a ship, not terrified in a cargo hold. He arrived in America calm rather than traumatized.\n\nFor pet families relocating: QM2's kennels aren't luxury pet accommodations. They're humane transport for animals who matter too much for cargo holds. The experience costs more than flights. The peace of mind is priceless.",
      "author": {
        "name": "The Reynolds Family",
        "location": "London, UK / New York, NY"
      }
    },
    {
      "title": "The Only Ship Her Size with a Real Purpose",
      "persona_label": "Design Appreciation",
      "persona": "design",
      "intended_reader": "Travelers interested in ship design and naval architecture",
      "core_insight": "QM2's design reflects specific ocean liner requirements that cruise ships don't address",
      "markdown": "**At 151,400 gross tons, Queen Mary 2 was the largest ocean liner ever built. Her design serves purposes no cruise ship matches.**\n\nThe bow rises 75 feet from waterline to deck—necessary for North Atlantic waves that would breach lower profiles. The hull extends 23 feet deeper than typical cruise ships—providing stability in swells that would roll lesser vessels.\n\nFour diesel engines and two gas turbines generate 157,000 horsepower—enough to maintain schedule in conditions that force other ships to slow. The pod propulsion system provides maneuverability in New York Harbor that her size would otherwise prevent.\n\nIndoors, the design reflects crossing reality. Enclosed promenades allow walking regardless of weather. The Chart Room provides protected ocean viewing. Public spaces cluster toward the center where motion is minimal.\n\n[Queen Victoria](/ships/cunard/queen-victoria.html), [Queen Elizabeth](/ships/cunard/queen-elizabeth.html), and [Queen Anne](/ships/cunard/queen-anne.html) are lovely cruise ships. Queen Mary 2 is something else: a purpose-built ocean liner designed for a specific job. Every design choice reflects that purpose.\n\nFor design enthusiasts: QM2 rewards study. She's not oversized cruise ship but purpose-built tool for a demanding task. The engineering is elegant.",
      "author": {
        "name": "Naval Architecture Review",
        "location": "London, UK"
      }
    }
  ]
}
