{
  "meta": {
    "version": "1.0.0",
    "updated": "2026-02-01",
    "source": "Carnival Cruise Line official menu PDFs from carnival.com — primary source transcription",
    "line": "carnival",
    "lineLabel": "Carnival Cruise Line"
  },
  "venues": [
    {
      "slug": "main-dining-room",
      "name": "Main Dining Room",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Carnival's complimentary main dining room serving multi-course breakfast and dinner. Dinner features rotating nightly menus with appetizers, entrees, Emeril's Bistro selections, everyday classics, and desserts. Optional premium steakhouse selections available for a surcharge. Available as Your Time Dining (flexible) or Early/Late set seating.",
      "premium": false
    },
    {
      "slug": "fahrenheit-555",
      "name": "Fahrenheit 555 Steakhouse",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Carnival's premium steakhouse featuring USDA Prime beef aged 28 days, with starters, salads, prime cuts from the grill, chef specialties including lobster tail and Dover sole, and signature cocktails. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "cucina-del-capitano",
      "name": "Cucina del Capitano",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Italian family-style restaurant serving antipasto, house-made pasta, and Italian entrees at dinner (cover charge). Complimentary pasta bar at lunch (12–2:30pm). Some dishes shared with Il Viaggio on Excel-class ships.",
      "premium": true
    },
    {
      "slug": "jiji-asian-kitchen",
      "name": "JiJi Asian Kitchen",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Pan-Asian restaurant featuring Chinese, Vietnamese, and Thai-inspired dishes including braised pork belly, Kung Pao chicken, Singapore chili shrimp, noodles, and fried rice. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "bonsai-sushi",
      "name": "Bonsai Sushi",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Japanese sushi bar and izakaya serving nigiri, sashimi, specialty rolls, yakitori skewers, noodle bowls, and izakaya plates like teriyaki filet mignon and miso salmon. A la carte pricing.",
      "premium": true
    },
    {
      "slug": "bonsai-teppanyaki",
      "name": "Bonsai Teppanyaki",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Interactive teppanyaki dining with set multi-course meals prepared tableside on a flat-top grill. Includes soup or salad, starters, choice of protein with fried rice and vegetables, and green tea ice cream cake. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "chibang",
      "name": "Chibang!",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Dual-concept Chinese and Mexican restaurant created by Chef Emeril Lagasse. Dinner features full Chinese and Mexican sections plus steakhouse selections. Lunch offers noodle bowls and Mexican bowls. Cover charge applies at dinner.",
      "premium": true
    },
    {
      "slug": "rudis-seagrill",
      "name": "Rudi's Seagrill",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Premium seafood restaurant by Chef Rudi Sodamin on Excel-class ships (Mardi Gras, Celebration, Jubilee). Features oysters, lobster tail, Dover sole, crab cakes, halibut, and prime NY strip. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "il-viaggio",
      "name": "Il Viaggio",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Elevated regional Italian restaurant on Excel-class ships featuring dishes from Lombardy, Campania, Sicily, Tuscany, Liguria, and other Italian regions. Antipasti, house-made pasta, seafood, and traditional desserts. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "big-chicken",
      "name": "Big Chicken",
      "category": "dining",
      "subcategory": "casual",
      "description": "Shaquille O'Neal's complimentary chicken sandwich restaurant serving crispy and grilled chicken sandwiches, hand-breaded chicken strips, and breakfast items. Signature sandwiches include the M.D.E., Shaq Attack, Uncle Jerome, and The Big Aristotle.",
      "premium": false
    },
    {
      "slug": "blue-iguana-cantina",
      "name": "Blue Iguana Cantina",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary poolside Mexican cantina serving tacos (chicken, pork, fish) and build-your-own burritos at lunch. Breakfast features arepas and huevos rancheros.",
      "premium": false
    },
    {
      "slug": "guys-pig-and-anchor",
      "name": "Guy's Pig & Anchor Smokehouse|Brewhouse",
      "category": "dining",
      "subcategory": "casual",
      "description": "Guy Fieri's BBQ venue with two service modes. Complimentary lunch features meats smoked in-house over hickory wood with classic sides. Dinner is a paid smokehouse experience with 18-hour brisket, St. Louis ribs, prime rib, appetizers, desserts, and Parched Pig craft brews.",
      "premium": false
    },
    {
      "slug": "seafood-shack",
      "name": "Seafood Shack",
      "category": "dining",
      "subcategory": "casual",
      "description": "New England-style seafood counter serving lobster rolls, fish and chips, clam chowder, crab cakes, fried seafood platters, and market-priced steamed lobster, snow crab, and oysters. A la carte pricing.",
      "premium": true
    },
    {
      "slug": "pizzeria-del-capitano",
      "name": "Pizzeria del Capitano",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary 24-hour pizzeria serving five varieties: Margherita, Funghi, Pepperoni, Quattro Formaggi, and Prosciutto.",
      "premium": false
    },
    {
      "slug": "the-deli",
      "name": "The Deli",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary deli counter serving 8 hot sandwiches (buffalo chicken, meatball, Reuben, Cuban, steak & cheese, hot dog, veggie burger) and 6 cold sandwiches (BLT, turkey & Swiss, tuna, chicken salad, and more) with fries and cole slaw.",
      "premium": false
    },
    {
      "slug": "room-service",
      "name": "Room Service",
      "category": "dining",
      "subcategory": "room-service",
      "description": "In-cabin dining available nearly 24 hours. Breakfast (6–10am) includes continental items and paid breakfast sandwiches. Leisure dining (10am–6am) features salads, sandwiches, wings, tenders, pizza, and desserts. Some items carry a surcharge.",
      "premium": false
    },
    {
      "slug": "guys-burger-joint",
      "name": "Guy's Burger Joint",
      "category": "dining",
      "subcategory": "casual",
      "description": "Guy Fieri's complimentary poolside burger restaurant serving hand-crafted burgers with a choice of toppings and signature sauces. One of the most popular casual dining spots in the fleet.",
      "premium": false
    },
    {
      "slug": "emerils-bistro",
      "name": "Emeril's Bistro 1396",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Chef Emeril Lagasse's signature restaurant on Excel-class ships (Mardi Gras, Celebration, Jubilee) featuring New Orleans-inspired cuisine. Named for Emeril's original restaurant address. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "lido-marketplace",
      "name": "Lido Marketplace",
      "category": "dining",
      "subcategory": "casual",
      "description": "Carnival's complimentary buffet restaurant serving breakfast, lunch, dinner, and late-night snacks with multiple food stations and international cuisine options.",
      "premium": false
    },
    {
      "slug": "javablue-cafe",
      "name": "JavaBlue Café",
      "category": "dining",
      "subcategory": "cafe",
      "description": "Specialty coffee bar serving espresso drinks, lattes, cappuccinos, teas, and pastries. Beverages are a la carte and not included in the cruise fare.",
      "premium": true
    },
    {
      "slug": "alchemy-bar",
      "name": "Alchemy Bar",
      "category": "bars",
      "subcategory": "bar",
      "description": "Carnival's signature craft cocktail bar where mixologists create custom drinks using pharmacy-themed ingredients. One of the highest-rated bars in the fleet.",
      "premium": false
    },
    {
      "slug": "mongolian-wok",
      "name": "Mongolian Wok",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary stir-fry station where guests choose their own vegetables, proteins, noodles, and sauces to be prepared fresh by wok chefs. Located in or near the Lido Marketplace.",
      "premium": false
    },
    {
      "slug": "chefs-table",
      "name": "Chef's Table",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Intimate multi-course dining experience led by the ship's master chef. Begins with a galley tour and cocktails, followed by a curated tasting menu. Limited seating, reservation required. Cover charge applies.",
      "premium": true
    }
  ]
}
