{
  "meta": {
    "version": "1.0.0",
    "updated": "2026-01-31",
    "source": "MSC Cruises official site, cruise expert reviews, and MSC-restaurants.json cross-reference — 3+ source agreement",
    "line": "msc",
    "lineLabel": "MSC Cruises"
  },
  "venues": [
    {
      "slug": "main-dining-room",
      "name": "Main Dining Room",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "MSC's complimentary main dining room serving multi-course breakfast and dinner with rotating menus. Available on every ship in the fleet with set-time or flexible dining options. Features Italian-inspired cuisine alongside international dishes.",
      "premium": false
    },
    {
      "slug": "marketplace-buffet",
      "name": "Marketplace Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "MSC's complimentary buffet restaurant on Meraviglia, Seaside, Seashore, and World-class ships. Multiple international food stations serving breakfast, lunch, dinner, and late-night snacks with live cooking stations.",
      "premium": false
    },
    {
      "slug": "butchers-cut",
      "name": "Butcher's Cut",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "MSC's signature premium steakhouse featuring dry-aged USDA Prime beef, Australian Wagyu, and classic steakhouse sides. Intimate setting with dark wood and leather decor. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "kaito-sushi-bar",
      "name": "Kaito Sushi Bar",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Japanese sushi bar serving fresh nigiri, sashimi, specialty rolls, and bento boxes. Available on most MSC ships with a la carte pricing. Features both counter and table seating.",
      "premium": true
    },
    {
      "slug": "kaito-teppanyaki",
      "name": "Kaito Teppanyaki",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Interactive Japanese teppanyaki dining with chefs preparing multi-course meals tableside on flat-top grills. Set menu includes soup, starters, choice of protein with fried rice and vegetables. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "hola-tacos-cantina",
      "name": "Hola! Tacos & Cantina",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Mexican restaurant and cantina serving tacos, burritos, guacamole, and Latin-inspired dishes with a selection of tequilas and margaritas. A la carte pricing with vibrant, colorful decor.",
      "premium": true
    },
    {
      "slug": "ocean-cay",
      "name": "Ocean Cay",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Premium seafood restaurant named after MSC's private island in the Bahamas. Fresh fish, shellfish, and ocean-inspired dishes in an elegant nautical setting. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "le-grill",
      "name": "Le Grill",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "French-inspired grill restaurant serving premium meats, seafood, and classic French dishes. Available on MSC Euribia and MSC World America. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "eataly",
      "name": "Eataly",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "First Eataly at sea, exclusively on MSC World America. Italian food marketplace featuring fresh pasta, pizza from wood-fired ovens, gelato, and specialty Italian products. Multiple dining stations with a la carte pricing.",
      "premium": true
    },
    {
      "slug": "jean-philippe-chocolat",
      "name": "Jean Philippe Chocolat & Café",
      "category": "dining",
      "subcategory": "cafe",
      "description": "Artisan chocolate and pastry café by world-record-holding chocolatier Jean Philippe Maury, exclusively on MSC World America. Handcrafted chocolates, crepes, pastries, and specialty coffees. A la carte pricing.",
      "premium": true
    },
    {
      "slug": "chefs-garden-kitchen",
      "name": "Chef's Garden Kitchen",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Farm-to-table concept restaurant on MSC World Europa featuring seasonal produce, vegetable-forward dishes, and sustainable ingredients. Intimate setting with open kitchen. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "la-pescaderia",
      "name": "La Pescaderia",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Spanish-inspired seafood restaurant on MSC World Europa serving fresh catches, paella, ceviche, and Mediterranean fish dishes. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "galaxy-restaurant",
      "name": "Galaxy Restaurant",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Premium specialty restaurant available on MSC Divina and MSC Preziosa. Elevated international cuisine in an elegant setting with panoramic ocean views. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "indochine",
      "name": "Indochine",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Pan-Asian restaurant on MSC Virtuosa featuring Vietnamese, Thai, and Southeast Asian-inspired cuisine with wok dishes, pho, spring rolls, and curries. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "atelier-bistrot",
      "name": "Atelier Bistrot",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "French bistro-style restaurant on MSC Grandiosa serving classic French dishes, charcuterie, and wine pairings in a Parisian-inspired setting. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "la-cantina-di-bacco",
      "name": "La Cantina di Bacco",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Italian wine cellar restaurant on MSC Fantasia offering regional Italian dishes paired with curated wines. Intimate dining in a rustic Tuscan-inspired setting. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "venchi-1878",
      "name": "Venchi 1878",
      "category": "dining",
      "subcategory": "cafe",
      "description": "Premium Italian chocolate and gelato boutique on MSC Seaside and MSC Seaview. Handcrafted gelato, chocolate pralines, hot chocolate, and specialty confections. A la carte pricing.",
      "premium": true
    },
    {
      "slug": "le-bistrot",
      "name": "Le Bistrot",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "French-inspired specialty restaurant on MSC Lirica featuring classic bistro cuisine with refined presentation. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "oriental-plaza",
      "name": "Oriental Plaza",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Asian fusion restaurant on MSC Magnifica serving Chinese, Thai, and Japanese-inspired dishes in an Eastern-themed setting. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "shanghai-chinese-restaurant",
      "name": "Shanghai Chinese Restaurant",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Chinese specialty restaurant on MSC Orchestra featuring authentic Shanghai and Cantonese cuisine with traditional preparation techniques. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "surf-and-turf",
      "name": "Surf & Turf",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Premium steak and seafood restaurant on MSC Armonia combining land and sea dishes in an intimate setting. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "sea-pavilion",
      "name": "Sea Pavilion",
      "category": "dining",
      "subcategory": "restaurant",
      "description": "Asian-inspired specialty restaurant on MSC Splendida featuring sushi, seafood, and Far Eastern cuisine in an elegant waterfront setting. Cover charge applies.",
      "premium": true
    },
    {
      "slug": "caffe-san-marco",
      "name": "Caffè San Marco",
      "category": "dining",
      "subcategory": "cafe",
      "description": "Italian-style café on MSC Armonia serving espresso drinks, pastries, gelato, and light snacks in a Venetian-inspired piazza setting. A la carte pricing.",
      "premium": true
    },
    {
      "slug": "gelateria-italiana",
      "name": "Gelateria Italiana",
      "category": "dining",
      "subcategory": "cafe",
      "description": "Traditional Italian gelato parlor serving handmade gelato and sorbetto in a variety of classic flavors. Available on MSC Armonia and MSC Sinfonia. A la carte pricing.",
      "premium": true
    },
    {
      "slug": "la-boca-grill",
      "name": "La Boca Grill",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary Argentinian-inspired grill on MSC World America serving flame-grilled meats, chorizo, and South American flavors at the poolside area.",
      "premium": false
    },
    {
      "slug": "luna-park-pizza-burger",
      "name": "Luna Park Pizza & Burger",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary casual dining on MSC World America serving hand-tossed pizza and gourmet burgers with a variety of toppings and sides.",
      "premium": false
    },
    {
      "slug": "promenade-bites",
      "name": "Promenade Bites",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary quick-service venue on MSC World America's indoor promenade offering light snacks, sandwiches, and grab-and-go items throughout the day.",
      "premium": false
    },
    {
      "slug": "the-harbour-bar-bites",
      "name": "The Harbour Bar & Bites",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary casual dining and bar on MSC World America with waterfront views serving light bites, snacks, and beverages in a relaxed harbor setting.",
      "premium": false
    },
    {
      "slug": "la-pergola-buffet",
      "name": "La Pergola Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Armonia with multiple international food stations serving breakfast, lunch, dinner, and snacks.",
      "premium": false
    },
    {
      "slug": "lighthouse-restaurant",
      "name": "Lighthouse Restaurant",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Bellissima with panoramic ocean views and international cuisine stations. Open for breakfast, lunch, dinner, and late-night snacks.",
      "premium": false
    },
    {
      "slug": "calumet-manitoba-buffet",
      "name": "Calumet & Manitoba Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Divina with themed food stations serving international cuisine from breakfast through late-night.",
      "premium": false
    },
    {
      "slug": "zanzibar-buffet",
      "name": "Zanzibar Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Fantasia featuring international food stations and themed dining areas. Open for all meals.",
      "premium": false
    },
    {
      "slug": "la-bussola-restaurant",
      "name": "La Bussola Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Lirica offering Italian and international cuisine with table service in an intimate setting.",
      "premium": false
    },
    {
      "slug": "lippocampo-restaurant",
      "name": "L'Ippocampo Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Lirica serving buffet-style breakfast and lunch with table-service dinner featuring Mediterranean cuisine.",
      "premium": false
    },
    {
      "slug": "sahara-buffet",
      "name": "Sahara Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Magnifica with multiple food stations serving international cuisine from morning through late evening.",
      "premium": false
    },
    {
      "slug": "gli-archi-buffet",
      "name": "Gli Archi Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Musica with Italian-inspired arched decor and international cuisine stations for all meals.",
      "premium": false
    },
    {
      "slug": "la-caravella-restaurant",
      "name": "La Caravella Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Opera with table service offering Italian and international cuisine in a classic setting.",
      "premium": false
    },
    {
      "slug": "lapprodo-restaurant",
      "name": "L'Approdo Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Opera serving Mediterranean-inspired cuisine with table service in an elegant atmosphere.",
      "premium": false
    },
    {
      "slug": "villa-verde-buffet",
      "name": "Villa Verde Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Orchestra and MSC Splendida with garden-themed decor and international cuisine stations.",
      "premium": false
    },
    {
      "slug": "villa-pompeiana-buffet",
      "name": "Villa Pompeiana Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Poesia with Roman-inspired decor and international food stations for breakfast, lunch, and dinner.",
      "premium": false
    },
    {
      "slug": "inca-maya-buffet",
      "name": "Inca & Maya Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Preziosa with Latin American-themed decor and diverse international cuisine stations.",
      "premium": false
    },
    {
      "slug": "il-covo-restaurant",
      "name": "Il Covo Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Sinfonia offering Italian cuisine and international dishes with table service.",
      "premium": false
    },
    {
      "slug": "terrazza-buffet",
      "name": "Terrazza Buffet",
      "category": "dining",
      "subcategory": "casual",
      "description": "Complimentary buffet restaurant on MSC Sinfonia with terrace-style dining and international food stations for all meals.",
      "premium": false
    },
    {
      "slug": "la-reggia-restaurant",
      "name": "La Reggia Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Splendida offering refined Italian and international cuisine with elegant table service.",
      "premium": false
    },
    {
      "slug": "marco-polo-restaurant",
      "name": "Marco Polo Restaurant",
      "category": "dining",
      "subcategory": "complimentary",
      "description": "Complimentary alternative dining room on MSC Armonia serving Italian and international dishes in a classic maritime-themed setting.",
      "premium": false
    }
  ]
}
