{
  "version": "1.0.0",
  "lastUpdated": "2026-01-30",
  "source": "Compiled from Virgin Voyages official site, VV Insider, Cruise Lowdown, Freestyle Travelers, Magical Traveller, CamJon Travel, Cruise Gear, Parks & Waves",
  "disclaimer": "All dining on Virgin Voyages is included in the cruise fare unless noted. Menus change seasonally and may vary by ship. Drink prices subject to change.",
  "menus": {
    "the-wake": {
      "pricing": "Complimentary (included in cruise fare). Raw bar supplements and drink pairings extra.",
      "courses": {
        "starters": [
          "Razor Clam Chowder — Yukon Gold Potato, Bacon, Chive Batons",
          "Corn Custard & Black Bean Salad — Tomatillo, Peppadew, Cilantro (V)",
          "Wedge Salad — Smoked Bacon, Baby Gem Lettuce, Blue Cheese",
          "Roasted Bone Marrow — French Toast",
          "Hamachi Crudo"
        ],
        "from-the-grill": [
          "Filet Mignon (7 oz)",
          "New York Strip (12 oz)",
          "Hanger Steak",
          "New Zealand Lamb Chops",
          "Herb Roasted Chicken",
          "Pan Roasted Ora King Salmon",
          "Salt-Encrusted Sea Bass"
        ],
        "desserts": [
          "The Wake — Rich Chocolate Mousse Cake",
          "Meyer Lemon Cheesecake — Cinnamon Cookie Crumble",
          "Baked Alaska"
        ]
      },
      "raw-bar": [
        "Petit Plateau ($45) — 1/2 Maine Lobster, Oysters, Poached Shrimp, Steamed Mussels, Snow Crab Claws, Clams",
        "Grand Plateau ($85) — Whole Maine Lobster, Oysters, Crawfish, Poached Shrimp, Clams, Steamed Mussels, Snow Crab Claws, Alaskan King Crab Legs",
        "Oysters — Half Dozen ($20) / Dozen ($40)",
        "Aged Tomahawk Steak ($65)"
      ],
      "notes": [
        "Modern steakhouse with 1950s glamour. Tableside martini mixologist and sauce flight (steak sauce, salsa verde, romesco, bone marrow béarnaise).",
        "Brunch available 8am–1pm with bottomless drink option ($35).",
        "The most popular restaurant onboard — book first when reservations open.",
        "Sides are shareable: brown butter mushrooms, asparagus, creamed spinach, roasted potatoes."
      ]
    },
    "pink-agave": {
      "pricing": "Complimentary (included in cruise fare)",
      "courses": {
        "small-plates": [
          "Esquites — Grilled Corn, Spicy Aioli",
          "Ceviche",
          "Guacamole",
          "Tlayuda",
          "Memelas",
          "Sopes"
        ],
        "entrees": [
          "Cochinita Pibil — Achiote-Marinated Pork, Sour Orange Habanero Pico de Gallo",
          "Enchiladas",
          "Mole",
          "Tamales",
          "Tortas"
        ],
        "desserts": [
          "Milhojas — Tamarind, Passion Fruit, Pineapple, Puff Pastry"
        ]
      },
      "notes": [
        "Entirely gluten-free menu — best restaurant choice for gluten-free diners.",
        "Widest assortment of mezcal and tequila at sea. Tom Dixon-designed interior.",
        "Dishes served as small, medium, and large plates — shareable format.",
        "Dinner only. One of the most popular restaurants; book early."
      ]
    },
    "extra-virgin": {
      "pricing": "Complimentary (included in cruise fare)",
      "courses": {
        "antipasti": [
          "Wagyu Beef Carpaccio — Chanterelles, Sunchokes, Truffle Dressing",
          "Semolina Fried Calamari — Lemon & Chili Dip",
          "Braised Mini Meatballs — Smoked Mozzarella, Tomato, Pancetta",
          "Crispy Artichokes",
          "Affettati Misti — Prosciutto, Pistachio Mortadella, Salame Napoli, 24-Month Parmigiano, Pecorino Romano, Gorgonzola"
        ],
        "pasta": [
          "Potato Gnocchi — Hen of the Woods Mushrooms, Spinach, Truffle Butter",
          "Pappardelle al Ragù — Beef Bolognese",
          "Carbonara",
          "Oxtail Raviolis",
          "Cacio e Pepe"
        ],
        "secondi": [
          "Eggplant Parmigiana — Vegan Mozzarella, Cherry Tomatoes, Garlic, Basil",
          "Grilled Mediterranean Sea Bass — Lemon, Roasted Fennel, Yukon Gold Potato",
          "Spatchcocked Grilled Young Chicken — Caper Berries, Pickled Celery, Piccata Sauce",
          "Braised Pork Cheek — Chanterelle Mushrooms, Arrowleaf Spinach, Crispy Pork",
          "Porcini-Rubbed New York Strip — Calabrian Chili Butter, Farro, Sautéed Escarole",
          "Whole Roasted Porchetta — Butternut Squash, Roasted Garlic"
        ],
        "desserts": [
          "Affogato Cart — Custom Gelato Sundae with Fresh Espresso",
          "Limoncello",
          "Tiramisu"
        ]
      },
      "notes": [
        "All pasta is made fresh onboard and cooked to order. Half-portions available to try multiple dishes.",
        "Dinner only. Menu varies slightly by ship with some unique additions per vessel.",
        "One of the most popular restaurants — book early."
      ]
    },
    "gunbae": {
      "pricing": "Complimentary (included in cruise fare). Treat Yourself premium items extra.",
      "courses": {
        "small-bites": [
          "Oi Muchim — Cucumber and Avocado Salad, Pepper Threads (VV, GF)",
          "Shrimp Kimbap Rolls — Crispy Nori Rice, Shrimp, Black Garlic",
          "Kimchi Jeon — Kimchi Pancake (V)",
          "Korean Fried Chicken (Dakgang Jeong) — Sweet-Spicy Glaze",
          "Pickled Veggies & Banchan"
        ],
        "stews-and-sides": [
          "Tteokbokki — Spicy Rice Cakes, Zucchini, Shiitake Mushrooms",
          "Soondubu — Silken Tofu Stew, Clams, Mussels, Shrimp",
          "Kalbi Jjim — Soy-Braised Short Ribs, Chestnuts, Daikon, Egg Ribbons",
          "Kimchi Fried Rice"
        ],
        "bbq-grill": [
          "Bulgogi — Soy-Marinated Ribeye and Onions",
          "Bulgogi Fire Meat — Marinated Ribeye, Extra Spice",
          "Boesut Yache Modum — Peppers, Asparagus, Mushrooms (VV, GF)",
          "Ojing-eo, Nakgi & Galibi — Squid, Octopus, Scallops",
          "Chef's Combo Platter — Includes Kalbi Short Ribs"
        ],
        "desserts": [
          "Shikye and Matcha Green Tea Soft Serve — Black Sesame Granola, Mini Mochi, or Miso Caramel"
        ]
      },
      "premium": [
        "Wagyu Beef Platter — Miyazaki Ribeye and Tenderloin (market price)",
        "Bo Ssam ($75) — Whole Roasted Pork Butt, Oysters, Caviar (shareable)"
      ],
      "notes": [
        "Complimentary round of soju for the table to start. Interactive Korean drinking games.",
        "2025 menu refresh: Bibimbap and Japchae retired. New stew section, seafood grill trio, and Bulgogi added.",
        "Flameless grills built into each table. Best enjoyed with a group — go hungry.",
        "Banchan refills available on request."
      ]
    },
    "razzle-dazzle": {
      "pricing": "Complimentary (included in cruise fare)",
      "courses": {
        "brunch": [
          "Avocado Toast — Sriracha, Toasted Seeds",
          "Açaí Bowl — Banana, Mango, Pineapple",
          "Sunny-Side Hash — Napa Cabbage Kimchi, Root Vegetables",
          "Coconut Milk Fairy Toast",
          "Malted Buckwheat Waffle — Pistachios, Mixed Berries",
          "Impossible Burger — Poblano Salsa, Paprika Veganaise, Avocado",
          "Everything Salmon Bowl",
          "Crazy Cobb Salad",
          "Razzle Dazzle Breakfast — Scrambled Eggs, Sage Impossible Patty, Roasted Mushrooms, Yukon Gold Potatoes"
        ],
        "dinner-starters": [
          "Avocado Green Goddess Salad",
          "Yellowfin Tuna Tartare",
          "King Trumpet Carpaccio",
          "Pork Belly — Bourbon Maple Glaze",
          "Fried Green Tomatoes and Okra",
          "Old Bay Chicken Wings"
        ],
        "dinner-mains": [
          "Slow Braised Lamb Shank",
          "Crusted Salmon",
          "Secret Burger — Blue Cheese, Gravy (ask your server)",
          "Impossible Burger"
        ],
        "desserts": [
          "Razzle Cake"
        ]
      },
      "notes": [
        "Vegetarian-forward with plenty of meat options. Bold black-and-white interior with pops of red.",
        "On Scarlet Lady, this venue is Lucky Lotus (Chinese-inspired). On Brilliant Lady, it is Rojo (Spanish-inspired).",
        "Bottomless brunch available with Yas Queen cocktails and Bloody Marys.",
        "Secret burger is off-menu — ask your server. Often called the best burger onboard."
      ]
    },
    "the-test-kitchen": {
      "pricing": "Complimentary (included in cruise fare). Drink pairings extra ($25 beer/non-alcoholic, $35 wine/cocktail).",
      "courses": {
        "experience": [
          "6-course mystery tasting menu — only key ingredients listed on the menu card",
          "Menu rotates between A, B, and C across voyages",
          "Chef Matt Lambert (Michelin-starred) crafted the experience",
          "Vegetarian tasting menu available",
          "Each course is a surprise presentation — e.g., mushroom paté shaped like a real mushroom"
        ]
      },
      "notes": [
        "Laboratory-styled decor inspired by Escoffier's Ma Cuisine. Courses are small but complete.",
        "Menus A and C are offered most frequently. Menu alternates based on voyage length.",
        "Also hosts a 60-minute tea exploration and a hands-on chocolate-making class (Let's Get Choco-Lit).",
        "Typically has the most availability of the main restaurants."
      ]
    },
    "the-galley": {
      "pricing": "Complimentary (included in cruise fare)",
      "stations": [
        "Well Bread — Bakery with pastries, flatbreads, and fresh-baked goods",
        "The Sweet Side — Pastries in the morning, desserts in the afternoon",
        "Hot off the Press — Paninis and sandwiches for breakfast and lunch",
        "Burger Grill — Pancakes and French toast (breakfast), burgers (all day)",
        "Let's Taco About It — Breakfast burritos (morning), tacos and fish tacos (lunch/dinner)",
        "Bento Baby / The Sushi Bar — Fruit boxes by day, sushi and bento boxes at night",
        "Noodle Around — Ramen and miso soups",
        "The Daily Mix — Soups, salads, cereal, and bagels",
        "Diner & Dash — 24-hour omelets, English breakfast, hot beef sandwiches"
      ],
      "notes": [
        "Food hall concept replacing the traditional cruise buffet. Counter-service ordering at each station.",
        "Open 24/7. Self-service beverages including soft drinks, juice, tea, coffee, wine, beer, and cider.",
        "Grab-and-go options always available. No reservations needed."
      ]
    },
    "the-pizza-place": {
      "pricing": "Complimentary (included in cruise fare)",
      "items": [
        "The Classic — Mozzarella, Tomato Sauce (V)",
        "White Truffle & Egg (V)",
        "Chicken Pesto — Basil Pesto, Mozzarella, Red Onions, Fresh Tomatoes",
        "Pretty Fly for a White Pie — Mozzarella, Ricotta, Parmesan, Roasted Garlic, Oregano (V)",
        "Pepperoni — Mozzarella, Tomato Sauce, Pepperoni",
        "Build Your Own — Custom brick-oven pizza with choice of toppings"
      ],
      "notes": [
        "Brick oven pizza with beach club-inspired setting. Gluten-free options available.",
        "Lunch service 11:30am–6:30pm, late-night 9pm–1:30am."
      ]
    },
    "the-dock": {
      "pricing": "Complimentary (included in cruise fare)",
      "courses": {
        "small-plates": [
          "Mediterranean Dips & Mezze",
          "Fresh Meat and Seafood Skewers — Flame Grilled to Order",
          "Sharing Platters"
        ]
      },
      "notes": [
        "Mediterranean-inspired lounge on Deck 7 Aft. Indoor (Dock House) and outdoor (Dock) seating.",
        "Perfect for light bites and sharing plates. Cocktail bar with spritzes and sangria.",
        "Roman & Williams design with upholstered seating and ocean views."
      ]
    },
    "sun-club-cafe": {
      "pricing": "Complimentary (included in cruise fare)",
      "items": [
        "Hawaiian Poke Bowl — Tuna",
        "Hawaiian Poke Bowl — Salmon",
        "Hawaiian Poke Bowl — Chicken",
        "Vegetarian Poke Bowl"
      ],
      "notes": [
        "Upper deck pool area. Limited hours: daily 12–5pm.",
        "Customizable bowls with choice of protein and toppings."
      ]
    },
    "lick-me-till-ice-cream": {
      "pricing": "Complimentary (included in cruise fare)",
      "items": [
        "6 rotating flavors daily — homemade ice cream and gelato",
        "Cone or cup options",
        "Gluten-free selections available"
      ],
      "notes": [
        "Open daily 11:30am–10pm on Deck 7."
      ]
    },
    "grounds-club": {
      "pricing": "Drip coffee and tea complimentary. Barista drinks extra ($5.50–$6).",
      "items": [
        "Espresso",
        "Cappuccino",
        "Latte",
        "Flat White",
        "Iced Coffee",
        "Light pastries and bites (complimentary)"
      ],
      "notes": [
        "Two locations: Deck 7 and The Galley. Grounds Club Too in The Galley transforms into a cocktail bar at night on Scarlet/Brilliant Lady."
      ]
    },
    "ship-eats": {
      "pricing": "$7 delivery fee (waived with alcoholic beverage order)",
      "items": [
        "Breakfast options",
        "Anytime snacks",
        "Late-night menu",
        "Beverages including champagne"
      ],
      "notes": [
        "24/7 in-cabin room service. Order via the Virgin Voyages app."
      ]
    },
    "sip-lounge": {
      "pricing": "Drinks à la carte. Afternoon tea $19 (or $39 with fizz).",
      "courses": {
        "champagne": [
          "Champagne by the Glass — from $9",
          "Moët & Chandon Brut — $95/bottle",
          "Vintage Champagne — up to $1,000/bottle"
        ],
        "afternoon-tea": [
          "Savoury Sandwiches",
          "Scones with Strawberry Jam and Clotted Cream",
          "Petit Fours and Little Cakes",
          "Large Selection of Loose Leaf Teas"
        ]
      },
      "notes": [
        "Premium wine and craft cocktail lounge. Afternoon tea daily 1–4pm.",
        "Sophisticated setting for pre-dinner drinks or celebratory toasts."
      ]
    },
    "on-the-rocks": {
      "pricing": "Drinks à la carte",
      "items": [
        "Aged Whiskies",
        "Craft Cocktails",
        "Premium Spirits",
        "Wine and Beer"
      ],
      "notes": [
        "Largest bar onboard in the Roundabout atrium. Live entertainment most nights.",
        "Popular nighttime haunt — can be busy during peak hours."
      ]
    },
    "draught-haus": {
      "pricing": "Drinks à la carte. Bottled beer $5–$6, craft drafts $7–$9.",
      "items": [
        "8 Craft Beers on Tap",
        "Artisanal Bottled Beers",
        "Boilermaker Pairings",
        "Shot-Cocktails (The Jelly Fish)"
      ],
      "notes": [
        "Industrial-style craft beer bar on Deck 7. Growler/jug service available for cabins."
      ]
    },
    "the-loose-cannon": {
      "pricing": "Drinks à la carte",
      "items": [
        "Craft Pints",
        "Cocktails",
        "Shiver Me Timbers (signature cocktail)",
        "Shell Game (shareable)",
        "Pub Grub"
      ],
      "notes": [
        "Brighton-inspired nautical pub. Brass ship's bell rings for quiz and game announcements."
      ]
    },
    "the-social-club": {
      "pricing": "Drinks à la carte. Floats and shakes extra.",
      "items": [
        "Milkshakes (spiked optional)",
        "Floats",
        "Hot Dogs",
        "Wings",
        "Nachos",
        "Popcorn",
        "Pick-n-Mix Candy",
        "Cake Pops"
      ],
      "notes": [
        "Gaming lounge with arcade games, shuffleboard, and board games on Deck 7."
      ]
    },
    "the-manor": {
      "pricing": "Entertainment included. Drinks à la carte.",
      "notes": [
        "Two-story nightclub inspired by Richard Branson's first recording studio.",
        "Headline shows nightly that transition into late-night dancing.",
        "Three bars across two levels. Live performances every night.",
        "THE place to be after dark."
      ]
    },
    "casino-bar": {
      "pricing": "Drinks à la carte",
      "notes": [
        "Convenient bar adjacent to the casino floor on Deck 6.",
        "Often quicker service than On The Rocks during busy times."
      ]
    },
    "gym-and-tonic": {
      "pricing": "Drinks à la carte. Fresh juices/smoothies ~$9.",
      "items": [
        "Smoothies",
        "Fresh Juices",
        "Re-Fresh Recovery Beverages",
        "Re-Cover Recovery Beverages",
        "Frozen Cocktails",
        "Full Bar"
      ],
      "notes": [
        "Pool-adjacent bar between the gym and whirlpool on Deck 15."
      ]
    },
    "aquatic-club-bar": {
      "pricing": "Drinks à la carte",
      "items": [
        "Frozen Cocktails",
        "Fresh Juices",
        "Full Bar Service"
      ],
      "notes": [
        "Main pool deck bar with vintage Hollywood aesthetic and purple loungers on Deck 15."
      ]
    },
    "athletic-club-bar": {
      "pricing": "Drinks à la carte",
      "items": [
        "Frozen Cocktails",
        "Health-Conscious Drinks",
        "Wine and Beer",
        "Standard Cocktails"
      ],
      "notes": [
        "1920s NYC sports club style on Deck 16. Daybed lounging and catamaran net access with wake views."
      ]
    },
    "sun-club-bar": {
      "pricing": "Drinks à la carte",
      "items": [
        "Frozen Cocktails",
        "Fresh Juices",
        "Full Bar"
      ],
      "notes": [
        "Upper deck bar on Deck 16 with red bistro tables and cabanas overlooking the Aquatic Club."
      ]
    },
    "richards-rooftop": {
      "pricing": "Exclusive to Rockstar and Mega-Rockstar Suite guests",
      "items": [
        "Complimentary Cocktail Soirées",
        "Sunset Happy Hour",
        "Exclusive Food Service",
        "Full Premium Bar"
      ],
      "notes": [
        "VIP-only lounge on Deck 16 Forward. Tom Dixon Design Research Studio interior.",
        "Access restricted to Rockstar Suite guests and above."
      ]
    }
  }
}
