{
  "version": "1.0.0",
  "lastUpdated": "2026-01-30",
  "source": "Compiled from Virgin Voyages official site, VV Insider, Cruise Lowdown, Freestyle Travelers, Magical Traveller, CamJon Travel, Cruise Gear, Parks & Waves",
  "disclaimer": "All dining on Virgin Voyages is included in the cruise fare unless noted. Menus change seasonally and may vary by ship. Drink prices subject to change.",
  "menus": {
    "the-wake": {
      "pricing": "Complimentary (included in cruise fare). Raw bar supplements and premium items extra.",
      "courses": {
        "starters": [
          "Clam Chowder — Yukon Gold Potato, Bacon, Chive Batons",
          "Corn Custard & Black Bean Salad — Tomatillo, Peppadew, Cilantro (V)",
          "Wedge Salad — Smoked Bacon, Hard Boiled Egg, Blue Cheese",
          "Hamachi Crudo — Pickled Rhubarb, Hibiscus, Basil",
          "Roasted Bone Marrow — Pickled Red Onion, Fresh Herbs, Toasted Brioche"
        ],
        "mains": [
          "Crispy Polenta — Roasted Tomato, Corn, Peppadew, Basil (VV, GF)",
          "Shrimp & Grits — Andouille Sausage, Peppers, Onions",
          "Pan Roasted Atlantic Salmon — Lemon, Capers, Brown Butter (GF)",
          "Salt-Baked Dorade — Fennel, Citrus, Olive Oil (GF)"
        ],
        "from-the-grill": [
          "Herb Roasted Chicken",
          "Hanger Steak",
          "Ribeye",
          "New York Strip"
        ],
        "sides": [
          "Brown Butter Roasted Wild Mushrooms (V, GF)",
          "Green Asparagus & Guindilla Sauce (V, GF)",
          "Creamed Spinach (V)",
          "French Fries (VV)",
          "Twice Baked Potato & Caramelized Onions (V)"
        ],
        "sauces": [
          "American-Style Steak Sauce",
          "Tarragon Salsa Verde (VV, GF)",
          "Romesco (VV, GF)",
          "Bone Marrow Béarnaise"
        ],
        "desserts": [
          "The Wake — Chocolate Mousse, Shortcrust, Caramel Cremoso, Hazelnuts",
          "Meyer Lemon Cheesecake (V) — Blackberry Compote & Cinnamon Cookie Crumble",
          "Baked Alaska (V) — Pistachio Ice Cream, Hazelnut Sponge Cake, Toasted Meringue",
          "Apple Tatin (V) — Caramelized Apple, Almond Financier, Mascarpone Cream",
          "Coconut \"Panna Cotta\" (VV, GF) — Fresh Berries, Candied Orange, Pinenut Granola"
        ]
      },
      "raw-bar": [
        "Petit Plateau ($45) — 1/2 Maine Lobster, Oysters, Poached Shrimp, Steamed Mussels, Snow Crab Claws, Clams",
        "Grand Plateau ($85) — Whole Maine Lobster, Oysters, Crawfish, Poached Shrimp, Clams, Steamed Mussels, Snow Crab Claws, Alaskan King Crab Legs",
        "Oysters — Half Dozen ($20) / Dozen ($40)"
      ],
      "premium": [
        "Aged Tomahawk Steak ($75)"
      ],
      "notes": [
        "Modern steakhouse with 1950s glamour. Tableside martini mixologist available.",
        "Brunch available 8am–1pm with bottomless drink option ($35).",
        "The most popular restaurant onboard — book first when reservations open.",
        "Sides are shareable. Sauce flight available with grill items."
      ]
    },
    "pink-agave": {
      "pricing": "Complimentary (included in cruise fare). Treat Yourself premium items extra.",
      "courses": {
        "botanas": [
          "Guacamole — Pomegranate Seeds, Jalapeño, Totopos (VV, GF)",
          "Chayote Yucateco — Mexican Squash, Habanero Pepper, Baby Carrots (VV, GF)",
          "Esquites — Grilled Corn, Spicy Aioli, Lime (V, GF)",
          "Aguachile — Tuna, Avocado, Jicama (GF)"
        ],
        "entradas": [
          "Camarón Amarillo — Seared Shrimp, Mole Amarillo, New Potatoes (GF)",
          "Enchilada de Pollo — Roasted Chicken, Salsa Verde, Crema (GF)",
          "Papas con Chorizo — Yukon Gold Potatoes, Onion, Garlic (GF)"
        ],
        "fuertes": [
          "Relleno Vegano — Russet Potato and Roasted Corn Stuffed Poblano Pepper (VV, GF)",
          "Pescado — Grilled Striped Bass, Mole Verde, Salsa de Xoconostle (GF)",
          "Pato — Roasted Duck, Mole Ahumado, Smoked Yam Purée (GF)",
          "Cochinita Pibil — Achiote-Marinated Smoked Pork & Sour Orange Habanero Pico de Gallo (GF)",
          "Bistec Marinero en Escabeche — Ribeye Steak, Oaxaca Cheese, Chile Ancho"
        ],
        "desserts": [
          "Tamal de Chocolate — Chocolate Masa, Mexican Chocolate, Fruit Salsa (VV, GF)",
          "Milhojas — Tamarind, Passion Fruit, Pineapple, Puff Pastry (V)",
          "Tacos de Chocolate — Mexican Chocolate, Canela, Dulce de Leche",
          "Capirotada — Bread Pudding, Rum Raisins (V)"
        ]
      },
      "premium": [
        "Pescado Zarandeado ($55) — Achiote Halibut, Lobster, Bay Scallops (GF)"
      ],
      "notes": [
        "Almost entirely gluten-free menu — best restaurant choice for gluten-free diners.",
        "Widest assortment of mezcal and tequila at sea. Tom Dixon-designed interior.",
        "Dishes served as small (botanas), medium (entradas), and large (fuertes) plates — shareable format.",
        "Dinner only. One of the most popular restaurants; book early."
      ]
    },
    "extra-virgin": {
      "pricing": "Complimentary (included in cruise fare). Fresh truffles supplement extra.",
      "courses": {
        "antipasto": [
          "Ribollita — Cannellini Beans, Escarole Salsa Verde, Country Bread (V)",
          "Romaine & Frisée Salad — White Anchovies, Croutons, Six-Minute Egg",
          "Crispy Artichokes — Caper Aioli & Charred Lemon (V)",
          "Semolina Fried Calamari — Lemon, Creamy Chili Dip",
          "Smoked Chicken Liver Mousse — Grilled Ciabatta & Balsamic Agrodolce",
          "Wagyu Beef Carpaccio — Chanterelles, Sunchokes, Truffle Dressing (GF)",
          "Braised Mini Meatballs — San Marzano Tomato, Smoked Mozzarella, Pancetta"
        ],
        "affettati-misti": [
          "Salumi — Prosciutto, Cacciatore, Salami Cotto",
          "Formaggi — 24-Month Aged Parmigiano, Pecorino Romano, Gorgonzola",
          "Served with Wildflower Honey, Pear Mostarda, Rosemary Spiced Nuts, Eggplant Caponata"
        ],
        "pasta": [
          "Potato Gnocchi — Hen of the Woods Mushrooms, Spinach, Truffle Butter Sauce (V)",
          "Spaghetti alle Vongole — Little Neck Clams, White Wine, Crushed Red Pepper",
          "Nero Gemelli Seafood Pasta — Mussels, Shrimp, Chili, Sea Urchin Sauce",
          "Bucatini Carbonara — Egg Yolk, Pecorino Romano, Black Pepper, Pancetta",
          "Pappardelle al Ragù — Beef Bolognese & Parmigiano-Reggiano",
          "Oxtail Agnolotti — Tangerine Conserva & Beef Tendon Crisps"
        ],
        "secondo": [
          "Brussels Sprouts Arrabbiata — Polenta, Calabrian Chiles, Hazelnuts (V, GF)",
          "Grilled Mediterranean Sea Bass — Lemon, Roasted Fennel, Yukon Gold Potato (GF)",
          "Braised Pork Cheek — Chanterelle Mushrooms, Arrowleaf Spinach, Crispy Pork",
          "Spatchcocked Grilled Young Chicken — Caper Berries, Pickled Celery, Piccata Sauce",
          "Porcini-Rubbed New York Strip — Calabrian Chili Butter, Farro, Sautéed Escarole"
        ],
        "dolci": [
          "Chocolate Olive Oil Cake — Red Wine Poached Pears and Candied Almonds (VV)",
          "Ricotta Bomboloni — Vanilla Mascarpone & Black Currant Compote (V)",
          "Chestnut Castagnaccio — Whipped Ricotta, Apples, Candied Pine Nuts (GF)"
        ],
        "affogato": [
          "Choice of Homemade Gelatos and Condimenti Topped with Espresso",
          "Gelati (V) — Gianduiotto, Whiskey Crema, Vanilla",
          "Sorbetti (V, GF) — Limoncello, Raspberry Rose, Mango Lime"
        ]
      },
      "premium": [
        "Add Fresh Truffles to Any Dish ($15)"
      ],
      "notes": [
        "All pasta is made fresh onboard and cooked to order. Half-portions available to try multiple dishes.",
        "Dinner only. Cicchetti (small bites) also available as a lighter option.",
        "One of the most popular restaurants — book early."
      ]
    },
    "gunbae": {
      "pricing": "Complimentary (included in cruise fare). Treat Yourself premium items extra.",
      "courses": {
        "small-bites": [
          "Bugak — Nori Rice Crisps (VV, GF)",
          "Miyeok Muchim — Seaweed Salad, Cucumber, Shiitake Mushrooms (VV, GF)",
          "Bindae-Tteok — Kimchi & Mung Bean Pancake (VV)",
          "\"Hot Bar\" — Mixed Seafood Corn Dog",
          "Haemul Pajeon — Mixed Seafood & Scallion Pancake",
          "Dakgangjeong — Forever Crispy Chicken, Pickled Daikon, Chili Sauce"
        ],
        "rice-noodles-stews": [
          "Bibimbap — Short Grain Rice, Egg, Mixed Vegetables (V, GF)",
          "Japchae — Stir-Fried Vegetables, Egg, Vermicelli Noodles (V, GF)",
          "Kimchi-Jjigae — Kimchi Stew, Pork Belly, Gochujang"
        ],
        "bbq-grill": [
          "Boesut Yache Modum — Assorted Mushrooms & Seasonal Vegetable Combo (VV, GF)",
          "Ojingeo, Nakji & Saewoo — Squid, Octopus, Shrimp (GF)",
          "Kalbi — Marinated Beef Short Ribs",
          "Kalbi Samgyeopsal Saewoo Modum — Chef's Combo: Short Ribs, Pork Belly, Shrimp (GF)"
        ],
        "desserts": [
          "Soft Serve — Sikhye (V), Black Sesame (V, GF), or Sikhye/Black Sesame Twist (V)",
          "Served with Black Sesame Granola, Mini Marshmallows, Miso Caramel"
        ]
      },
      "premium": [
        "Wagyu Beef Platter ($45) — Miyazaki Ribeye & Tenderloin"
      ],
      "notes": [
        "Complimentary round of soju for the table to start. Interactive Korean drinking games.",
        "BBQ grill served with choice of white rice, brown rice, or kimchi fried rice.",
        "Flameless grills built into each table. Best enjoyed with a group — go hungry.",
        "Menu verified from PDF source. A 2025 refresh may have updated some items — check onboard for latest offerings."
      ]
    },
    "razzle-dazzle": {
      "pricing": "Complimentary (included in cruise fare). Fresh juices and smoothies extra ($6–$9).",
      "courses": {
        "brunch-to-start": [
          "Watermelon & Sesame \"Cream\" (V)",
          "Avo Toast (VV)",
          "Coconut Milk Fairy Toast (V)"
        ],
        "brunch-bakery": [
          "Apple Cruffin (V)",
          "Smoked Cheddar Jalapeño Croissant (V)",
          "Banana Muffin (VV, GF)",
          "Peanut Butter Cup Scone (V)"
        ],
        "brunch-eggs": [
          "Razzle Dazzle Breakfast — Eggs Your Way, Roasted Mushrooms, Yukon Gold Potatoes (V, GF)",
          "The Impossible Breakfast Sando (V)",
          "Wild Mushroom Frittata (V)",
          "Probiotic Hash",
          "Turmeric Egg Scramble (V)"
        ],
        "brunch-sweet": [
          "Açaí Bowl (V)",
          "Steelcut Oatmeal Brûlée (VV)",
          "Classic Malted Waffle (V)"
        ],
        "lunch-soup-and-salad": [
          "Nutty Gazpacho (VV)",
          "Melon Salad (V, GF)"
        ],
        "lunch-naughty": [
          "Fried Chicken Sandwich",
          "Crazy Cobb (GF)"
        ],
        "lunch-brunchie": [
          "Impossible Burger (VV)",
          "Malted Buckwheat Waffle (V)",
          "\"Everything\" Spiced Salmon Bowl (GF)"
        ],
        "brunch-juices": [
          "O.J. ($6)",
          "The Good Green ($7)",
          "I Can C Clearly Now ($7)",
          "Just Beet It ($7)",
          "Berryatric ($9)",
          "Chill Pill ($9)",
          "Lean & Clean ($9)"
        ],
        "dinner-starters": [
          "Mushroom \"Tartare\" (VV)",
          "Nutty Gazpacho (VV)",
          "Melon Salad (V, GF)",
          "Crazy Cobb (GF)"
        ],
        "dinner-mains": [
          "Whole Roasted Heirloom Cauliflower (VV, GF)",
          "Heirloom Squash Ravioli (V)",
          "\"Fish\" and Chips (VV)",
          "Impossible Burger (VV)"
        ],
        "dinner-if-you-must": [
          "Everything Crusted Salmon — Crushed Yukon Gold Potato, Pickled Vegetables, Mustard Sauce (GF)"
        ],
        "dinner-naughty": [
          "Black Garlic Bowtie Pasta — Fennel Braised Pork, Chanterelles, Rainbow Swiss Chard",
          "Fried Chicken — 1/2 Fried Chicken, Buttered Cholula Hot Sauce",
          "1/2 Ginger Beer Chicken — Charred Coconut Green Beans, Roasted Squash (GF)",
          "Pretzel Pork Schnitzel — Red Cabbage Slaw, Kimchi 1000 Island"
        ],
        "sides": [
          "Mimolette Cheese Loaded Tots (GF)",
          "Fries (VV, GF)",
          "Blistered Shishito Peppers (VV, GF)",
          "Smoked Bacon (GF)"
        ],
        "desserts": [
          "Blueberry-Green Tea Cheesecake (VV, GF)",
          "Razzle Cake",
          "Rainbow Churros (V)"
        ],
        "milk-and-cookies": [
          "Loaded Cookies (V)",
          "Mudslide — Stuffed Red Velvet, Matcha White Chocolate",
          "Vegan Cookies (VV)",
          "Cocoa-O's — Coconut-Chocolate Chip, Coffee & Date Newton",
          "Choose One Milk: Toasted Cinnamon Cereal (V), Biscoff Cookie (V), or Vanilla Cinnamon-Almond (VV, GF)"
        ]
      },
      "notes": [
        "Vegetarian-forward restaurant with a separate 'Naughty' section for meat/fish dishes at dinner.",
        "Three distinct menus: brunch, lunch, and dinner. Brunch is the most popular service.",
        "On Scarlet Lady, this venue is Lucky Lotus (Chinese-inspired). On Brilliant Lady, it is Rojo (Spanish-inspired).",
        "Milk & Cookies dessert section — choose your cookie and milk pairing."
      ]
    },
    "the-test-kitchen": {
      "pricing": "Complimentary (included in cruise fare). Drink pairings extra ($25 beer/non-alcoholic, $35 wine/cocktail).",
      "courses": {
        "experience": [
          "6-course mystery tasting menu — only key ingredients listed on the menu card",
          "Menu rotates between A, B, and C across voyages",
          "Chef Matt Lambert (Michelin-starred) crafted the experience",
          "Vegetarian tasting menu available",
          "Each course is a surprise presentation — e.g., mushroom paté shaped like a real mushroom"
        ]
      },
      "notes": [
        "Laboratory-styled decor inspired by Escoffier's Ma Cuisine. Courses are small but complete.",
        "Menus A and C are offered most frequently. Menu alternates based on voyage length.",
        "Also hosts a 60-minute tea exploration and a hands-on chocolate-making class (Let's Get Choco-Lit).",
        "Typically has the most availability of the main restaurants."
      ]
    },
    "the-galley": {
      "pricing": "Complimentary (included in cruise fare)",
      "stations": [
        "Well Bread — Bakery with pastries, flatbreads, and fresh-baked goods",
        "The Sweet Side — Pastries in the morning, desserts in the afternoon",
        "Hot off the Press — Paninis and sandwiches for breakfast and lunch",
        "Burger Grill — Pancakes and French toast (breakfast), burgers (all day)",
        "Let's Taco About It — Breakfast burritos (morning), tacos and fish tacos (lunch/dinner)",
        "Bento Baby / The Sushi Bar — Fruit boxes by day, sushi and bento boxes at night",
        "Noodle Around — Ramen and miso soups",
        "The Daily Mix — Soups, salads, cereal, and bagels",
        "Diner & Dash — 24-hour omelets, English breakfast, hot beef sandwiches"
      ],
      "notes": [
        "Food hall concept replacing the traditional cruise buffet. Counter-service ordering at each station.",
        "Open 24/7. Self-service beverages including soft drinks, juice, tea, coffee, wine, beer, and cider.",
        "Grab-and-go options always available. No reservations needed."
      ]
    },
    "the-pizza-place": {
      "pricing": "Complimentary (included in cruise fare)",
      "items": [
        "The Classic — Mozzarella, Tomato Sauce (V)",
        "White Truffle & Egg (V)",
        "Chicken Pesto — Basil Pesto, Mozzarella, Red Onions, Fresh Tomatoes",
        "Pretty Fly for a White Pie — Mozzarella, Ricotta, Parmesan, Roasted Garlic, Oregano (V)",
        "Pepperoni — Mozzarella, Tomato Sauce, Pepperoni",
        "Build Your Own — Custom brick-oven pizza with choice of toppings"
      ],
      "notes": [
        "Brick oven pizza with beach club-inspired setting. Gluten-free options available.",
        "Lunch service 11:30am–6:30pm, late-night 9pm–1:30am."
      ]
    },
    "the-dock": {
      "pricing": "Complimentary (included in cruise fare)",
      "courses": {
        "small-plates": [
          "Mediterranean Dips & Mezze",
          "Fresh Meat and Seafood Skewers — Flame Grilled to Order",
          "Sharing Platters"
        ]
      },
      "notes": [
        "Mediterranean-inspired lounge on Deck 7 Aft. Indoor (Dock House) and outdoor (Dock) seating.",
        "Perfect for light bites and sharing plates. Cocktail bar with spritzes and sangria.",
        "Roman & Williams design with upholstered seating and ocean views."
      ]
    },
    "sun-club-cafe": {
      "pricing": "Complimentary (included in cruise fare)",
      "items": [
        "Hawaiian Poke Bowl — Tuna",
        "Hawaiian Poke Bowl — Salmon",
        "Hawaiian Poke Bowl — Chicken",
        "Vegetarian Poke Bowl"
      ],
      "notes": [
        "Upper deck pool area. Limited hours: daily 12–5pm.",
        "Customizable bowls with choice of protein and toppings."
      ]
    },
    "lick-me-till-ice-cream": {
      "pricing": "Complimentary (included in cruise fare)",
      "items": [
        "6 rotating flavors daily — homemade ice cream and gelato",
        "Cone or cup options",
        "Gluten-free selections available"
      ],
      "notes": [
        "Open daily 11:30am–10pm on Deck 7."
      ]
    },
    "grounds-club": {
      "pricing": "Drip coffee and tea complimentary. Barista drinks extra ($5.50–$6).",
      "items": [
        "Espresso",
        "Cappuccino",
        "Latte",
        "Flat White",
        "Iced Coffee",
        "Light pastries and bites (complimentary)"
      ],
      "notes": [
        "Two locations: Deck 7 and The Galley. Grounds Club Too in The Galley transforms into a cocktail bar at night on Scarlet/Brilliant Lady."
      ]
    },
    "ship-eats": {
      "pricing": "$7 delivery fee (waived with alcoholic beverage order)",
      "items": [
        "Breakfast options",
        "Anytime snacks",
        "Late-night menu",
        "Beverages including champagne"
      ],
      "notes": [
        "24/7 in-cabin room service. Order via the Virgin Voyages app."
      ]
    },
    "sip-lounge": {
      "pricing": "Drinks à la carte. Afternoon tea $19 (or $39 with fizz).",
      "courses": {
        "champagne": [
          "Champagne by the Glass — from $9",
          "Moët & Chandon Brut — $95/bottle",
          "Vintage Champagne — up to $1,000/bottle"
        ],
        "afternoon-tea": [
          "Savoury Sandwiches",
          "Scones with Strawberry Jam and Clotted Cream",
          "Petit Fours and Little Cakes",
          "Large Selection of Loose Leaf Teas"
        ]
      },
      "notes": [
        "Premium wine and craft cocktail lounge. Afternoon tea daily 1–4pm.",
        "Sophisticated setting for pre-dinner drinks or celebratory toasts."
      ]
    },
    "on-the-rocks": {
      "pricing": "Drinks à la carte",
      "items": [
        "Aged Whiskies",
        "Craft Cocktails",
        "Premium Spirits",
        "Wine and Beer"
      ],
      "notes": [
        "Largest bar onboard in the Roundabout atrium. Live entertainment most nights.",
        "Popular nighttime haunt — can be busy during peak hours."
      ]
    },
    "draught-haus": {
      "pricing": "Drinks à la carte. Bottled beer $5–$6, craft drafts $7–$9.",
      "items": [
        "8 Craft Beers on Tap",
        "Artisanal Bottled Beers",
        "Boilermaker Pairings",
        "Shot-Cocktails (The Jelly Fish)"
      ],
      "notes": [
        "Industrial-style craft beer bar on Deck 7. Growler/jug service available for cabins."
      ]
    },
    "the-loose-cannon": {
      "pricing": "Drinks à la carte",
      "items": [
        "Craft Pints",
        "Cocktails",
        "Shiver Me Timbers (signature cocktail)",
        "Shell Game (shareable)",
        "Pub Grub"
      ],
      "notes": [
        "Brighton-inspired nautical pub. Brass ship's bell rings for quiz and game announcements."
      ]
    },
    "the-social-club": {
      "pricing": "Drinks à la carte. Floats and shakes extra.",
      "items": [
        "Milkshakes (spiked optional)",
        "Floats",
        "Hot Dogs",
        "Wings",
        "Nachos",
        "Popcorn",
        "Pick-n-Mix Candy",
        "Cake Pops"
      ],
      "notes": [
        "Gaming lounge with arcade games, shuffleboard, and board games on Deck 7."
      ]
    },
    "the-manor": {
      "pricing": "Entertainment included. Drinks à la carte.",
      "notes": [
        "Two-story nightclub inspired by Richard Branson's first recording studio.",
        "Headline shows nightly that transition into late-night dancing.",
        "Three bars across two levels. Live performances every night.",
        "THE place to be after dark."
      ]
    },
    "casino-bar": {
      "pricing": "Drinks à la carte",
      "notes": [
        "Convenient bar adjacent to the casino floor on Deck 6.",
        "Often quicker service than On The Rocks during busy times."
      ]
    },
    "gym-and-tonic": {
      "pricing": "Drinks à la carte. Fresh juices/smoothies ~$9.",
      "items": [
        "Smoothies",
        "Fresh Juices",
        "Re-Fresh Recovery Beverages",
        "Re-Cover Recovery Beverages",
        "Frozen Cocktails",
        "Full Bar"
      ],
      "notes": [
        "Pool-adjacent bar between the gym and whirlpool on Deck 15."
      ]
    },
    "aquatic-club-bar": {
      "pricing": "Drinks à la carte",
      "items": [
        "Frozen Cocktails",
        "Fresh Juices",
        "Full Bar Service"
      ],
      "notes": [
        "Main pool deck bar with vintage Hollywood aesthetic and purple loungers on Deck 15."
      ]
    },
    "athletic-club-bar": {
      "pricing": "Drinks à la carte",
      "items": [
        "Frozen Cocktails",
        "Health-Conscious Drinks",
        "Wine and Beer",
        "Standard Cocktails"
      ],
      "notes": [
        "1920s NYC sports club style on Deck 16. Daybed lounging and catamaran net access with wake views."
      ]
    },
    "sun-club-bar": {
      "pricing": "Drinks à la carte",
      "items": [
        "Frozen Cocktails",
        "Fresh Juices",
        "Full Bar"
      ],
      "notes": [
        "Upper deck bar on Deck 16 with red bistro tables and cabanas overlooking the Aquatic Club."
      ]
    },
    "richards-rooftop": {
      "pricing": "Exclusive to Rockstar and Mega-Rockstar Suite guests",
      "items": [
        "Complimentary Cocktail Soirées",
        "Sunset Happy Hour",
        "Exclusive Food Service",
        "Full Premium Bar"
      ],
      "notes": [
        "VIP-only lounge on Deck 16 Forward. Tom Dixon Design Research Studio interior.",
        "Access restricted to Rockstar Suite guests and above."
      ]
    }
  }
}
