{
  "ship_name": "Radiance of the Seas",
  "ship_slug": "radiance-of-the-seas",
  "version": "2.0",
  "last_updated": "2025-01-14",
  "exceptions": [
    {
      "rooms": "7001-7050",
      "category": "view",
      "severity": "minor",
      "display_heading": "Partial Overhang Above Lifeboats",
      "description": "These balconies have a slight overhang above the lifeboats, which partially limits the view straight down.",
      "pastoral_description": "Room 7050 on Radiance of the Seas is a standard balcony stateroom. Most travelers consider it a great choice, with one small thing to know about the partial overhang above the lifeboats. Your view is still lovely—you'll see the horizon perfectly. The overhang just means you won't see straight down to the water, which most guests don't mind at all."
    },
    {
      "rooms": "1001,1002,1003,1004,1005,1006",
      "category": "noise",
      "severity": "minor",
      "display_heading": "Near Anchor Mechanism",
      "description": "These cabins are located near the ship's anchor mechanism, which may create noise in the early morning when the anchor is raised or lowered in port.",
      "pastoral_description": "These forward cabins are well-positioned, with one gentle note: you may hear the anchor mechanism in the early morning when entering or leaving port. Most guests find it brief and not disruptive, but light sleepers may want to bring earplugs for those mornings. The rest of your cruise should be peaceful."
    },
    {
      "rooms": "8234,8236,8238,8240",
      "category": "location",
      "severity": "info",
      "display_heading": "Forward Location",
      "description": "These cabins are in the forward section of the ship, which may experience slightly more motion in rough seas.",
      "pastoral_description": "These forward balcony cabins offer wonderful views and are well-appointed. One thing to know: the forward location means you may feel a bit more motion if the seas get rough. For most Alaska or Caribbean sailings, this is rarely an issue. If you're concerned about motion, midship cabins tend to be the most stable, but many guests love these forward rooms for their peaceful location away from high-traffic areas."
    },
    {
      "rooms": "9200-9250",
      "category": "noise",
      "severity": "minor",
      "display_heading": "Below Pool Deck",
      "description": "These cabins are located directly below the pool deck, which may result in daytime foot traffic noise.",
      "pastoral_description": "These balcony cabins are spacious and comfortable. They're located one deck below the pool area, which means you may hear some daytime activity overhead—deck chairs moving, footsteps, occasional splashing. Most guests find it a minor trade-off for the convenience of being close to the pool. By evening, it's typically quiet. Families often appreciate the proximity to activities."
    },
    {
      "rooms": "3101,3102,3103",
      "category": "view",
      "severity": "major",
      "display_heading": "Obstructed Ocean View",
      "description": "These Ocean View cabins have a lifeboat directly blocking the window, significantly obstructing the view.",
      "pastoral_description": "These cabins are classified as Ocean View, but it's important to know that a lifeboat sits directly in front of the window, blocking most of the ocean view. You'll get some daylight, but not the vista you might expect. If a clear ocean view is important to you, consider asking your booking agent about alternative cabins. Many guests who know this ahead of time are comfortable with it, especially since these rooms are often priced lower."
    },
    {
      "rooms": "11001-11050",
      "category": "location",
      "severity": "info",
      "display_heading": "Aft Location Near Nightclub",
      "description": "These cabins are in the aft section, near the ship's nightclub and late-night entertainment venues.",
      "pastoral_description": "These aft cabins are in a vibrant part of the ship. The nightclub and evening entertainment venues are nearby, which means you may hear music and activity until late at night (usually 1-2 AM). If you're a light sleeper or prefer to turn in early, you might want to consider a cabin in a quieter location. But if you enjoy the energy and don't mind the buzz, this location puts you close to the action."
    }
  ]
}
