{
  "ship": "Celebrity Compass",
  "ship_class": "Expedition Class (Future)",
  "cruise_line": "Celebrity Cruises",
  "last_updated": "2026-01-03",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "Compass Points Toward Adventure",
      "persona_label": "Future Vision",
      "persona": "anticipation",
      "intended_reader": "Travelers interested in upcoming expedition ships",
      "core_insight": "Compass will guide Celebrity's expedition expansion",
      "markdown": "**A compass points the way. Celebrity Compass will guide expedition travelers to new adventures.**\n\n[Celebrity Compass](/ships/celebrity-cruises/celebrity-compass.html) is planned as part of Celebrity's expedition fleet expansion. Following Xpedition, Flora, and Seeker, Compass will help establish expedition cruising as core to Celebrity's identity.\n\nThe name suggests navigation—finding paths to experiences, guiding travelers toward adventure, orienting journeys into the unknown. The expedition philosophy continues.\n\nDetails will emerge as launch approaches. The vision is clear—premium expedition cruising expanding to serve growing demand.\n\n**The promise:** Compass will guide Celebrity travelers to new expedition destinations. Another step in the expedition journey.\n\nThose drawn to expedition should watch Compass develop. A ship named for showing the way.",
      "author": {
        "name": "Fleet Development Team",
        "location": "Celebrity Cruises Announcements"
      }
    },
    {
      "title": "Expedition Fleet Growing",
      "persona_label": "Fleet Expansion",
      "persona": "expedition",
      "intended_reader": "Expedition cruisers following fleet development",
      "core_insight": "Compass shows Celebrity's commitment to expedition",
      "markdown": "**Four expedition ships signal serious commitment.**\n\n[Celebrity Compass](/ships/celebrity-cruises/celebrity-compass.html) joining Xpedition, Flora, and Seeker means Celebrity's expedition fleet will be substantial. This isn't experimental—it's strategy.\n\nThe demand exists. The Galápagos success proved the concept. Expanding to four ships means new destinations become possible. The expedition future Celebrity envisions is taking shape.\n\n**The commitment:** Compass represents Celebrity betting on expedition's future. The investment signals where the line sees opportunity.\n\nThose who believe expedition cruising is the future will find evidence in Compass. The fleet that proves the commitment.",
      "author": {
        "name": "Fleet Development Team",
        "location": "Celebrity Cruises Announcements"
      }
    }
  ]
}
