{
  "ship": "Celebrity Apex",
  "ship_class": "Edge Class",
  "cruise_line": "Celebrity Cruises",
  "last_updated": "2026-01-20",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "The Southampton Gateway to Northern Europe",
      "persona_label": "European Explorer",
      "persona": "european",
      "intended_reader": "Travelers planning Northern European cruises from the UK",
      "core_insight": "Apex's UK homeport opens Northern Europe without transatlantic flights",
      "markdown": "**I'd always wanted to see Norway. Flying to Miami to cruise there seemed absurd.**\n\nEvery Norwegian fjord cruise I'd researched required transatlantic flights to American ports. The logic baffled me—why fly west to sail east? [Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) solved the geography.\n\nApex homeports in Southampton. I drove from London, parked at the port, and boarded Edge Class innovation without entering an airport. The fjords were three days north, not three flights away.\n\nThe itinerary made sense. Bergen, Geiranger, Flam—the Norway I'd dreamed about, accessed from the UK I lived in. The ship delivered me to waterfalls and fjords while I recovered from the journey's ease rather than its exhaustion.\n\n'You didn't fly at all?' an American passenger asked, amazed by my simplicity.\n\n'I drove two hours,' I explained. 'Edge Class is in Southampton now.'\n\nHer face fell—she'd flown from California to cruise routes that originated near my home. Geography favored me for once.\n\n**The truth:** Apex's Southampton homeport serves UK and European travelers efficiently. If you're London-based seeking Nordic experiences, the ship comes to you. See [our Northern Europe guide](/articles.html).\n\nI cruise Apex's European itineraries annually now. No transatlantic flights. Just world-class cruising from my own continent.",
      "author": {
        "name": "Charlotte W.",
        "location": "London, UK"
      }
    },
    {
      "title": "The Pandemic Ship That Made It",
      "persona_label": "History Witness",
      "persona": "veteran",
      "intended_reader": "Cruise industry enthusiasts interested in ship histories",
      "core_insight": "Apex's COVID-era launch and recovery represents industry resilience",
      "markdown": "**Apex launched into a world that had stopped cruising. She survived anyway.**\n\nDelivered in 2020, [Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) should have been a disaster story. The cruise industry collapsed. Ships sat empty. New vessels seemed like liabilities rather than assets.\n\nBut Apex waited. Celebrity held her until the world reopened, then deployed her into European waters hungry for premium cruising. The ship that launched into nothing became the ship that signaled recovery.\n\nI boarded Apex in 2022, one of her first full-capacity voyages. The crew's joy was palpable—they'd waited too, wondered if cruising would return, hoped their careers would survive. Seeing passengers filled them with visible relief.\n\n'We didn't know if this would happen,' a server told me. 'The ship existed but the guests didn't. Now you're here.'\n\nApex carries that recovery energy still. The crew who endured the pause appreciate the return. The ship that survived represents an industry that survived.\n\n**The lesson:** Apex's history adds meaning to her sailings. Boarding this ship means boarding recovery. See [our cruise industry history](/articles.html).\n\nI sail Apex partly for the history now. She represents resilience. The ship that waited is the ship that persisted.",
      "author": {
        "name": "Richard M.",
        "location": "Edinburgh, UK"
      }
    },
    {
      "title": "My Wheelchair Conquered the Fjords",
      "persona_label": "Mobility Victory",
      "persona": "accessible",
      "intended_reader": "Wheelchair users planning Norway cruises",
      "core_insight": "Apex brings Norway's fjords to wheelchair users through ship-based viewing",
      "markdown": "**Norwegian fjords require hiking. My wheelchair requires not hiking. Apex solved this.**\n\nEvery Norway trip I'd researched assumed mobility. Hikes to viewpoints. Walks through villages. Activities that my wheelchair excluded. The fjords seemed reserved for walking travelers.\n\n[Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) brought the fjords to me.\n\nThe ship sailed into Geirangerfjord's heart. From my [accessible cabin's](/accessibility.html) balcony, I watched waterfalls cascade down cliffs most hikers never reach. The Seven Sisters. The Suitor. Natural wonders arriving at my window rather than demanding I climb to them.\n\nDeck 15 provided panoramic access. My wheelchair rolled to railings with unobstructed fjord views. The scenery came to my level. No stairs, no trails, no barriers between me and Norway's geography.\n\n'I can't believe this view,' I told my caregiver.\n\n'You don't have to reach it,' she observed. 'It reaches you.'\n\nThe crew understood accessibility beyond mere compliance. They positioned my chair at optimal viewing spots. They timed announcements so I could reach observation areas. They ensured the wheelchair guest experienced as much as the hiking guest.\n\n**The truth:** Apex makes Norwegian fjords accessible through ship-based viewing. The cliffs come to you. The waterfalls come to you. See [our accessible cruising guide](/accessibility.html).\n\nI cruise Apex's Norway itineraries specifically now. The fjords I thought I'd never see surround me from my accessible space.",
      "author": {
        "name": "James P.",
        "location": "Manchester, UK"
      }
    },
    {
      "title": "Solo in the Midnight Sun",
      "persona_label": "Solo Discovery",
      "persona": "solo",
      "intended_reader": "Solo travelers considering Nordic itineraries",
      "core_insight": "Apex's Nordic voyages create magic for solo travelers",
      "markdown": "**I wanted to see the midnight sun. I didn't want to see it alone.**\n\nNordic travel terrified me as a solo traveler—endless daylight disorienting schedules, remote destinations limiting contact, the loneliness of experiencing wonder without sharing it.\n\n[Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) transformed solo concerns into solo advantages.\n\nThe midnight sun hit at sea, somewhere north of the Arctic Circle. I stood on deck at 11 PM watching the sun hover above the horizon, refusing to set. Fellow passengers gathered—couples, families, other solos. We watched together, strangers sharing something extraordinary.\n\n'First midnight sun?' a woman asked me.\n\n'First everything,' I admitted. 'First solo cruise too.'\n\n'You're not solo anymore,' she said. 'Not when everyone's watching the same miracle.'\n\nShe was right. The shared wonder erased the solo labels. We exchanged emails. We ate breakfast together for the remaining voyage. The midnight sun had connected us.\n\nApex's spaces supported connection throughout. The Craft Social bar hosted game nights that drew solo travelers. Eden's atmosphere encouraged strangers to share tables. The ship design assumed solo guests existed and deserved community.\n\n**The lesson:** Apex's Nordic voyages transform solo travel through shared wonder. The midnight sun brings people together. See [our solo cruise guide](/solo.html).\n\nI cruise Apex's Arctic itineraries solo specifically now. The ship makes wonder shareable.",
      "author": {
        "name": "Emma K.",
        "location": "Bristol, UK"
      }
    },
    {
      "title": "Eden's Irish Coffee Saved Our Night",
      "persona_label": "Couples Connection",
      "persona": "couples",
      "intended_reader": "Couples seeking romantic cruise moments",
      "core_insight": "Apex's Eden creates intimate evening experiences for couples",
      "markdown": "**We'd had a fight. Eden's Irish coffee mediated the peace.**\n\nTwenty-two years of marriage means you know how to wound each other. We'd argued about something stupid—scheduling, money, the accumulated grievances of two decades. By dinner, we were eating in silence.\n\nAfter dinner, neither of us wanted to return to the cabin. I wandered toward Eden. She followed.\n\n[Celebrity Apex's](/ships/celebrity-cruises/celebrity-apex.html) Eden at night transforms into something contemplative. The performers had finished. The lighting had dimmed. The bar served late-night cocktails to couples who needed space that wasn't quite separation.\n\nI ordered Irish coffee. She ordered the same—our old peace offering, the drink we'd shared on our honeymoon when the first big fight had tested us.\n\n'This is stupid,' she said finally.\n\n'We're stupid,' I agreed.\n\n'But we're still here.'\n\n'We're still here.'\n\nThe Irish coffee warmed us. Eden's plants whispered in the air conditioning. The ocean stretched dark beyond the windows. Something about the space—beautiful, quiet, neither cabin nor public—allowed reconciliation.\n\nBy the second round, we were holding hands. By midnight, we were remembering why we'd chosen each other. Eden held our peace until we could hold it ourselves.\n\n**The truth:** Apex's Eden serves couples who need neutral ground. The space invites reconciliation. See [our couples cruise guide](/articles.html).\n\nWe visit Eden whenever tension builds now. The ship provides what marriage sometimes needs: beautiful space for difficult conversations.",
      "author": {
        "name": "Michael and Catherine H.",
        "location": "Dublin, Ireland"
      }
    },
    {
      "title": "Le Voyage by Daniel Boulud Exceeded Expectations",
      "persona_label": "Culinary Excellence",
      "persona": "foodie",
      "intended_reader": "Food-focused travelers seeking exceptional cruise dining",
      "core_insight": "Apex's Le Voyage delivers genuine Daniel Boulud quality at sea",
      "markdown": "**I've eaten at Daniel Boulud's Manhattan restaurants. Le Voyage matched them.**\n\nCelebrity chef partnerships usually disappoint. The chef lends their name, the kitchen follows recipes, the experience approximates land-based quality without achieving it. I expected Le Voyage to follow this pattern.\n\n[Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) proved me wrong.\n\nThe tasting menu at Le Voyage delivered Boulud's sensibility authentically. The dover sole was properly prepared. The lamb was correctly sourced. The sauces showed the depth that requires time and skill rather than shortcuts.\n\n'Chef trained with Daniel directly,' our server explained. 'He spent two years at DANIEL before coming to sea.'\n\nThe training showed. Every course demonstrated understanding, not just execution—the why of Boulud's cooking, not just the what. The bread service alone rivaled Manhattan bakeries.\n\nThe wine pairings elevated further. A sommelier who understood food, not just wine. Combinations that enhanced rather than competed. Each glass made the plate better.\n\n**The lesson:** Apex's Le Voyage represents genuine celebrity chef quality. If you know Boulud's cooking, you'll recognize it here. See [our dining guide](/articles.html).\n\nI book Le Voyage every Apex voyage. The restaurant justifies the ship selection. Daniel Boulud at sea shouldn't work. It does.",
      "author": {
        "name": "Thomas L.",
        "location": "Paris, France"
      }
    },
    {
      "title": "Three Weeks Healed What Therapy Couldn't",
      "persona_label": "Grief Journey",
      "persona": "widow",
      "intended_reader": "Widows seeking extended healing voyages",
      "core_insight": "Apex's repositioning cruises provide time for deep grief processing",
      "markdown": "**My therapist suggested a cruise. I booked a repositioning—three weeks from Southampton to Miami.**\n\nRobert died two years ago. I'd tried everything—therapy, support groups, medication, distraction. Nothing released the weight. My therapist suggested water, movement, time outside normal life.\n\n[Celebrity Apex's](/ships/celebrity-cruises/celebrity-apex.html) transatlantic repositioning gave me three weeks at sea.\n\nNo ports for seven days crossing the Atlantic. Just ocean, horizon, and the relentless forward motion of a ship that had places to be. I cried freely on my balcony, no neighbors to hear, no schedule to interrupt.\n\nThe crew noticed but didn't intrude. Room service appeared when I couldn't face the dining room. Tissues materialized. The ship held me without holding me accountable.\n\nBy week two, something shifted. The endless ocean had absorbed something I'd been carrying. The movement forward had become metaphor, then reality. I was sailing toward something, not just away from loss.\n\n'You seem different,' a fellow solo traveler observed near voyage's end.\n\n'I'm becoming different,' I admitted. 'The ship is helping.'\n\n**The truth:** Apex's repositioning cruises serve grief that needs duration. Three weeks at sea provides time therapy hours cannot. See [In the Wake of Grief](/solo/in-the-wake-of-grief.html).\n\nI seek Apex's longest voyages when grief surges. The ship knows how to carry weight. The ocean knows how to receive tears.",
      "author": {
        "name": "Elizabeth R.",
        "location": "Southampton, UK"
      }
    },
    {
      "title": "The Retreat Exceeded Every Expectation",
      "persona_label": "Suite Experience",
      "persona": "luxury",
      "intended_reader": "Travelers considering Celebrity Retreat experience",
      "core_insight": "Apex's Retreat delivers genuine luxury within premium cruise pricing",
      "markdown": "**We'd avoided suites as pretentious. The Retreat proved us magnificently wrong.**\n\nThirty years of marriage, retirement approaching, we decided to try The Retreat for our final working-years vacation. The price terrified us. The experience justified every penny.\n\n[Celebrity Apex's](/ships/celebrity-cruises/celebrity-apex.html) Retreat operates as a ship within a ship. Private sundeck. Private restaurant. Private lounge. Butler service that anticipates rather than reacts.\n\nLuminae became our private dining room. No reservations needed. No crowds. Just extraordinary food appearing whenever we wanted, prepared specifically for Retreat guests.\n\nThe sundeck felt scandalously private. A pool, cabanas, and attentive service in a space most passengers never see. We spent entire sea days there, reading and dozing, the ship's thousands elsewhere.\n\nOur butler—Anna—learned our preferences within hours. Coffee arrived at our door before we'd called. Restaurant tables materialized for venues we'd mentioned once. The experience felt personalized beyond anything we'd imagined.\n\n'This is different,' my husband admitted on day two.\n\n'This is what luxury means,' I corrected. 'Not flashy. Attentive.'\n\n**The lesson:** Apex's Retreat rewards those willing to invest. The experience differs qualitatively, not just quantitatively. See [our suite guide](/articles.html).\n\nWe book Retreat for significant occasions now. Some moments deserve the best Celebrity offers.",
      "author": {
        "name": "Margaret and William T.",
        "location": "Cambridge, UK"
      }
    },
    {
      "title": "The Magic Carpet Bar at Sunset",
      "persona_label": "Signature Experience",
      "persona": "experience",
      "intended_reader": "Travelers seeking unique cruise ship experiences",
      "core_insight": "Apex's Magic Carpet sunset bar creates unrepeatable moments",
      "markdown": "**I didn't understand the Magic Carpet until sunset cocktails explained it.**\n\nThe cantilevered platform had seemed like a gimmick during boarding—engineering showmanship without clear purpose. I'd seen it move between decks and shrugged. Impressive, but so what?\n\nThen someone suggested Magic Carpet cocktails at sunset.\n\n[Celebrity Apex's](/ships/celebrity-cruises/celebrity-apex.html) Magic Carpet rises to Deck 16 each evening and transforms into a bar. A bar suspended fourteen feet beyond the ship's edge. A bar where the only thing between your martini and the ocean is glass and air.\n\nI sat at the edge as the sun dropped toward the Atlantic. The horizon curved slightly—genuinely curved, the earth revealing itself from this impossible vantage. Other passengers gathered, all of us suspended together above the sea.\n\n'This is why they built it,' I realized aloud.\n\n'This is why I sail Edge Class,' the woman beside me agreed.\n\nThe sunset collaborated with Celebrity's engineering. Gold light spread across the platform. The ocean turned colors beneath us. The Magic Carpet had purpose after all—it existed for this moment, this impossibility, this drink at the edge of everything.\n\n**The truth:** Apex's Magic Carpet sunset bar creates experiences no other ship can offer. The engineering exists for the moment. See [our Edge Class guide](/articles.html).\n\nI arrive at Magic Carpet an hour before sunset now. The wait is the prelude. The experience is worth every minute.",
      "author": {
        "name": "David K.",
        "location": "Glasgow, UK"
      }
    },
    {
      "title": "From Solstice Class to Edge: Worth the Upgrade",
      "persona_label": "Ship Comparison",
      "persona": "upgrade",
      "intended_reader": "Solstice Class loyalists considering Edge Class",
      "core_insight": "Apex's Edge Class innovations represent genuine advancement over Solstice",
      "markdown": "**I'd cruised Solstice, Eclipse, and Silhouette. Apex showed me what I'd been missing.**\n\nSolstice Class ships are excellent—I'd been loyal for a decade, defending them against Edge Class hype. 'What can Edge offer that Solstice doesn't?' I'd argued. 'It's the same cruise line.'\n\nThen I sailed [Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html).\n\nThe difference wasn't subtle. Magic Carpet offered experiences Solstice can't replicate. Eden created spaces Solstice doesn't contain. Infinite Verandas reimagined staterooms Solstice's design couldn't achieve.\n\nThe main dining room impressed me most. Same Celebrity culinary philosophy, but Edge's kitchen design improved execution. Dishes arrived at proper temperatures. Service flowed more smoothly. The same recipes, prepared better.\n\n'I didn't realize what we were missing,' I told my husband.\n\n'You defended Solstice for years,' he reminded me.\n\n'I was wrong,' I admitted. 'Edge is genuinely better.'\n\nThe upgrade doesn't diminish Solstice memories. Those ships served us well. But Apex represents evolution—the same Celebrity values, better realized through newer design.\n\n**The lesson:** Apex's Edge Class innovations reward longtime Celebrity guests who upgrade. The loyalty transfers. The experience elevates. See [our ship comparison guide](/articles.html).\n\nI book Edge Class specifically now. Solstice was wonderful. Apex is better.",
      "author": {
        "name": "Susan M.",
        "location": "Leeds, UK"
      }
    },
    {
      "title": "Our Kids Discovered Vikings",
      "persona_label": "Family Discovery",
      "persona": "family",
      "intended_reader": "Families planning Northern European cruises with children",
      "core_insight": "Apex creates educational family experiences through Nordic itineraries",
      "markdown": "**We wanted our children to learn history through experience. Celebrity Apex delivered Viking sagas come to life.**\n\nOur boys are ten and thirteen—ages that find textbooks boring but Vikings fascinating. Previous family cruises had been Caribbean entertainment; this time we wanted education. [Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) sailing Northern Europe promised something different.\n\nThe Camp at Sea counselors had researched the itinerary. Before Bergen, they'd taught Viking mythology. Before Oslo, they'd explored Nordic navigation. Our ten-year-old came back from the kids' club quoting Odin. Our thirteen-year-old had built a replica longship.\n\n'They're learning without knowing they're learning,' my wife observed.\n\n'That's the best kind,' I agreed.\n\nThe ports reinforced everything. Bergen's Bryggen wharf made centuries of history tangible. Oslo's Viking Ship Museum brought the kids' club lessons alive. They weren't just seeing Scandinavia—they were understanding it.\n\nFamily time on the ship worked perfectly too. Eden's garden spaces gave us quiet evenings together, the boys finally calm after port adventures. The Magic Carpet fascinated the ten-year-old's engineering brain—he spent hours watching it move between decks, trying to understand the mechanics.\n\nThe service recovery came in Geiranger. Heavy fog threatened to cancel our fjord excursion. The crew rearranged everything—educational programming about fjord geology for the boys while we waited, then a later departure when the weather cleared. What could have been disappointed kids became engaged kids.\n\n'I want to be a glaciologist,' our ten-year-old announced after the geology session.\n\n'Last week you wanted to be a Viking,' I reminded him.\n\n'I can be both,' he decided.\n\nThe Oceanview Cafe accommodated picky eaters without making parents apologize. The pool deck had space for actual swimming. The shows entertained adults while keeping children engaged. Apex had clearly designed for families without sacrificing sophistication.\n\n**The truth:** Apex serves families seeking educational experiences through thoughtful programming and Nordic itineraries. Kids learn. Parents relax. Everyone wins. See [our family cruise guide](/articles.html).\n\nWe've booked Apex's Baltic itinerary for next summer. The boys are already researching Russian history.",
      "author": {
        "name": "Jonathan and Claire W.",
        "location": "Bristol, UK"
      }
    },
    {
      "title": "Our Honeymoon Chased the Midnight Sun",
      "persona_label": "Honeymoon Bliss",
      "persona": "honeymoon",
      "intended_reader": "Newlyweds planning unique honeymoon experiences",
      "core_insight": "Apex creates unforgettable honeymoon through Nordic natural phenomena",
      "markdown": "**Beaches are for everyone's honeymoon. We wanted ours to chase the midnight sun.**\n\nWe'd dated for five years before getting engaged. By the time we married, Caribbean beaches felt ordinary. We wanted our honeymoon to be extraordinary—something we'd never experience otherwise. [Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) sailing above the Arctic Circle promised exactly that.\n\nThe Infinite Veranda became our private observatory. We'd wake at 2 AM and watch golden light streaming through windows that should have shown darkness. The sun hovering above the horizon, refusing to set, while we lay in bed marveling at impossibility. No resort could offer this.\n\nThe Magic Carpet at midnight was our defining moment. Champagne at the edge of the cantilevered platform, the Norwegian Sea glowing beneath us, the sun painting the water gold at an hour when normal places would be dark. 'This is our honeymoon,' my husband said. 'This is what we'll remember forever.'\n\nEden served our romantic dinners. The living plants surrounding us while we ate food that matched the Nordic voyage—fresh seafood, local preparations, the sense that the ship was honoring the waters we sailed. The performers created atmosphere without intruding.\n\nThe fjords became our backdrop. Waking to Geirangerfjord's cliffs on our fourth morning felt like waking inside a dream. Waterfalls cascading past our balcony. The kind of beauty that makes new marriages feel ancient in the best way.\n\nOne evening, clouds threatened to block the midnight sun we'd planned around. The crew noticed our concern—honeymooners hoping for the phenomenon that defined our voyage. They found us a spot on a higher deck with clearer skies and appeared with champagne. The clouds parted. The sun performed.\n\n'How did they know how much this mattered?' I asked my husband.\n\n'Honeymoons matter,' he said. 'And they pay attention.'\n\nThe voyage created intimacy through shared wonder. We weren't just relaxing together—we were experiencing impossibilities together. The midnight sun became our story.\n\n**The truth:** Apex creates honeymoon magic through Nordic natural phenomena. The midnight sun offers what beaches cannot—the extraordinary. See [our honeymoon cruise guide](/articles.html).\n\nWe're planning our fifth anniversary on Apex. Some honeymoons define marriages.",
      "author": {
        "name": "Rebecca and David H.",
        "location": "Edinburgh, UK"
      }
    },
    {
      "title": "Seventy-Eight and Seeing the Northern Lights",
      "persona_label": "Senior Discovery",
      "persona": "elderly",
      "intended_reader": "Senior travelers seeking bucket-list northern experiences",
      "core_insight": "Apex makes Nordic dreams accessible for seniors through thoughtful design",
      "markdown": "**The Northern Lights had been on my bucket list for fifty years. At seventy-eight, Celebrity Apex finally brought me to them.**\n\nMy late husband and I had always planned a Norway trip. Life intervened—children, careers, his illness, then his passing. The Northern Lights became the dream I'd never reach. My daughter refused to accept that.\n\n'Mum,' she said, 'Apex has a shoulder-season sailing. You're going.'\n\n[Celebrity Apex](/ships/celebrity-cruises/celebrity-apex.html) made the impossible possible.\n\nThe ship's design accommodates senior limitations I hadn't even voiced. Wide corridors for my walker on difficult days. Elevators everywhere. Seating throughout public spaces when my legs needed rest. I never felt excluded from any experience.\n\nThe crew understood without requiring explanation. When I mentioned the Northern Lights were my reason for the voyage, they organized wake-up calls for aurora alerts. At 3 AM on night four, my cabin phone rang. 'Mrs. Patterson, the lights are dancing. Deck 15.'\n\nI'll never forget what I saw. Green curtains rippling across Norwegian sky. My husband should have been beside me. But somewhere, he was watching me watch his dream become mine. The tears froze on my cheeks. I didn't care.\n\nThe Sky Observation Lounge provided warm viewing when the cold became too much. Floor-to-ceiling windows facing the aurora. Hot cocoa appearing without request. The crew had positioned chairs for seniors who couldn't stand through the displays. Thoughtfulness in every detail.\n\nEden became my daily retreat. The garden sections offered comfortable seating where I could read, watch, exist without the pressure to do. The venue understood that seniors need beauty at their own pace. I spent hours there, remembering Robert, feeling grateful.\n\nA moment of dizziness in the dining room tested the crew's response. Within thirty seconds, a chair appeared. Within a minute, the medical team was discreetly checking on me. Dehydration—easily fixed. But the speed and gentleness of their response revealed everything about Celebrity's senior awareness.\n\n**The truth:** Apex makes Nordic bucket-list experiences accessible for seniors. The Northern Lights don't require youth—they require a ship that accommodates age. See [our senior cruise guide](/articles.html).\n\nI crossed off a fifty-year dream. Robert would have loved watching me watch those lights.",
      "author": {
        "name": "Margaret P.",
        "location": "Cambridge, UK"
      }
    }
  ]
}
