{
  "ship": "Celebrity Seeker",
  "ship_class": "Expedition Class (Future)",
  "cruise_line": "Celebrity Cruises",
  "last_updated": "2026-01-03",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "Seeking New Expedition Horizons",
      "persona_label": "Future Vision",
      "persona": "anticipation",
      "intended_reader": "Travelers interested in upcoming expedition ships",
      "core_insight": "Seeker represents Celebrity's expedition expansion",
      "markdown": "**Celebrity is building a new expedition ship. Seeker will expand the Galápagos success.**\n\n[Celebrity Seeker](/ships/celebrity-cruises/celebrity-seeker.html) is planned to join the fleet as Celebrity expands its expedition cruising program. Building on the success of Xpedition and Flora, Seeker will bring Celebrity's premium approach to new expedition destinations.\n\nThe name suggests purpose: seeking adventures, seeking destinations, seeking experiences that traditional cruise ships can't provide. The expedition philosophy that works in Galápagos will expand.\n\nDetails remain emerging. But the direction is clear—Celebrity sees expedition cruising as core to its future, and Seeker will help fulfill that vision.\n\n**The promise:** Seeker will bring Celebrity expedition excellence to new waters. Watch for announcements about destinations and features.\n\nThose excited about expedition should follow Seeker's development. A new ship built for seeking.",
      "author": {
        "name": "Fleet Development Team",
        "location": "Celebrity Cruises Announcements"
      }
    },
    {
      "title": "What Seeker Might Offer",
      "persona_label": "Expedition Expectations",
      "persona": "expedition",
      "intended_reader": "Expedition enthusiasts anticipating new ships",
      "core_insight": "Seeker will likely build on Flora's innovations",
      "markdown": "**What might Seeker bring to expedition cruising?**\n\n[Celebrity Seeker](/ships/celebrity-cruises/celebrity-seeker.html) will likely build on what Flora pioneered—purpose-built expedition design, luxury accommodations, expert naturalist programs.\n\nThe infinite verandas that connect cabins to wildlife. The dining programs that exceed expedition expectations. The sustainability features that respect fragile ecosystems.\n\nNew destinations seem likely—perhaps polar expeditions, perhaps tropical islands, perhaps routes that Galápagos success has made possible.\n\n**The anticipation:** Seeker represents expedition cruising's future at Celebrity. The ship that will help define what expedition means.\n\nThose who love expedition should anticipate Seeker. A new chapter in Celebrity's adventure story.",
      "author": {
        "name": "Fleet Development Team",
        "location": "Celebrity Cruises Announcements"
      }
    }
  ]
}
