{
  "title": "File:Forma filigranata chiaroscuro - Museo scienza tecnologia Milano 03161 01.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Forma_filigranata_chiaroscuro_-_Museo_scienza_tecnologia_Milano_03161_01.jpg/1280px-Forma_filigranata_chiaroscuro_-_Museo_scienza_tecnologia_Milano_03161_01.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/4/48/Forma_filigranata_chiaroscuro_-_Museo_scienza_tecnologia_Milano_03161_01.jpg",
  "width": 1200,
  "height": 800,
  "license": "CC BY-SA 4.0",
  "license_url": "https://creativecommons.org/licenses/by-sa/4.0",
  "author": "Unknown",
  "description": "Telaio rettangolare in legno sul quale è fissata una rete in fili di metallo molto sottili che formano la tela filigranatrice. Su questa rete, che funge da setaccio, sono ricamati con un altro filo metallico un profilo di uomo e una scritta \"Giovanni Amatruda\", che realizzano una filigrana in chiaroscuro. Sul retro è presente una struttura di vergature in legno in senso verticale e lungo le due diagonali. Sul telaio è appoggiata una cornice in legno con rinforzo in metallo (cascio).\n<dl><dt>Funzione</dt></dl>\n<p>Per la produzione artigianale di fogli filigranati\n</p>\n<dl><dt>Modalità d'uso</dt></dl>\n<p>Il lavorante immerge forma e cascio nel tino e ne estrae ogni volta la stessa quantità di pasta che distribuisce uniformemente su tutta la superficie della rete. La forma è il mezzo con il quale si ottiene la feltrazione delle fibre. Appena il foglio si è formato, il lavorante passa la forma al ponitore, il quale dopo aver lasciato per un momento scolare l'acqua, adagia la forma su un feltro di lana determinando il distacco del foglio. Un foglio e un feltro sopra l'altro formano una posta che viene viene messa sotto una pressa. Avviene così la prima disidratazione dei fogli.\n</p>\n<dl><dt>Notizie storico-critiche</dt></dl>\nQuesta forma filigranata è stata donata al Museo per la Mostra Storica della Carta e della Stampa che venne realizzata in occasione della \"Esposizione Internazionale di Grafica Editoriale Cartaria\" tenutasi dal 3 all'11 Ottobre 1959 presso la Fiera di Milano. Questa Esposizione Internazionale ha visto riuniti costruttori di macchine, apparecchi ed attrezzi, produttori di carta e affini, produttori di inchiostri e caratteri, stampatori ed editori, interessati di arti grafiche e pubblicità. Molte macchine e materiali esposti per la \"Mostra Storico-Tecnica della Carta e dell'Arte della Stampa\" sono stati successivamente donati o dati in deposito permanente all'allora \"Museo della Scienza e della Tecnica\" di Milano La Mostra della carta prevedeva esempi di papiro, pergamena, filigrane e la ricostruzione di una gualchiera medievale che rappresentasse le fasi di lavorazione per la produzione di carta a partire dagli stracci La fabbricazione della carta derivata prima dalla corteccia di gelso e poi dagli stracci, nasce in Cina intorno al 105 a.C a cura di Ts'ai Luin. A partire dall'VII secolo si diffonde in Corea e Giappone. A metà dell'VIII secolo gli Arabi impararono dai Cinesi l'arte della fabbricazione della carta, la migliorarono sia nei materiali utilizzati sia nei processi di fabbricazione e la introdussero in Europa nel XII secolo. In Italia, Fabriano fu il centro più importante di produzione della carta. Nella seconda metà del XII secolo nasce la prima cartiera a Fabriano che ben presto impiegò solo maestranze locali. Dall'Italia la produzione si diffuse in tutta Europa. Le innovazioni maggiori che apportarono i cartai Fabrianesi furono l'introduzione della pila idraulica a magli per la sfibratura, la sostituzione dell'amido vegetale con la gelatina animale per la collatura, il perfezionamento delle forme e l'introduzione della filigrana L'introduzione delle cartiere nel territorio amalfitano avvenne nel corso del XIII secolo. I mulini ad acqua della zona vennero gradualmente trasformati in gualchiere prima e cartiere poi Gli Amalfitani divennero ben presto importanti produttori di carta di ottima qualità. Nel XV secolo erano attive ad Amalfi 12 cartiere L'introduzione del carattere tipografico mobile nel XV secolo, diede poi un grosso impulso alla stampa dei libri e quindi alla fabbricazione della carta Le prime macchine per la fabbricazione della carta che sostituirono la produzione manuale furono della fine del XVIII secolo prima in Francia (L. N  Robert) e poi in Inghilterra (G. e S. Fourdrinier). Negli stessi anni si iniziò anche a sbiancare il pesto di stracci con procedimenti al Cloro. Verso la fine del XVIII secolo, la produzione meccanizzata di carta con macchine continue, portava all'abbandono dei metodi di lavorazione artigianali. Però i Borboni riuscirono a sostenere la produzione di Amalfi, che vedeva 38 cartiere attive nel 1861. Il tramonto dei Borboni, la competizione con i prodotti industriali, la lontananza dalle vie di comunicazione contribuirono alla decadenza dell'industria cartaria amalfitana. Nel 1954 un'alluvione della Valle dove erano presenti le cartiere ne rase al suolo la gran parte La decisione del mastro cartaro Luigi Amatruda di produrre fogli di pregio artigianalmente si rivelò vincente. La sua carta è tutt'oggi rinomata sia a livello nazionale che internazionale.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AForma%20filigranata%20chiaroscuro%20-%20Museo%20scienza%20tecnologia%20Milano%2003161%2001.jpg"
}