{
  "ship": "Norwegian Gem",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "qKSSki6Oodg",
        "provider": "youtube",
        "title": "NCL Gem | Full Ship Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny and Taylor as they tour through the Norwegian Gem. This remarkable ship has been renovated to perfection in order to give fellow cruisers their wants and needs. With amazing Dining options,"
      }
    ],
    "suite": [
      {
        "videoId": "VsavKZUJqu4",
        "provider": "youtube",
        "title": "NCL Gem | 2-Bedroom Deluxe Family Suite with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a 2-Bedroom Deluxe Family Suite with Balcony aboard the beautiful Norwegian Gem. With the large amount of space in this beautiful family suite; this suits any needs for a family"
      },
      {
        "videoId": "0e6iiKUzXpE",
        "provider": "youtube",
        "title": "NCL Gem | Aft Club Balcony Suite Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours an Aft Club Balcony Suite aboard the beautiful Norwegian Gem. This stateroom sleeps 4 comfortably, and being in a club suite, you will have access to perks such as early reserva"
      },
      {
        "videoId": "mzvcOXpVyJw",
        "provider": "youtube",
        "title": "NCL Gem | Aft Club Balcony Suite Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours an Aft Club Balcony Suite aboard the beautiful Norwegian Gem. This stateroom sleeps 4 comfortably, and being in a club suite, you will have access to perks such as early reserva"
      },
      {
        "videoId": "IeKtuztJTl4",
        "provider": "youtube",
        "title": "NCL Gem | Club Balcony Suite Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Club Balcony Suite aboard the beautiful Norwegian Gem. This stateroom sleeps 4 comfortably, and being in a club suite, you will have access to perks such as early reservations"
      },
      {
        "videoId": "lsDrs10TavI",
        "provider": "youtube",
        "title": "NCL Gem | Haven Deluxe Owner's Suite with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Deluxe Owner's Suite with Balcony aboard the beautiful Norwegian Gem. Located in the Haven this suite will provide all the accommodations you will need. With the breatht"
      },
      {
        "videoId": "aR8eO2DJG0o",
        "provider": "youtube",
        "title": "NCL Gem | Haven Deluxe Owner's Suite with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Deluxe Owner's Suite with Large Balcony aboard the beautiful Norwegian Gem. Located in the Haven this suite will provide all the accommodations you will need. With the b"
      },
      {
        "videoId": "PaPmTbaqVP0",
        "provider": "youtube",
        "title": "NCL Gem | Haven Owner's Suite with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Owner's Suite with Large Balcony aboard the beautiful Norwegian Gem. Located in the Haven this suite will provide all the accommodations you will need. Included with thi"
      },
      {
        "videoId": "XtE0sNHUwDg",
        "provider": "youtube",
        "title": "NCL Gem | Aft Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Aft Balcony aboard the beautiful Norwegian Gem. This stateroom sleeps 4 comfortably, and provides beautiful views off the aft of the ship! Reach out when you are ready to book"
      },
      {
        "videoId": "MrMx3Mmj4wo",
        "provider": "youtube",
        "title": "NCL Gem | Aft Family Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Aft Facing Family Balcony aboard the beautiful Norwegian Gem. With enough room for the entire family, these staterooms offer plenty of space, storage, and incredible aft facin"
      },
      {
        "videoId": "9Vqku5Z0AR0",
        "provider": "youtube",
        "title": "NCL Gem | Balcony Stateroom Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Balcony Stateroom aboard the beautiful Norwegian Gem. This stateroom sleeps 4 comfortably, and provides beautiful views off the side of the ship! Reach out when you are ready "
      },
      {
        "videoId": "1m5_hB8zzx8",
        "provider": "youtube",
        "title": "NCL Gem | Family Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Facing Family Balcony aboard the beautiful Norwegian Gem. With enough room for the entire family, these staterooms offer plenty of space, storage, and incredible side facing v"
      },
      {
        "videoId": "ZQmrppa6xgc",
        "provider": "youtube",
        "title": "NCL Gem | Forward Deluxe Penthouse with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Forward-Facing Deluxe Penthouse with Large Balcony aboard the beautiful Norwegian Gem. Freshly renovated, these forward facing suites have a unique layout with plenty of room "
      },
      {
        "videoId": "1hURyxUKc8U",
        "provider": "youtube",
        "title": "NCL Gem | Haven 2-Bedroom Family Villa with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven 2-Bedroom Family Villa with Balcony aboard the beautiful Norwegian Gem. With enough room for the entire family, these spacious suites offer amazing views and have lots o"
      },
      {
        "videoId": "RvsRO-Ds3EY",
        "provider": "youtube",
        "title": "NCL Gem | Haven Courtyard Penthouse with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Courtyard Penthouse with Balcony aboard the beautiful Norwegian Gem. These Penthouses are located in The Haven and include a king-size bed and single sofa-bed, plus a pr"
      },
      {
        "videoId": "-ODafuG-anM",
        "provider": "youtube",
        "title": "NCL Gem | Interior Stateroom Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Interior Stateroom aboard the beautiful Norwegian Gem. As of the most affordable stateroom options on the ship, and with some sleeping up to 4 people (2 adults, and 2 kids), t"
      },
      {
        "videoId": "EyExIsTzJd8",
        "provider": "youtube",
        "title": "NCL Gem | Haven 3 Bedroom Garden Villa Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he takes you on a tour of the incredible Haven 3 Bedroom Garden Villa onboard the beautiful Norwegian Gem. This incredible suite gives you access to The Haven complex, priority embark an"
      }
    ]
  }
}