{
  "ship": "Norwegian Spirit",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "Z7Hdg8KTjQI",
        "provider": "youtube",
        "title": "NCL Spirit | Aft-Facing Owner's Suite with Balcony Full Tour & Review 4K | Category SB",
        "description": "Join Danny as he tours a Aft-Facing Owner's Suite with Balcony aboard the beautiful Norwegian Spirit. Freshly renovated, these Aft facing suites have a unique layout with plenty of room to spread out."
      },
      {
        "videoId": "M7rxJ2LdEYM",
        "provider": "youtube",
        "title": "NCL Spirit | Aft-Facing Penthouse Suite with Large Balcony Full Tour & Review 4K | Category SF",
        "description": "Join Danny as he tours a Aft-Facing Penthouse Suite with Large Balcony aboard the beautiful Norwegian Spirit. Freshly renovated, these two aft categories in Danny's favorite location on the ship. Rela"
      },
      {
        "videoId": "3NCVqA-XIcY",
        "provider": "youtube",
        "title": "NCL Spirit | Balcony Stateroom Full Tour & Review 4K | Category BA, BB, BF, BC",
        "description": "Join Danny as he tours a Balcony Stateroom aboard the beautiful Norwegian Spirit. Freshly renovated, these balcony staterooms come in a couple configurations. The \"Family Balcony\" can hold up to 4 gue"
      },
      {
        "videoId": "Th-rhGntVh8",
        "provider": "youtube",
        "title": "NCL Spirit | Forward-Facing Deluxe Penthouse with Large Balcony Full Tour & Review 4K | Category SC",
        "description": "Join Danny as he tours a Forward-Facing Deluxe Penthouse with Large Balcony aboard the beautiful Norwegian Spirit. Freshly renovated, these forward facing suites have a unique layout with plenty of ro"
      },
      {
        "videoId": "13P2u2b5mZ4",
        "provider": "youtube",
        "title": "NCL Spirit | Forward-Facing Penthouse with Large Balcony Full Tour & Review 4K | Category SE",
        "description": "Join Danny as he tours a Forward-Facing Penthouse with Large Balcony aboard the beautiful Norwegian Spirit. Freshly renovated, these forward facing suites have a unique layout with plenty of room to s"
      },
      {
        "videoId": "zORIENwcHvk",
        "provider": "youtube",
        "title": "NCL Spirit | Full Ship Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny and Taylor on a full walkthrough tour of the NCL Spirit. This modernized and newly renovated ship offers the best within this spectacular fleet. With the exceptional dining on this ship and"
      },
      {
        "videoId": "WuAzXPF5G-A",
        "provider": "youtube",
        "title": "NCL Spirit | Inside Stateroom Full Tour & Review 4K | Category IA, IB, IF",
        "description": "Join Danny as he tours an Inside Stateroom aboard the beautiful Norwegian Spirit. Freshly renovated, these interior categories come in several configurations that are the cheapest option on the ship. "
      },
      {
        "videoId": "eZkgKIfMZLw",
        "provider": "youtube",
        "title": "NCL Spirit | Large Oceanview Picture Window Stateroom Full Tour & Review 4K | Category O3",
        "description": "Join Danny as he tours a Large Oceanview Picture Window Stateroom aboard the beautiful Norwegian Spirit. This room being a step above the regular Oceanview stateroom providing a larger Oceanview windo"
      },
      {
        "videoId": "EBQzURn5U34",
        "provider": "youtube",
        "title": "NCL Spirit | Oceanview Porthole Window Stateroom Full Tour & Review 4K | Category OF",
        "description": "Join Danny as he tours a Oceanview Porthole Window Stateroom aboard the beautiful Norwegian Spirit. Freshly renovated, these Oceanview categories come in several configurations that are one of the che"
      },
      {
        "videoId": "FsKpl-Esl0U",
        "provider": "youtube",
        "title": "NCL Spirit | Oceanview Stateroom with Picture Window Full Tour & Review 4K | Category OA, OB",
        "description": "Join Danny as he tours a Oceanview Stateroom with Picture Window aboard the beautiful Norwegian Spirit. Freshly renovated, these Oceanview categories come in several configurations that offer great na"
      },
      {
        "videoId": "zaTms9qnBGc",
        "provider": "youtube",
        "title": "NCL Spirit | Penthouse Suite with Large Balcony Full Tour & Review 4K | Category SH",
        "description": "Join Danny as he tours a Penthouse Suite with Large Balcony aboard the beautiful Norwegian Spirit. Freshly renovated, these suites have a unique layout with plenty of room to spread out. Ready to book"
      }
    ]
  }
}