{
  "ship": "Norwegian Sky",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "mc2e3cJFfe0",
        "provider": "youtube",
        "title": "Norwegian Sky | Aft Balcony Stateroom Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny as he tours an Aft Balcony Stateroom aboard the beautiful Norwegian Sky. Being that this is one of the most prevalent room categories on the ship, it is a great option for many cruise passe"
      },
      {
        "videoId": "7TSQHdE3WHc",
        "provider": "youtube",
        "title": "Norwegian Sky | Balcony Stateroom Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny as he tours a Balcony Stateroom aboard the beautiful Norwegian Sky. Being that this is one of the most prevalent room categories on the ship, it is a great option for many cruise passengers"
      },
      {
        "videoId": "3mhj7Hm_MiU",
        "provider": "youtube",
        "title": "Norwegian Sky | Family Inside Stateroom Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny as he tours a Family Inside Stateroom aboard the beautiful Norwegian Sky. Being that this is one of the most prevalent room categories on the ship, it is a great option for many cruise pass"
      },
      {
        "videoId": "-XefADGUBuc",
        "provider": "youtube",
        "title": "Norwegian Sky | Family Ocean View Stateroom Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny as he tours a Family Ocean View Stateroom aboard the beautiful Norwegian Sky. This room is a wonderful option for families desiring a room with a bit more space and beautiful ocean views. R"
      },
      {
        "videoId": "U44Yhuu0mr4",
        "provider": "youtube",
        "title": "Norwegian Sky | Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny and Taylor as they tour the incredible Norwegian Sky. From the pool deck, to the casino, to all the specialty dining, Norwegian Sky is a beautiful vessel that offers an incredible vacation!"
      },
      {
        "videoId": "UV7J_6bf7CU",
        "provider": "youtube",
        "title": "Norwegian Sky | Inside Stateroom Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny as he tours an Inside Stateroom aboard the beautiful Norwegian Sky. Being that this is one of the most prevalent room categories on the ship, it is a great option for many cruise passengers"
      },
      {
        "videoId": "OawxJqsZomw",
        "provider": "youtube",
        "title": "Norwegian Sky | Ocean View Large Porthole Window Stateroom Full Walkthrough Tour | 2024",
        "description": "Join Danny as he tours an Ocean View Large Porthole Window Stateroom aboard the beautiful Norwegian Sky. This room is a wonderful option guests who wish to be budget-conscious, while still enjoying an"
      },
      {
        "videoId": "LCUx7_tQmdU",
        "provider": "youtube",
        "title": "Norwegian Sky | Ocean View Picture Window Stateroom Full Walkthrough Tour & Review 4K | 2024",
        "description": "Join Danny as he tours an Ocean View Picture Window Stateroom aboard the beautiful Norwegian Sky. This room is a wonderful option guests who wish to be budget-conscious, while still enjoying an ocean "
      }
    ]
  }
}