{
  "ship": "Norwegian Breakaway",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "SD3JyZAQ6cI",
        "provider": "youtube",
        "title": "NCL Breakaway | Aft Balcony Stateroom Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through an Aft Balcony Stateroom aboard the Norwegian Breakaway. This is a great entry level balcony stateroom that accommodates up to 3 guests and providing amazing views out t"
      },
      {
        "videoId": "T4HftSc7Smo",
        "provider": "youtube",
        "title": "NCL Breakaway | Balcony Stateroom Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through a Balcony Stateroom aboard the Norwegian Breakaway. This is a great entry level balcony stateroom that accommodates up to 4 guests within the room itself but also being "
      },
      {
        "videoId": "ekTh81RNJ1c",
        "provider": "youtube",
        "title": "NCL Breakaway | Club Balcony Suite Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through the Club Balcony Suite aboard the Norwegian Breakaway. Accommodating up to 4 guests this suite is great for a vacation getaway. These Club Balcony options are in a nice "
      },
      {
        "videoId": "A7JFHGqp2ds",
        "provider": "youtube",
        "title": "NCL Breakaway | Family Balcony Stateroom Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Family Balcony Stateroom aboard the beautiful Norwegian Breakaway. Being that this is one of the most prevalent room categories on the ship, it is a great option for many crui"
      },
      {
        "videoId": "2GP_kblJ6SQ",
        "provider": "youtube",
        "title": "NCL Breakaway | Full Ship Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny and Taylor on a full walkthrough tour of the Norwegian Breakaway. Norwegian Breakaway is ready to whisk you away to your best vacation yet. Take a Caribbean cruise and swim with dolphins, s"
      },
      {
        "videoId": "fkLd5oycHqw",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven Aft-Facing Penthouse Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours the Haven Aft-Facing Penthouse With Master Bedroom and Balcony aboard the Norwegian Breakaway. Not only are these a customer favorite, but they are one of Danny's favorite rooms"
      },
      {
        "videoId": "T4GYr3XWvS0",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven Deluxe Owners Suite Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through the Haven Deluxe Owner’s Suite aboard the brand new Norwegian Breakaway. Located in the haven this suite will provide all the accommodations you will need. With the brea"
      },
      {
        "videoId": "IT8QKU6_0Xg",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven Forward-Facing Penthouse Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny on a tour of The Haven Forward-Facing Penthouse with Balcony on the beautiful Norwegian Breakaway. They offer superior comfort to a standard balcony or a mini-suite category room. With a ki"
      },
      {
        "videoId": "3amNknS_5GA",
        "provider": "youtube",
        "title": "NCL Breakaway | Large Balcony Stateroom Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Large Balcony Stateroom aboard the beautiful Norwegian Breakaway. This balcony type has the same interior as a standard balcony stateroom, but with a larger balcony outside. R"
      },
      {
        "videoId": "ANBkcP6HUcw",
        "provider": "youtube",
        "title": "NCL Breakaway | Studio Stateroom Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Studio Inside Stateroom aboard the brand new Norwegian Breakaway. This Interior Stateroom is perfect for the solo traveler looking for a vacation getaway. Reach out when you a"
      }
    ],
    "suite": [
      {
        "videoId": "7QkveVXb9G0",
        "provider": "youtube",
        "title": "NCL Breakaway | Aft-Facing Club Balcony Suite Virtual Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through an Aft-Facing Club Balcony Suite aboard the Norwegian Breakaway. Accommodating up to 4 guests this suite is great for a vacation getaway. These Aft Club Balcony options "
      },
      {
        "videoId": "EqvagDaRhug",
        "provider": "youtube",
        "title": "NCL Breakaway | Club Balcony Suite with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through the Club Balcony Suite with Large Balcony aboard the Norwegian Breakaway. Accommodating up to 4 guests this suite is great for a vacation getaway. These Club Balcony opt"
      },
      {
        "videoId": "4CyMlNwZNx8",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven Deluxe Owners Suite Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Deluxe Owner's Suite with Large Balcony aboard the beautiful Norwegian Breakaway. These incredible forward facing suites are located within the Haven Courtyard and are j"
      },
      {
        "videoId": "HEvz6iXiStE",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven 2-Bedroom Family Villa with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a 2 Bedroom Haven Family Villa Suite aboard the beautiful Norwegian Breakaway. With enough room for the entire family, these spacious suites offer amazing views and have lots of"
      },
      {
        "videoId": "vekbX1yzifI",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven Courtyard Penthouse with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Courtyard Penthouse aboard the beautiful Norwegian Breakaway. These Penthouses are located in The Haven and include a king-size bed and single sofa-bed, plus a private b"
      },
      {
        "videoId": "CyHyuU-aez4",
        "provider": "youtube",
        "title": "NCL Breakaway | Haven Aft-Facing Penthouse Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours The Haven Aft-Facing Penthouse with Master Bedroom and Balcony aboard the beautiful Norwegian Breakaway. With enough room for the entire family sleeping up to 4 guests, these sp"
      }
    ],
    "oceanview": [
      {
        "videoId": "8tb7SElhSJM",
        "provider": "youtube",
        "title": "NCL Breakaway | Family Oceanview Stateroom Virtual Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Taylor as we tour a Family Oceanview Stateroom abroad the brand new Norwegian Breakaway. This Oceanview Stateroom is a great way for a family or large group looking to get into a vacation getaway"
      },
      {
        "videoId": "GRq7SNlREYE",
        "provider": "youtube",
        "title": "NCL Breakaway | Oceanview Stateroom with Picture Window Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours through a Oceanview Picture Window Stateroom aboard the Norwegian Breakaway. This is a comfortable stateroom to stay in with the great views out the window. Being able to accomm"
      }
    ]
  }
}