{
  "ship": "Norwegian Aqua",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "elS0c2wg3p0",
        "provider": "youtube",
        "title": "NCL Aqua. FIRST LOOK Deck 6 Full Tour. LIVE w TMCA!",
        "description": "NCL Aqua. FIRST LOOK Deck 6 Full Tour. LIVE w TMCA! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in "
      },
      {
        "videoId": "YiPM9_LycEc",
        "provider": "youtube",
        "title": "NCL Aqua FIRST LOOK! Family Suite with Large Balcony Cabin 12102 | Tall Man's Cruise Adventures",
        "description": "NCL Aqua FIRST LOOK! Family Suite with Large Balcony Cabin 12102 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore NCL Aqua Family Suite with Large "
      },
      {
        "videoId": "UY37Id5rdeg",
        "provider": "youtube",
        "title": "NCL Aqua FIRST LOOK! Family Suite with Large Balcony Cabin 12102 | Tall Man's Cruise Adventures",
        "description": "NCL Aqua FIRST LOOK! Family Suite with Large Balcony Cabin 12102 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore NCL Aqua Family Suite with Large "
      },
      {
        "videoId": "JUZ6h3isVT0",
        "provider": "youtube",
        "title": "NCL Aqua Accessible Inside Cabin | Tall Man's Cruise Adventures",
        "description": "NCL Aqua Accessible Inside Cabin | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a First LOOK at the NCL Aqua Accessible Inside Cabin 10805—a thoughtfully d"
      },
      {
        "videoId": "NvwFf32lGMs",
        "provider": "youtube",
        "title": "NCL Aqua Cabin Tour: Is This Family Balcony Worth It?",
        "description": "First Look! NCL Aqua Family Balcony Cabin 15102 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore NCL Aqua Family Balcony Cabin 15102—a fantastic op"
      },
      {
        "videoId": "GeukObuysZ4",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Balcony Cabin 12182 | Tall Man's Cruise Adventures",
        "description": "NCL Aqua First Look! Balcony Cabin 12182 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! In this episode, we’re giving you a first look at Balcony Cabin 12182 on the br"
      },
      {
        "videoId": "t1uO4lr2Z00",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Balcony Cabin 12182 | Tall Man's Cruise Adventures",
        "description": "NCL Aqua First Look! Balcony Cabin 12182 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! In this episode, we’re giving you a first look at Balcony Cabin 12182 on the br"
      },
      {
        "videoId": "_jK7x3fdG1M",
        "provider": "youtube",
        "title": "Inside an Improv Comedy Club at NCL Aqua Deck 6 #shorts",
        "description": "See inside the Improv Comedy Club before the show! Take a peek at the space where the comedians make the comedy happen. Every seat has great views of the stage. #NCLAquaDeck6 #TallMansCruiseAdventures"
      },
      {
        "videoId": "5JP3dKxVgFg",
        "provider": "youtube",
        "title": "Aqua Theater Tour at NCL Aqua Deck 6 #shorts",
        "description": "See the unbelievable size of this convertible AquaTheater on the ship! The seats extend way back, and the stage is massive. Preparing for Prince Revolution; it’s gonna be wild! #NCLAquaDeck6 #TallMans"
      },
      {
        "videoId": "oxf9KugrqkE",
        "provider": "youtube",
        "title": "NCL Aqua Public Deck 6: Aqua Theater Stage Set Up First Look!",
        "description": "We are gearing up for the electrifying Prince Revolution! Check out the jaw-dropping size of this stage—one of the largest we've seen at sea. Get ready for an unforgettable rock concert experience! #N"
      },
      {
        "videoId": "_R1akKwfj3c",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 6: Casino",
        "description": "Join us for a thrilling journey inside the nonstop action of casinos. Discover the exciting gaming tables, exclusive high-stakes rooms, and unwind in our smoking area. This immersive experience reveal"
      },
      {
        "videoId": "azcllsOZWOM",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 6: Swirl Wine Bar",
        "description": "Join us as we explore Swirl Wine Bar on NCL Aqua’s Public Deck 6 and discover a cozy spot to sip, swirl, and unwind! 🍇✨ #NCLAqua #CruiseLife #SwirlWineBar #FirstLook #TallMansCruiseAdventures"
      },
      {
        "videoId": "y_CBZppIEeM",
        "provider": "youtube",
        "title": "NCL Aqua First Look Public Deck 8 Outside | Tall Man's Cruise Adventures",
        "description": "NCL Aqua First Look Public Deck 8 Outside | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Public Deck 8 Outside on the brand-new NCL Aqua! \ud83d"
      },
      {
        "videoId": "ilNO6TFBAQM",
        "provider": "youtube",
        "title": "Casino at Sea: NCL Aqua Deck 6",
        "description": "A cruise ship casino extends across a wide space. The casino technically never closes, maintaining constant operation. The abundance of tables creates a dynamic environment. #NCLAquaDeck6 #TallMansCru"
      },
      {
        "videoId": "V9ayPKOhJpE",
        "provider": "youtube",
        "title": "First Look at NCL Aqua Cabin Deck 16 | Tall Man's Cruise Adventures",
        "description": "First Look at NCL Aqua Cabin Deck 16 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Cabin Deck 16 on the brand-new NCL Aqua! 🚢✨ Cabin Deck"
      },
      {
        "videoId": "cIGz8AYnl1I",
        "provider": "youtube",
        "title": "First Look NCL Aqua Cabin Deck 9 | Tall Man's Cruise Adventures",
        "description": "First Look NCL Aqua Cabin Deck 9 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Cabin Deck 9 on the brand-new NCL Aqua! 🚢✨ Cabin Deck 9 of"
      },
      {
        "videoId": "SKmU2dsBawU",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Cabin Deck 13 | Tall Man's Cruise Adventures",
        "description": "First Look! NCL Aqua Cabin Deck 13 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Cabin Deck 13 on the brand-new NCL Aqua! 🚢✨ Cabin Deck 1"
      },
      {
        "videoId": "qHAYUNlBXV4",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Cabin Deck 15 | Tall Man's Cruise Adventures",
        "description": "First Look! NCL Aqua Cabin Deck 15 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Cabin Deck 15 on the brand-new NCL Aqua! 🚢✨ Cabin Deck 1"
      },
      {
        "videoId": "Zzn2_Al6LGc",
        "provider": "youtube",
        "title": "FIRST LOOK! NCL Aqua Cabin Deck 5 | Tall Man's Cruise Adventures",
        "description": "FIRST LOOK! NCL Aqua Cabin Deck 5 | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we take a FIRST LOOK at Cabin Deck 5 on the brand-new NCL Aqua! 🚢✨ Cabin D"
      },
      {
        "videoId": "TB3SzHUhw_Q",
        "provider": "youtube",
        "title": "NCL Aqua Deck 6 Exploration: Improv, Azuki, & Elevator Tour! #shorts",
        "description": "Explore Deck 6! Find hidden cages and ATMs on this unique cruise ship tour. What surprises await around every corner? Let us know your favorite deck features! #NCLAquaDeck6 #TallMansCruiseAdventures #"
      },
      {
        "videoId": "zmnsNvGbi4Q",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Cabin Deck 11 | Tall Man's Cruise Adventures",
        "description": "NCL Aqua First Look! Cabin Deck 11 | Tall Man's Cruise Adventures 🛳️ Welcome to Tall Man's Cruise Adventures! Today, we’re taking you on a first look at a cabin on Deck 11 aboard the dazzling Norwegi"
      },
      {
        "videoId": "sSD1wwbXQqA",
        "provider": "youtube",
        "title": "Smoking Casino Tour at NCL Aqua Deck 6",
        "description": "See the smoking casino room that's got everyone talking! It's separated to keep smoke away from others but still has tables inside. 'Normally smoking areas don't have tables...' #NCLAquaDeck6 #TallMan"
      },
      {
        "videoId": "9UfYx7Xg4hs",
        "provider": "youtube",
        "title": "What’s on Deck 17 and Up on NCL Aqua? | Tall Man's Cruise Adventures",
        "description": "What’s on Deck 17 and Up on NCL Aqua? | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore What’s on Deck 17 and Up on NCL Aqua—a must-see for anyone c"
      }
    ],
    "accessible": [
      {
        "videoId": "7zGtzCjmu0Q",
        "provider": "youtube",
        "title": "NCL Aqua Deck 6 Secrets: Stunning Atrium & Hidden Features! #shorts",
        "description": "Touring the ship's central atrium and exploring digital deck plans. Navigating accessible routes and discovering hidden features. 'Explore the ship'—digital boards reveal all! #NCLAquaDeck6 #TallMansC"
      },
      {
        "videoId": "0otIRf6f5fw",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 6: Aqua Theater",
        "description": "Discover the Aqua Theater aboard the ship—a convertible space that hosts stunning performances. Join us as we explore its features, including accessible facilities and its unique ambiance. Get ready f"
      }
    ],
    "suite": [
      {
        "videoId": "kvhTS5s34dQ",
        "provider": "youtube",
        "title": "Inside Norwegian Aqua: NCL’s Inaugural Cruise Unveiled!",
        "description": "Inside Norwegian Aqua: NCL’s Inaugural Cruise Unveiled! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship"
      },
      {
        "videoId": "WpbTljOKInM",
        "provider": "youtube",
        "title": "Day 9 LIVE from NCL Aqua!!! With Special Guest!",
        "description": "Day 9 LIVE from NCL Aqua!!! With Special Guest! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in the "
      },
      {
        "videoId": "VmO0Qwd7KEw",
        "provider": "youtube",
        "title": "LIVE From NCL AQUA's Maiden Voyage With Tall Man's Cruise Adventures",
        "description": "LIVE From NCL AQUA's Maiden Voyage With Tall Man's Cruise Adventures Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As t"
      },
      {
        "videoId": "UiKixS_brZ0",
        "provider": "youtube",
        "title": "LIVE from The NCL Aqua! Cancelled CRUISE!!! What a Mess!",
        "description": "LIVE from The NCL Aqua! Cancelled CRUISE!!! What a Mess! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first shi"
      },
      {
        "videoId": "fInnCMNUqrw",
        "provider": "youtube",
        "title": "LIVE From the NCL AQUA. Maiden Voyage!",
        "description": "LIVE From the NCL AQUA. Maiden Voyage! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in the Prima Plu"
      },
      {
        "videoId": "uerlyNksMX8",
        "provider": "youtube",
        "title": "NCL Aqua FIRST LOOK! LIVE... W TMCA's",
        "description": "NCL Aqua FIRST LOOK! LIVE... W TMCA's (Tall Man's Cruise Adventures) Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As t"
      },
      {
        "videoId": "eXfOCIQ6SrA",
        "provider": "youtube",
        "title": "NCL Aqua FIRST LOOK. LIVE!!! Deck 8 W/ TMCA's",
        "description": "NCL Aqua FIRST LOOK. LIVE!!! With Tall Man's Cruise Adventures. Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the fi"
      },
      {
        "videoId": "adsXMpz0PhQ",
        "provider": "youtube",
        "title": "NCL Aqua MAIDEN Voyage Day 7. LIVE from the Ship!!!",
        "description": "NCL Aqua MAIDEN Voyage Day 7. LIVE from the Ship!!! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in "
      },
      {
        "videoId": "m6uXCwIsu9g",
        "provider": "youtube",
        "title": "NCL Aqua Maiden Voyage. LIVE Cabin Crawl. TMC Style!",
        "description": "NCL Aqua Maiden Voyage. LIVE Cabin Crawl. TMC Style! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in"
      },
      {
        "videoId": "RnUX5XUXUlk",
        "provider": "youtube",
        "title": "NCL AQUA! Our Honest Review of the Ship and NCL!!!",
        "description": "NCL AQUA! Our Honest Review of the Ship and NCL!!! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in t"
      },
      {
        "videoId": "zk8tjWnKHms",
        "provider": "youtube",
        "title": "NCL Aqua's Maiden Voyage. Day 10. LIVE!!! FOGGY!!!",
        "description": "NCL Aqua's Maiden Voyage. Day 10. LIVE!!! FOGGY!!! Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in t"
      },
      {
        "videoId": "EwmwaQIbGhg",
        "provider": "youtube",
        "title": "NCL AQUA. 18 Cabin Review & Quick HAVEN Look Around",
        "description": "NCL AQUA. 18 Cabin Review & Quick HAVEN Look Around Welcome aboard Norwegian Aqua, Norwegian Cruise Line’s (NCL) newest and most exciting cruise ship, launching in April 2025! 🚢 As the first ship in "
      },
      {
        "videoId": "6beCeMhlzXE",
        "provider": "youtube",
        "title": "Norwegian Aqua Cruise Ship Alters Course Due To Severe Weather",
        "description": "Norwegian Aqua Cruise Ship Alters Course Due To Severe Weather 🚨 Norwegian Aqua Itinerary Change: What You NEED to Know! 🚨 Welcome aboard Norwegian Aqua, NCL’s newest and most exciting cruise ship, "
      },
      {
        "videoId": "HhVlXDUpC0M",
        "provider": "youtube",
        "title": "Norwegian Aqua: My Fave Spots!",
        "description": "Just stepped off Norwegian Aqua and the post-cruise blues are REAL! 😭 Dreaming of those stunning ocean views. Here’s a peek at my top spots: FIRST IMPRESSIONS! Norwegian Aqua Food, Activities, HACKS!"
      }
    ],
    "top ten": [
      {
        "videoId": "xu0h_vP9Nb0",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Public Deck 8: Inside Indulge Food Court",
        "description": "We explore the essentials of creating a comprehensive hand wash station, including everything from noodles to desserts. Let's make sure not to overlook any details that keep our guests happy and safe!"
      },
      {
        "videoId": "HV_Av4z5mys",
        "provider": "youtube",
        "title": "Book Your Next Cruise Onboard at NCL Aqua Public Deck 7 First Look!",
        "description": "Discover how booking your next cruise while on board can earn you exclusive perks, including $500 in onboard credit! Don't miss out on this opportunity to enhance your cruise experience with exciting "
      },
      {
        "videoId": "UjcgNng3o0g",
        "provider": "youtube",
        "title": "NCL Aqua Deck 6: Swirl Wine Bar",
        "description": "We explore the ship's wine area and restaurant options. Our experience highlights the cohesive design and decor throughout the vessel, ensuring a delightful ambiance. We show a unified and well-themed"
      },
      {
        "videoId": "9r3qZQnJgo0",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Public Deck 7: Cagney’s Steakhouse",
        "description": "Join us as we discover the beautiful decor across the ship, including the eye-catching green chairs. Experience how each space harmonizes for an inviting atmosphere while we sneak a peek at Cagney's S"
      },
      {
        "videoId": "jLVFh0Mi6Z0",
        "provider": "youtube",
        "title": "NCL Aqua Public Deck 7: The Humidor First LOOK!",
        "description": "Join us as we explore the stunning cigar lounge aboard the latest cruise ship! With comfortable seating and a pleasant atmosphere, it's a haven for cigar lovers. Uncover the unique features that make "
      }
    ],
    "food": [
      {
        "videoId": "LwJf65Ccy7E",
        "provider": "youtube",
        "title": "Commodore Room Tour: Stunning Ship Dining Experience at NCL Aqua Deck 6! #shorts",
        "description": "Step inside the Commodore Room! From check-in to dining, experience the ship's decor. Prepare to be amazed by the many restaurants and beautiful design details throughout. 'I love the decor!' #NCLAqua"
      },
      {
        "videoId": "cXYpodazbSE",
        "provider": "youtube",
        "title": "Explore Hasuki on Deck 6 | NCL Aqua’s Japanese Steakhouse Tour",
        "description": "Explore a luxury Japanese steakhouse at sea! We enjoyed the teppanyaki and whiskey bar, offering a unique cruise experience. Discover the ambiance and what to expect, from reservations to dining. #NCL"
      },
      {
        "videoId": "94uCS6YwWuw",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 8: Indulge Food Hall",
        "description": "Join us as we dive into the Indulge Food Hall, featuring a variety of unique eateries and cozy seating areas. Discover delicious noodles and more, and make sure not to miss any hidden gems in this foo"
      },
      {
        "videoId": "CsIKKuyiZCM",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 6: Commodore Room",
        "description": "Join us as we explore the stunning décor and cohesive design of our cruise ship's restaurants. With a variety of dining choices, we highlight how each area blends beautifully to create a unique culina"
      },
      {
        "videoId": "UBJqfMmFsGQ",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 6: Hasuki",
        "description": "Join us as we explore Hasuki, one of the biggest Japanese steakhouses on the water! With 18 tables and a vibrant dining experience, we share our amazing culinary adventure from last night. Don't miss "
      },
      {
        "videoId": "A_cQNUxHcPE",
        "provider": "youtube",
        "title": "First Look! NCL Aqua Public Deck 7: The Metropolitan Bar",
        "description": "Join us as we explore a delightful bistro atmosphere aboard the cruise ship, featuring live music and sing-alongs. Discover the vibrant scene of our recent night out and the fun at the Metropolitan lo"
      },
      {
        "videoId": "ziIG_VO6dCI",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Public Deck 7: Le Bistro",
        "description": "Join us as we explore the inviting atmosphere of Le Bistro, featuring exquisite wine cabinets and cozy booth seating. Don't miss our Facebook group Tall Man Clan for exclusive menus and more foodie up"
      },
      {
        "videoId": "uuIZHfWSvmM",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Public Deck 8: Los Lobos",
        "description": "Join us as we explore Deck 8 of the NCL Aqua, featuring the incredible Ocean Boulevard and various dining options, including the vibrant Los Lobos. Discover what makes this cruise experience unique an"
      },
      {
        "videoId": "cv-putKKgY0",
        "provider": "youtube",
        "title": "NCL Aqua First Look! Public Deck 8: Photo Gallery",
        "description": "Discover an incredible selection of cameras, GoPros, and binoculars alongside our stunning art gallery. We invite you to immerse yourself in a world of creativity and inspiration, with accessible dini"
      },
      {
        "videoId": "sfh3F1zGBA0",
        "provider": "youtube",
        "title": "NCL Aqua Public Deck 8: Local Bar and Grillers First Look!",
        "description": "Join us as we explore a fantastic dining spot open nearly 24 hours! Enjoy a smooth transition from late-night snacks to breakfast delights starting at 5 AM. Experience the comfort of being seated for "
      },
      {
        "videoId": "hP4FVPnwP6E",
        "provider": "youtube",
        "title": "NCL Aqua: Deck 6 Tour - Whiskey Bar & More!",
        "description": "We take you on a 360-degree tour of Deck 6 on the NCL Aqua. Explore the public deck, including the forward elevators, restrooms, Whiskey Bar, and Khasuki Japanese restaurant. #NCLAqua #CruiseTour #Dec"
      }
    ]
  }
}