{
  "ship": "Norwegian Escape",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "36nrm9RE0lg",
        "provider": "youtube",
        "title": "Norwegian Escape | Aft-Facing Balcony Stateroom B1 Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours an Aft-Facing Balcony Stateroom aboard the Norwegian Escape. As you already know, this is Danny's favorite location on the ship. You can enjoy those wake views as you sail throu"
      },
      {
        "videoId": "73Ri-dxnJ64",
        "provider": "youtube",
        "title": "Norwegian Escape | Aft-Facing Club Balcony Suite M1 Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours an Aft-Facing Club Balcony Suite aboard the Norwegian Escape. The M1 Club Balcony suite exists only at the aft of the ship, and as an accessible option. With many accessible fea"
      },
      {
        "videoId": "_fg5wV_R7Qo",
        "provider": "youtube",
        "title": "Norwegian Escape | Balcony Stateroom Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours a Balcony Stateroom aboard the Norwegian Escape. Featuring much more space inside the stateroom than an oceanview, and on the balcony, this is the perfect way to enjoy the world"
      },
      {
        "videoId": "hi7udEjthbU",
        "provider": "youtube",
        "title": "Norwegian Escape | Club Balcony Suite Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours a Club Balcony Suite aboard the Norwegian Escape. Featuring much more space inside the suite, on the balcony, as well as additional amenities to take your NCL cruise to the next"
      },
      {
        "videoId": "-Da65h0EEbo",
        "provider": "youtube",
        "title": "Norwegian Escape | Club Balcony Suite with Larger Balcony M6 Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours a Club Balcony Suite with Larger Balcony aboard the Norwegian Escape. These secret options are tucked right in front of Danny's favorite spots on the ship, and they feature HUGE"
      },
      {
        "videoId": "jKk7AvH2L9E",
        "provider": "youtube",
        "title": "Norwegian Escape | Family Oceanview Stateroom Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours a Family Oceanview Stateroom aboard the Norwegian Escape. These are excellent choices for many families. The layouts can vary a bit, but the separation of space, and that tub in"
      },
      {
        "videoId": "J4UmjpkmNM8",
        "provider": "youtube",
        "title": "Norwegian Escape | Inside Stateroom Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours an Inside Stateroom aboard the Norwegian Escape. These are the entry level staterooms here on the Escape, and feature a decent amount of space. So if cost is the only factor, th"
      },
      {
        "videoId": "N5nvtpAcfa0",
        "provider": "youtube",
        "title": "Norwegian Escape | Large Balcony Stateroom B6 Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours a Large Balcony Stateroom aboard the Norwegian Escape. These secret options are tucked right in front of Danny's favorite spots on the ship, and they feature HUGE balconies to e"
      },
      {
        "videoId": "lTPq_3H9a8I",
        "provider": "youtube",
        "title": "Norwegian Escape | Oceanview Stateroom with Picture Window Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours an Oceanview Stateroom with Picture Window aboard the Norwegian Escape. These are some the entry level staterooms here on the Escape, but they are upgraded from the Inside State"
      },
      {
        "videoId": "0XjrP0WXNlU",
        "provider": "youtube",
        "title": "Norwegian Escape | Studio Interior Full Tour & Review 4K | NCL Cruises",
        "description": "Join Danny as he tours a Studio Stateroom aboard the Norwegian Escape. NCL is the leader in solo cruising, and the studio complex takes that to the next level. Your private keycard entry are features "
      }
    ]
  }
}