{
  "ship": "Norwegian Jewel",
  "ship_class": "",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "67lkpTHtAYg",
        "provider": "youtube",
        "title": "NCL Jewel | Full Ship Walkthrough Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny and Taylor as they tour through the Norwegian Jewel. This remarkable ship has been renovated to perfection in order to give fellow cruisers their wants and needs. With amazing Dining option"
      }
    ],
    "suite": [
      {
        "videoId": "ZQu-JeOQqN4",
        "provider": "youtube",
        "title": "NCL Jewel | 2-Bedroom Deluxe Family Suite with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a 2-Bedroom Deluxe Family Suite with Balcony aboard the beautiful Norwegian Jewel. With the large amount of space in this beautiful family suite; this suits any needs for a fami"
      },
      {
        "videoId": "L0DbzJUYerY",
        "provider": "youtube",
        "title": "NCL Jewel | Haven Deluxe Owner's Suite with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Deluxe Owner's Suite with Balcony aboard the beautiful Norwegian Jewel. Located in the haven this suite will provide all the accommodations you will need. With the breat"
      }
    ],
    "balcony": [
      {
        "videoId": "b19GUtHob7U",
        "provider": "youtube",
        "title": "NCL Jewel | Aft-Facing Penthouse with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours an Aft-Facing Penthouse with Large Balcony aboard the beautiful Norwegian Jewel. With enough room for the entire family sleeping up to 4 guests, these spacious suites offer amaz"
      },
      {
        "videoId": "aDo2e1BfymM",
        "provider": "youtube",
        "title": "NCL Jewel | Forward Deluxe Penthouse with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Forward-Facing Deluxe Penthouse with Large Balcony aboard the beautiful Norwegian Jewel. Freshly renovated, these forward facing suites have a unique layout with plenty of roo"
      },
      {
        "videoId": "ePNymzk0nyw",
        "provider": "youtube",
        "title": "NCL Jewel | Forward Penthouse with Large Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Forward-Facing Penthouse with Large Balcony aboard the beautiful Norwegian Jewel. With enough room for the entire family sleeping up to 4 guests, these spacious suites offer a"
      },
      {
        "videoId": "tXqVobPIg7U",
        "provider": "youtube",
        "title": "NCL Jewel | Haven 2-Bedroom Family Villa with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven 2-Bedroom Family Villa with Balcony aboard the beautiful Norwegian Jewel. With enough room for the entire family, these spacious suites offer amazing views and have lots"
      },
      {
        "videoId": "u8aOE4HqJc0",
        "provider": "youtube",
        "title": "NCL Jewel | Haven Courtyard Penthouse with Balcony Tour & Review 4K | Norwegian Cruise Lines",
        "description": "Join Danny as he tours a Haven Courtyard Penthouse with Balcony aboard the beautiful Norwegian Jewel. These Penthouses are located in The Haven and include a king-size bed and single sofa-bed, plus a "
      }
    ]
  }
}