{
  "title": "File:Brüggen Glacier, Chile (1996).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Br%C3%BCggen_Glacier%2C_Chile_%281996%29.jpg/1280px-Br%C3%BCggen_Glacier%2C_Chile_%281996%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/e/eb/Br%C3%BCggen_Glacier%2C_Chile_%281996%29.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "Image ISS003-E-6061 was provided by the Earth Sciences and Image Analysis Laboratory at Johnson Space Center. Additional images taken by astronauts and cosmonauts can be viewed at the NASA-JSC Gateway to Astronaut Photography of Earth.",
  "description": "The Expedition 3 crew of the International Space Station caught a rare glimpse of the massive ice fields and glaciers of Patagonia early in the afternoon on September 25, 2001. This part of the South American coast sees frequent storms and is often obscured from view by cloud cover.\n<p>Brüggen Glacier in southern Chile is the largest western outflow from the Southern Patagonian Ice Field and, unlike most glaciers worldwide, advanced significantly since 1945. From 1945 to 1976, Brüggen surged 5 km across the Eyre Fjord, reaching the western shore by 1962 and cutting off Lake Greve from the sea. The glacier continued advancing both northward and southward in the fjord to near its present position before stabilizing. The growth covers a distance of more than 10 km north to south, adding nearly 60 square km of ice.\n</p><p>Additional information on this and other Patagonian glaciers may be found from the United State Geological Survey from their information on “Historic Fluctuations of Outlet Glaciers from the Patagonian Ice Fields.”\n</p>\nImage ISS003-E-6061 was provided by the Earth Sciences and Image Analysis Laboratory at Johnson Space Center. Additional images taken by astronauts and cosmonauts can be viewed at the NASA-JSC Gateway to Astronaut Photography of Earth.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3ABr%C3%BCggen%20Glacier%2C%20Chile%20%281996%29.jpg"
}