{
  "title": "File:Chilean Coastline (MODIS 2016-01-18).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Chilean_Coastline_%28MODIS_2016-01-18%29.jpg/1280px-Chilean_Coastline_%28MODIS_2016-01-18%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/b/b0/Chilean_Coastline_%28MODIS_2016-01-18%29.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "Jeff Schmaltz, MODIS Land Rapid Response Team, NASA GSFC",
  "description": "The Los Lagos region of Chile has been advertised as \"the Southern Hemisphere's Switzerland\", based on the combination of snow-capped peaks, deep mountain lakes and green valleys. It has also been likened to the rugged scenery of New Zealand, with formidable mountains and craggy fjords. With such poetic advertising, it is no wonder that ecotourism and rural tourism are major industries in the region, along with skiing and recreational fishing. Indeed, national parks in Los Lagos (along with those in the Los Rios region) are visited by approximately 43% of Chile's tourists each year.\n<p>The Moderate Resolution Imaging Spectroradiometer (MODIS) aboard NASA's Terra satellite flew over Chile's coastline and captured this beautiful true-color image, which centers of the Los Lagos region, on January 7, 2016.\n</p><p>Even in summer, snow caps the tops of the Andes Mountains which run parallel to the coast. The green forests seen in this image represent the Valdivian rain forest, which is South America's only temperate rain forest. This richly biodiverse forest originally covered 35 million acres in Chile and Argentina, but only about 40% of that original forest remains today.\n</p><p>Just offshore lies the fifth largest island of South America - the Isla Grande de Chilo. It is a windswept island which is notable for a large number of architecturally and culturally distinct churches. Sixteen of these churches are included in a UNESCO World Heritage because of their unique wooden architectural style and connection to the spiritual culture and the history of the region.\n</p>\nBetween the Grande de Chilo and mainland Chile lies the Gulf of Corcovado, an extremely rich and biodiverse marine ecosystem that is home to at least 31 marine species including Peale's and Chilean Dolphin, South American Sea Lions and Marine Otters. It also is home to a myriad of birds, including penguins, parakeets and tapaculos. Perhaps more importantly, the Gulf is a key environment for the Blue Whale, use these protected waters to raise their young.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AChilean%20Coastline%20%28MODIS%202016-01-18%29.jpg"
}