{
  "ship": "Majestic Princess",
  "ship_class": "",
  "cruise_line": "Princess Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "FdUHuY6QjCk",
        "provider": "youtube",
        "title": "Majestic Princess | Full Walkthrough Ship Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny as he tours the Majestic Princess! Princess Cruises has taken it to the next level with the Medallion Net. The Majestic Princess offers unique dining options as well as all of your Princess"
      },
      {
        "videoId": "rD6CUYYCAD4",
        "provider": "youtube",
        "title": "Mini-Suite | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Mini-Suite aboard the Majestic Princess. These fantastic room options feature much more room to spread out, as well as a larger outdoor veranda to enjoy the "
      },
      {
        "videoId": "9pcTMD117so",
        "provider": "youtube",
        "title": "Owner's Suite S2 | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of an Owner's Suite aboard the Majestic Princess. These are the top suites on the ship and Danny's favorite because of their aft location. The Medallion Net has t"
      },
      {
        "videoId": "Rjv3IUPq8Zs",
        "provider": "youtube",
        "title": "Penthouse Suite S3 | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Penthouse Suite aboard the Majestic Princess. These suites feature a large amount of space indoor, and outdoors on your corner suite location. Combining the "
      },
      {
        "videoId": "QGtLmWKlBlg",
        "provider": "youtube",
        "title": "Penthouse Suite S4 | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Penthouse Suite aboard the Majestic Princess. If you are looking for an upgraded Suite experience and a much larger area to spread out, this is the suite for"
      },
      {
        "videoId": "B2seoGwgABU",
        "provider": "youtube",
        "title": "Premium Suite S5 | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Premium Suite aboard the Majestic Princess. These forward-facing suites have amazing views out the front of the ship, as well as a private side facing balcon"
      },
      {
        "videoId": "vJt4avL-r50",
        "provider": "youtube",
        "title": "Reserve Mini-Suite | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Reserve Mini Suite aboard the Majestic Princess. These premium options feature the same layout as a standard Mini-Suite but offer a ton of added benefits to "
      },
      {
        "videoId": "eeK5_PfdCmY",
        "provider": "youtube",
        "title": "Balcony Stateroom (Obstructed) | Majestic Princess Room Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Balcony Stateroom (Obstructed) aboard the Majestic Princess. The layout is identical to a standard Balcony Stateroom however there will be a visual obstructi"
      },
      {
        "videoId": "FsE81eJ_Gqc",
        "provider": "youtube",
        "title": "Balcony Stateroom | Majestic Princess Room Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Balcony Stateroom aboard the Majestic Princess. Sailing through Alaska, and other scenic areas a balcony is the perfect way to have your own private getaway."
      },
      {
        "videoId": "B2QGoNDv0kI",
        "provider": "youtube",
        "title": "Deluxe Balcony Stateroom (Obstructed) | Majestic Princess Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Deluxe Balcony Stateroom (Obstructed) aboard the Majestic Princess. The layout is identical to a standard Deluxe Balcony Stateroom however there will be a vi"
      },
      {
        "videoId": "rSBHV1iERbA",
        "provider": "youtube",
        "title": "Deluxe Balcony Stateroom | Majestic Princess Room Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Deluxe Balcony Stateroom aboard the Majestic Princess. With a sitting area, and your private outdoor balcony these staterooms are perfect to take in the worl"
      },
      {
        "videoId": "cFk9E7dwucw",
        "provider": "youtube",
        "title": "Premium Deluxe Balcony Stateroom | Majestic Princess Room Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of a Premium Deluxe Balcony Stateroom aboard the Majestic Princess. These balcony staterooms feature a larger area to spread out, and a larger balcony outside as "
      },
      {
        "videoId": "VlyhTFK_fNA",
        "provider": "youtube",
        "title": "Interior Stateroom | Majestic Princess Stateroom Tour & Review 4K | Princess Cruises 2021",
        "description": "Join Danny on a full walkthrough tour of an Interior Stateroom aboard the Majestic Princess. For an inside cabin, these have a surprising amount of space, storage, and usable space. There are many oth"
      }
    ]
  }
}