{
  "ship": "Sapphire Princess",
  "ship_class": "",
  "cruise_line": "Princess Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "vPDSDrZGuCI",
        "provider": "youtube",
        "title": "Sapphire Princess | Aft Penthouse Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours an Aft Penthouse Suite on the beautiful Sapphire Princess. This is a full suite onboard, meaning you get priority embarkation and disembarkation privileges, as well as access to"
      },
      {
        "videoId": "KB5aK18cLdQ",
        "provider": "youtube",
        "title": "Sapphire Princess | Balcony Stateroom Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Balcony Stateroom on the beautiful Sapphire Princess. These beautiful staterooms are one of the most popular options onboard; where affordability meets comfort! Step out onto "
      },
      {
        "videoId": "qUADatiVy50",
        "provider": "youtube",
        "title": "Sapphire Princess | Family Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Family Suite on the beautiful Sapphire Princess. Here you have space to spread out, sleeping arrangements for the whole family, as well as suite perks such as priority embarka"
      },
      {
        "videoId": "f22rxC8jni0",
        "provider": "youtube",
        "title": "Sapphire Princess | Full Walkthrough Ship Tour & Review 4K | Princess Cruises 2023",
        "description": "Join Danny on a full walkthrough tour of the beautiful Sapphire Princess. As you set your sights on the wonders of the world, let Sapphire Princess indulge your every whim. Over 700 balconies, world-c"
      },
      {
        "videoId": "VXQx9w1FChs",
        "provider": "youtube",
        "title": "Sapphire Princess | Grand Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours an Owner's Suite on the beautiful Sapphire Princess. Staying in this suite means you will get all the medallion and suite level amenities including early embarkation and disemba"
      },
      {
        "videoId": "kFc-0EZsvvE",
        "provider": "youtube",
        "title": "Sapphire Princess | Interior Stateroom Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours an Interior Stateroom on the beautiful Sapphire Princess. These beautiful staterooms are the most affordable options on the ship, allowing you to have your dream cruise vacation"
      },
      {
        "videoId": "F_wKlXoWbHs",
        "provider": "youtube",
        "title": "Sapphire Princess | Mini Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Mini Suite on the beautiful Sapphire Princess. This beautiful room boasts a fantastic layout, with a divide of the bedroom and living area portions, so it almost feels like tw"
      },
      {
        "videoId": "pFnc1TnV87s",
        "provider": "youtube",
        "title": "Sapphire Princess | Oceanview Stateroom Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours an Oceanview Stateroom on the beautiful Sapphire Princess. These are popular options onboard princess because they combine affordability and the perk of getting an outside view "
      },
      {
        "videoId": "IX95teRRpGk",
        "provider": "youtube",
        "title": "Sapphire Princess | Owner's Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours an Owner's Suite on the beautiful Sapphire Princess. Staying in this suite means you will get all the medallion and suite level amenities! Reach out when you are ready to book y"
      },
      {
        "videoId": "p70SY_slKts",
        "provider": "youtube",
        "title": "Sapphire Princess | Penthouse Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Penthouse Suite on the beautiful Sapphire Princess. This is a full suite onboard, meaning you get priority embarkation and disembarkation privileges, as well as access to the "
      },
      {
        "videoId": "tdccmsJBtJk",
        "provider": "youtube",
        "title": "Sapphire Princess | Premium Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Premium Suite on the beautiful Sapphire Princess. This is a full suite onboard, meaning you get priority embarkation and disembarkation privileges, as well as priority special"
      },
      {
        "videoId": "HjP9TiSFnr4",
        "provider": "youtube",
        "title": "Sapphire Princess | Reserve Mini Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Reserve Mini Suite on the beautiful Sapphire Princess. A Reserve means you will get all those medallion amenities, and upgraded amenities as well, including access to the Rese"
      },
      {
        "videoId": "_5Ps8jP85bg",
        "provider": "youtube",
        "title": "Sapphire Princess | Vista Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Vista Suite on the beautiful Sapphire Princess. When you book this suite you are given a few suite perks including priority embarkation and disembarkation privileges, as well "
      },
      {
        "videoId": "_joOPEqzUG4",
        "provider": "youtube",
        "title": "Wild Canyon Cabo San Lucas - Sapphire Princess Excursion REVIEW!",
        "description": "Hey Cruisers, In this Sapphire Princess vlog, we're in Cabo San Lucas Mexico on our Mexican Riviera Cruise, and it's time to get dirty. We will venture off the lovely Sapphire Princess for a wild excu"
      }
    ]
  }
}