{
  "title": "File:1794 Samuel Dunn Wall Map of the World in Hemispheres - Geographicus - World2-dunn-1794.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/1794_Samuel_Dunn_Wall_Map_of_the_World_in_Hemispheres_-_Geographicus_-_World2-dunn-1794.jpg/1280px-1794_Samuel_Dunn_Wall_Map_of_the_World_in_Hemispheres_-_Geographicus_-_World2-dunn-1794.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/f/ff/1794_Samuel_Dunn_Wall_Map_of_the_World_in_Hemispheres_-_Geographicus_-_World2-dunn-1794.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "<div class=\"fn value\">\n<a href=\"https://en.wikipedia.org/wiki/Thomas_Kitchin\" class=\"extiw\" title=\"w:Thomas Kitchin\">Thomas Kitchin</a></div>",
  "description": "An absolutely stunning and monumental double hemisphere wall map of the world by Samuel Dunn dating to 1794.  This extraordinary map is so large and so rich in detail that it is exceptionally challenging to do it full justice in either photographic or textual descriptions.  Covers the entire world in a double hemisphere projection. The primary  map is surrounded on all sides but detailed scientific calculations and descriptions as well as northern and southern hemisphere star charts, a map of the Moon, a Latitude and Longitude Analemma chart, a map of the Solar System, a Mercator projection of the world, an Analemma projection, a seasonal  chart, a universal scale chart, and numerous smaller diagrams depicting planets and mathematical  systems. All text is in English.  We will start our survey of this map in North America, much of which was, even in 1794, largely unknown.  This  map follows shortly after the explorations of Captain Cook in the Arctic and Pacific Northwest, so the general outline of the continent is known. However, when this map was made, few inland expeditions had extended westward beyond the Mississippi.  This map notes two separate speculative courses for the apocryphal River of the West, a northern route extending from Lake Winnipeg and a southern route passing south of Winnepeg through Pike's lake.  The River of the West was hopeful dream of French and English explorers who were searching for a water passage through North America to the Pacific.  In concept, should such a route be found, it would have become an important trade artery allowing the British and French, who's colonies dominated the eastern parts of North America, to compete with the Spanish for control of the lucrative Asia-Pacific trade.  Little did these earlier speculative cartographers realize the bulk of the Rocky Mountains stood between them and their dreams!  Slightly south of the Rivers of the West, we find the kingdom of Quivira, which is one of the lands associated with Spanish legends of the Seven Cities of Gold.  In this area we can also find Drake's Harbor or Port de la Bodega and Albion.  Drake's Harbor is where Sir Francis Drake supposedly landed during his circumnavigation of  the globe in 1580.  Drake wintered in this harbor and used the abundant resources of the region to repair his ships.  He also claimed the lands for England dubbing them New Albion.  Although the true location of Drake's port is unknown, most place it much further to the north.  By situating it and consequently New Albion further to the south, Dunn is advocating a British rather than Spanish claim to this region.   On the Eastern coast of North America we find a fledgling United States extending from Georgia to Maine.   Dunn names Boston, New York, Charleston, Long Island, and Philadelphia, as well as the important smaller towns of Jamestown, Williamsburg and Edonton.   South America exhibits a typically accurate coastline and limited knowledge of the interior beyond Peru and the populated coastlands.  A few islands are noted off the coast, including the Galapagos, which are referred to as the Inchanted Islands. The Amazon is vague with many of its tributaries drawn in speculatively.  Dunn and d'Anville have done away with the popular representation of Manoa or El Dorado in Guyana, but a vestigial Lake Parima is evident.  Further south, the Laguna de los Xarayes, another apocryphal destination, is drawn at the northernmost terminus of the Paraguay River. The Xaraiés, meaning Masters of the River were an indigenous people occupying what are today parts of Brazil's Matte Grosso and the Pantanal. When Spanish and Portuguese explorers first navigated up the Paraguay River, as always in search of El Dorado, they encountered the vast Pantanal flood plain at the height of its annual inundation. Understandably misinterpreting the flood plain as a gigantic inland sea, they named it after the local inhabitants, the Xaraies.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3A1794%20Samuel%20Dunn%20Wall%20Map%20of%20the%20World%20in%20Hemispheres%20-%20Geographicus%20-%20World2-dunn-1794.jpg"
}