{
  "title": "File:1744 Bowen Map of the World in Hemispheres - Geographicus - World-bowen-1744.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fd/1744_Bowen_Map_of_the_World_in_Hemispheres_-_Geographicus_-_World-bowen-1744.jpg/1280px-1744_Bowen_Map_of_the_World_in_Hemispheres_-_Geographicus_-_World-bowen-1744.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/f/fd/1744_Bowen_Map_of_the_World_in_Hemispheres_-_Geographicus_-_World-bowen-1744.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "<div class=\"fn value\">\n<a rel=\"nofollow\" class=\"external free\" href=\"http://www.geographicus.com/mm5/cartographers/bowen.txt\">http://www.geographicus.com/mm5/cartographers/bowen.txt</a></div>",
  "description": "An extremely attractive 1744 decorative double hemisphere world map by the English cartographer Emmanuel Bowen.  This beautiful map covers the entire world as it was understood in the middle part of the 18th century, before the explorations of Cook, Wilkes, and others.  Surrounded by decorative engravings of women representing each of the continents: America in the upper left, Europe in the upper right, Asia in the lower left, and Africa in the lower right.  The decorative baroque title cartouche appears at top center.  Color coding according to continent.  Limited inland detail, but major cities, geographical landmarks, and regions are noted.  In the tropics ocean currents are identified – a very unusual addition.  This map is most interesting for its treatment of the western coast of America, the Pacific, and most importantly, Australia.   Bowen issued this map during a dark period in Australian exploration, the seventy-some years between the navigations of William Dampier in 1699 and Tobias Furneaux in 1773. Consequently most of the cartographic information on this map dates to 17th century Dutch expeditions to Australia’s western coast, such as those of Abel Tasman and William Janszoon.  Consequently we see a very ephemeral speculative mapping of the continent with Van Diemens’s Land (Tasmania) and New Guinea attached to the mainland.  The unexplored eastern coast of the continent is mapped simply as a straight line running from New Guinea directly south to the tip of Tasmania.    New Zealand appears in a very embryonic form as a single landmass with no western shore.  This most likely conforms to Abel Tasman’s 1642 sighting of the western coast of South Island.   Another curious landmass appearing to the northeast of New Holland or Australia and to the west of New Zealand is labeled “H. Ghost Land’.  From its geographical situation it may represent New Caledonia though it was not officially discovered until Captain Cook landed there in 1774.    Just to the north of New Zealand yet another mysterious landmass appears, this one is called “Tierra de Espirio Sancto”, a speculative enlargement and mismapping of the New Hebrides Islands as discovered by the Spanish explorer and religious zealot Pedro Fernandez di Quir, or Quiros.  Quiros, believing he had discovered the great southern continent of Terre Australis, mapped the islands much larger then they in fact were.  Another smaller group of islands several hundred miles further east is also labeled after Quiros.  Secretive, self-delusional, fanatical, and inept, Quiros made charts that bordered on fictional.  It took several hundred years and no less a navigator than James Cook to finally figure out exactly what Quiros actually discovered.  Though Siberia exhibits considerable detail consistent with Vitus Bering’s 1728 exploration of the region, the opposite side of the Strait, in America, is less clear.  Bowen identifies it as the “Supposed Strait of Anian” and “Parts Undiscovered”, leaving much of the northwestern parts of America blank. What he does do, however, is leave a number of inlets in what is today California that are highly suggestive of possible northwest passages.  He also labeled “Drakes’ Port”, the site where Sir Francis Drank supposedly landed, restocked, and repaired his vessels during his 1579 circumnavigation of the globe.  Today the true location of Drake’s Port is a much debated cartographic mystery.  What we know from Drake is that it is a safe harbor that lies to the north of the furthest Spanish Claim, Point Loma, along the coast that Drake named New Albion.  Some have associated Drake’s Harbor with San Francisco Bay, Bodega Bay, or San Pablo Bay, but since the relevant records were lost in the 1698 burning of London’s Whitehall Palace, we may never know.  Also of interest is Bowen’s mapping of “De Gama’s Land” just to the south of Siberia. The map shows, among other features, Negroland/Nigritia, Terra incognita, Terra Australis, New Holland, Strait of Anian, Company Land and Terra incognita.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3A1744%20Bowen%20Map%20of%20the%20World%20in%20Hemispheres%20-%20Geographicus%20-%20World-bowen-1744.jpg"
}