{
  "title": "File:Panama canal banner.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4a/Panama_canal_banner.jpg/1280px-Panama_canal_banner.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/4/4a/Panama_canal_banner.jpg",
  "license": "CC BY 2.0",
  "license_url": "https://creativecommons.org/licenses/by/2.0",
  "author": "<ul><li><a href=\"//commons.wikimedia.org/wiki/File:Panama_canal_panoramic_view_from_the_top_of_Ancon_hill.jpg\" title=\"File:Panama canal panoramic view from the top of Ancon hill.jpg\">Panama_canal_panoramic_view_from_the_top_of_Ancon_hill.jpg</a>: <a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/people/19731486@N07\">Brian Gratwicke</a></li>\n<li>derivative work: <a href=\"//commons.wikimedia.org/w/index.php?title=User:Jjtkk&amp;action=edit&amp;redlink=1\" class=\"new\" title=\"User:Jjtkk (page does not exist)\">Jjtkk</a></li></ul>",
  "description": "The other side of the hill - view of the canal and Bridge of the Americas connecting east to west and north to south! The Panama Canal is a ship canal which joins the Caribbean Sea to the Pacific ocean. One of the largest and most difficult engineering projects ever undertaken, it had an enormous impact on shipping between the two oceans, replacing the long and treacherous route via the Drake Passage and Cape Horn at the southernmost tip of South America. A ship sailing from New York to San Francisco via the canal travels 9,500 km (6,000 miles), well under half the 22,500 km (14,000 miles) route around Cape Horn.[1] Although the concept of a canal near Panama dates back to the early 16th century, the first attempt to construct a canal began in 1880 under French leadership. After this attempt failed and 21,900 workers died, the project of building a canal was attempted and completed by the United States in the early 1900s, with the canal opening in 1914. The building of the 77 km (48 mi) canal was plagued by problems, including disease (particularly malaria and yellow fever) and landslides. By the time the canal was completed, a total of 27,500 workmen are estimated to have died in the French and American efforts.  Since opening, the canal has been enormously successful, and continues to be a key conduit for international maritime trade. The canal can accommodate vessels from small private yachts up to large commercial vessels. The maximum size of vessel that can use the canal is known as Panamax; an increasing number of modern ships exceed this limit, and are known as post-Panamax or super-Panamax vessels. A typical passage through the canal by a cargo ship takes approximately 8–10 hours. In fiscal year 2008, 14,702 vessels passed through the waterway with a total 309.6 million Panama Canal/Universal Measurement System (PC/UMS) tons.  While the Pacific Ocean is west of the isthmus and the Atlantic to the east, the journey through the canal from the Pacific to the Atlantic is one from southeast to northwest. This is a result of the isthmus's \"curving back on itself\" in the region of the canal. The Bridge of the Americas at the Pacific end is about a third of a degree of longitude east of the end near Colon on the Atlantic.[2] An estimated 14,000 ships pass through the canal each year. Only 1,000 ships per year passed through the canal at its beginnings.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3APanama%20canal%20banner.jpg"
}