{
  "title": "File:Paraty - Rio de Janeiro (22443343596).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Paraty_-_Rio_de_Janeiro_%2822443343596%29.jpg/1280px-Paraty_-_Rio_de_Janeiro_%2822443343596%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/0/08/Paraty_-_Rio_de_Janeiro_%2822443343596%29.jpg",
  "license": "CC BY 2.0",
  "license_url": "https://creativecommons.org/licenses/by/2.0",
  "author": "<a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/people/45600179@N08\">Deni Williams</a> from São Paulo, Brasil",
  "description": "<p>Português\n</p><p>Paraty é um município brasileiro do estado do Rio de Janeiro. Localizado no litoral sul do estado, distante 258 quilômetros da capital, a cidade do Rio de Janeiro.\n</p><p>Em 1667, teve sua emancipação política decretada após várias revoltas populares contra o centralismo que Angra dos Reis exercia sobre a cidade, em especial após a revolta liderada por Domingos Gonçalves de Abreu, tornando-se assim independente.\n</p><p>Junto ao oceano, entre dois rios, Paraty está a uma altitude média de apenas cinco metros. Hoje, é o centro de um município com 930,7 km² com uma população de 39 965 habitantes (densidade demográfica: 35,6 h/km²).\n</p><p>A cidade foi, durante o período colonial brasileiro (1530-1815), sede do mais importante porto exportador de ouro do Brasil.\n</p><p>Por estar localizada quase ao nível do mar, a cidade foi projetada levando em conta o fluxo das marés. Como resultado, muitas de suas ruas são periodicamente inundadas pela maré.\n</p><p><br>\nO longo processo de estagnação vivido por Paraty ao longo do século XX manteve, paradoxalmente, o casario colonial, conservado no conjunto conhecido como Centro Histórico, tornando a cidade um dos destinos turísticos mais procurados do país.\n</p><p>Pelas ruas de pedra irregular, circulam, a pé – a entrada de veículos é proibida na maior parte do Centro Histórico -, turistas do mundo inteiro, atraídos pela beleza da arquitetura típica do Brasil Colônia. As casas históricas foram requalificadas como pousadas, restaurantes, lojas de artesanato e museus, em meio a apresentações de músicos populares e de estátuas vivas.\n</p><p>No entanto, Paraty é muito mais que apenas uma pequena cidade histórica. Costeada por montanhas cobertas do denso verde da mata atlântica, a cidade é rodeada de Parques e Reservas Ecológicas, fazendo da região uma das mais preservadas do Brasil. Há mais de 60 ilhas e 90 praias em Paraty, boa parte delas acessível somente de barco ou trilhas. As praias de Trindade são uma atração à parte: em fevereiro de 2009, o governo federal delimitou a Praia do Meio, em Trindade, como parte integrante do Parque Nacional da Serra da Bocaina.\n</p><p>Outro aspecto de relevo no setor é a prática de esportes de aventura. Nas trilhas de Paraty pode-se caminhar por dias a fio. O roteiro mais tradicional entre os amantes da caminhada é a Travessia da Juatinga, que costeia toda a Península da Juatinga, em trilhas de servidão que datam do tempo dos escravos e passam por diversas comunidades caiçaras, responsáveis pela hospedagem e alimentação dos turistas. Dentre outras modalidades pode-se praticar a canoagem oceânica, a vela, o surf e o mergulho autônomo. As águas calmas, cristalinas e sempre tépidas da Baía da Ilha Grande são ideais para essa prática, atraindo grande número de praticantes. Várias operadoras de mergulho oferecem seus serviços na cidade e nas marinas, atendendo não apenas às escolas de mergulho, mas também a turistas interessados em conhecer a Parati subaquática. A canoagem também é idealmente praticada nas águas calmas da baia, destacando os roteiros de mais de um dia que exploram a Baia da Cajaíba e o Saco do Mamanguá. Já o surf é praticado na costa aberta ao mar, que se inicia na ponta da Juatinga e engloba as praias da Sumaca, Martin de Sá, Antigos, Sono e todas da Vila de Trindade.\n</p><p>A rede hoteleira é formada de pequenas pousadas, muitas delas situadas no Centro Histórico.\n</p><p>Fonte: Wikipedia\n</p><p><br>\nEnglish:\n</p><p>Paraty (or Parati, Portuguese pronunciation: [pɐɾɐˈtʃi]) is a preserved Portuguese colonial (1500–1822) and Brazilian Imperial (1822–1889) municipality with a population of about 36,000. It is located on the Costa Verde (Green Coast), a lush, green corridor that runs along the coastline of the state of Rio de Janeiro, in Brazil. Paraty has become a popular tourist destination in recent years, renowned for the historic town and the coast and mountains in the region.\n</p><p>The town is located on the Bay of Ilha Grande, which is dotted with many tropical islands. Rising up as high as 1,300 meters behind the town are tropical forests, mountains, and waterfalls. It is the southernmost and westernmost city in Rio de Janeiro state.\n</p><p>Paraty is surrounded by many parks and nature reserves, including Serra da Bocaina National Park, Serra do Mar State Park (of São Paulo), the Park Reserve of Joatinga and the Cairuçu Environmental Protection Area, where the village of Trindade is located. The municipality also includes an indigenous village and an Afro-Brazilian quilombo.\n</p><p>The village of Paraty was founded in 1597. It was established formally as a town by Portuguese colonizers in 1667, in a region populated by the Guaianás Indians.\n</p><p>The Guaianás people who lived where the city now stands called the entire area “Paraty”. In the Tupi language “Paraty” means “river of fish”. Even today the Brazilian Mullet (Mugil brasiliensis) still come back to spawn in the rivers that spill into the Bay of Paraty. When the region was colonized by the Portuguese, they adopted the Guaianás name for their new town.\n</p><p>After the discovery of the world's richest gold mines in 1696 in the mountains of Minas Gerais, Paraty became an export port for gold to Rio de Janeiro and from there on to Portugal. The ensuing gold rush led to the construction of the \"Caminho do Ouro\" or \"Gold Trail\", a 1200 kilometer road, paved in steep areas with large stones, which connected Paraty to Diamantina via Ouro Preto and Tiradentes. Not only was it used to transport gold to Paraty, but it was also used to convey supplies, miners and African slaves by mule train over the mountains to and from the gold mining areas. Two substantial sections of the Caminho do Ouro have been excavated near Paraty and are now a popular tourist destination for hiking.\n</p><p>The Gold Trail fell into disuse because of attacks on the gold laden ships bound for Rio de Janeiro by pirates who frequented the islands and coves of the Bay of Angra dos Reis. Eventually a safer overland route from Minas Gerais to Rio de Janeiro was created because of these pirate raids. Finally, the gold itself began to run out in the late 18th century, and Paraty declined.\n</p><p>The Gold Trail was submitted for inclusion on the World Heritage List in August 2004.\n</p><p>The city's economic activity revived as a port for a new boom, the coffee trade of the Paraiba do Sul River Valley in the early 19th century, until a railway along the valley created cheaper transport to the port of Rio de Janeiro. Another smaller revival came late in the 19th century with the production of cachaça, which is a sugarcane-derived spirit best known today as the basis for Brazil's most famous drink, the caipirinha. The name \"Paraty\" in that period became synonymous with cachaça. Since then, Paraty has been out of the mainstream, which is why it did not change for centuries, until a paved road was built from Rio de Janeiro to Santos, near São Paulo, in the 1970s. The city then began a new cycle of activity, which transformed a small, almost abandoned town living on very limited economic activity, mainly fishing and agriculture (bananas, manioc, sugarcane) into a tourism destination.\n</p>\nSource: Wikipedia",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AParaty%20-%20Rio%20de%20Janeiro%20%2822443343596%29.jpg"
}