{
  "ship": "Nieuw Statendam",
  "ship_class": "",
  "cruise_line": "Holland America Line",
  "last_updated": "2026-01-03",
  "videos": {
    "food": [
      {
        "videoId": "i8QS-Mvur2s",
        "provider": "youtube",
        "title": "Nieuw Statendam Christmas Cruise VLOG #4 - GRAND TURK, Christmas movie, Specialty Dining",
        "description": "We vlog the third day of our 7-day Christmas Cruise onboard the Nieuw Statendam. We are one of the first few ships to dock in Grand Turk in almost 2 years. Learn about how good (or bad) the snorkellin"
      }
    ],
    "ship walk through": [
      {
        "videoId": "Xe0ZoOewj78",
        "provider": "youtube",
        "title": "Nieuw Statendam Christmas Cruise VLOG #5 - SAN JUAN, Pool Time, and Old San Juan in the Evening",
        "description": "We vlog the fourth day of our 7-day Christmas Cruise onboard the Nieuw Statendam. We arrive in Old San Juan and spend some time first on the quiet ship, before exploring Old San Juan in the evening. ▬"
      },
      {
        "videoId": "125gceGJHxQ",
        "provider": "youtube",
        "title": "Embarkation Day for Our Group Cruise | HAL Nieuw Statendam",
        "description": "It's Cruise Day, and it's time four our 2nd Group Cruise - this time on Holland America's Nieuw Statendam with 64 guests! Join us for our 7 day adventure into the Caribbean. ▬ Contents of this video ▬"
      },
      {
        "videoId": "rDT9jxIJGYA",
        "provider": "youtube",
        "title": "Holland America Cruise Vlog | Day 3 a SEA DAY | Nieuw Statendam | Gala Night",
        "description": "We vlog the third day of our 7-day New Years Cruise onboard the Nieuw Statendam. Today is a SEA DAY - Cabana Time, EXC talk about Caribbean Sports, Gala Night with Main Dining Room, World Stage show a"
      },
      {
        "videoId": "sUWeNcr1v38",
        "provider": "youtube",
        "title": "Holland America Cruise Vlog | Half Moon Cay | Nieuw Statendam | Day 2",
        "description": "We vlog the second day of our 7-day New Years Cruise onboard the Nieuw Statendam. We head ashore after breakfast in bed to have a wonderful time snorkelling and exploring Holland America's private isl"
      },
      {
        "videoId": "2OMsGRPkZWs",
        "provider": "youtube",
        "title": "Holland America Cruise Vlog | New Years Cruise 2022 | Nieuw Statendam | Day 1",
        "description": "We vlog the first day of our 7-day New Years Cruise onboard the Nieuw Statendam. We leave Port Everglades with news about a surge in COVID cases and we do all we can to cruise safely while still havin"
      },
      {
        "videoId": "5iGb1Dix6jg",
        "provider": "youtube",
        "title": "Holland America Cruise Vlog | OCHO RIOS JAMAICA | Day 4 | Nieuw Statendam",
        "description": "We vlog the fourth day of our 7-day New Years Cruise onboard the Nieuw Statendam. Today we are in Ocho Rios, Jamaica. There are tight COVID regulations in place - so we hit the port area to see what's"
      },
      {
        "videoId": "bKGTIZUBfy8",
        "provider": "youtube",
        "title": "Holland America Cruise Vlog | SEA DAY | Day 5 | Nieuw Statendam",
        "description": "We vlog the fifth day of our 7-day New Years Cruise onboard the Nieuw Statendam. Today we have our second Sea Day of the cruise and find some areas of the ship we missed so far. We have lunch and dinn"
      },
      {
        "videoId": "5oRoq2dPscU",
        "provider": "youtube",
        "title": "Nieuw Statendam Christmas Cruise #6 - SAINT THOMAS, Dive-In, Veggie Menu, BBC Earth2, COVID test",
        "description": "We vlog the fifth day of our 7-day Christmas Cruise onboard the Nieuw Statendam. We arrive in SaintThomas and check out the local shopping before returning to the ship for some Dive-In food, Seaview P"
      },
      {
        "videoId": "ALdAC05CRXQ",
        "provider": "youtube",
        "title": "Nieuw Statendam Christmas Cruise #7 - COVID test for back-to-back, SEA DAY, & Gala Night",
        "description": "We vlog the sixth day (Christmas Eve!) of our 7-day Christmas Cruise onboard the Nieuw Statendam. We are on a sea day but need to do our covid test on board to qualify for doing a back-to-back cruise "
      },
      {
        "videoId": "HX0AnuP_fKg",
        "provider": "youtube",
        "title": "Nieuw Statendam Christmas Cruise #8 - HALF MOON CAY, Christmas Day",
        "description": "We vlog the first half of the seventh day (Christmas Day!) of our 7-day Christmas Cruise onboard the Nieuw Statendam. We head to Holland America's private island, Half Moon Cay, to do some snorkelling"
      }
    ]
  }
}