{
  "title": "File:20191201 Trinidad and Tobago 0006 Port of Spain sRGB (49294851868).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7a/20191201_Trinidad_and_Tobago_0006_Port_of_Spain_sRGB_%2849294851868%29.jpg/1280px-20191201_Trinidad_and_Tobago_0006_Port_of_Spain_sRGB_%2849294851868%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/7/7a/20191201_Trinidad_and_Tobago_0006_Port_of_Spain_sRGB_%2849294851868%29.jpg",
  "license": "CC BY-SA 2.0",
  "license_url": "https://creativecommons.org/licenses/by-sa/2.0",
  "author": "<a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/people/9508280@N07\">Dan Lundberg</a>",
  "description": "<p>The lighthouse once stood up straight and once stood at the water’s edge.  Landfill has moved the shoreline a ways off to the left.\n</p><p>Port of Spain is the capital of Trinidad and Tobago.  The natural harbor led Spanish settlers to establish a port, first “Puerto de los Españoles” and then later “Puerto de España.”  A Spanish garrison was posted here in 1560.  An area of tidal mudflats, expansion required reclaiming land, including diverting the St. Ann’s River in 1787.  In 1797 the British landed at what is still called Invaders Bay to the west and marched to Port of Spain which capitulated, becoming the capital of the new British colonial government.  A devastating fire in 1808 led Governor Sir Ralph Woodford (served 1813 to 1828) to enact various civic improvements.\n</p><p>Trinidad and Tobago, the southernmost island country in the Caribbean, comprises the large island of Trinidad and the little island of Tobago.  Trinidad was visited by Columbus in 1498 and became a Spanish colony until being seized by the British in 1797.  Meanwhile Tobago changed hands among Spain, Britain, the Netherlands, and the Baltic Duchy of Courland.  The two islands were ceded separately to Britain in 1802 (following hostilities with France) before being unified in 1889.  Trinidad and Tobago gained independence in 1962 and became a republic in 1976.\n</p><p>On Google Earth:\n</p>\nLighthouse  10°38'50.62\"N, 61°30'34.05\"W",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3A20191201%20Trinidad%20and%20Tobago%200006%20Port%20of%20Spain%20sRGB%20%2849294851868%29.jpg"
}