{
  "ship": "MSC Seaside",
  "ship_class": "",
  "cruise_line": "MSC Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "pCVgIeKID-U",
        "provider": "youtube",
        "title": "MSC Seaside FULL ship tour 2023 Decks 7 and 8",
        "description": "Tonight on the MSC Seaside LIVE show, we continue the MSC Seaside Full Ship Tour 2023 with Decks 7 and 8. We have several other bits of fun and then Q & A. Join us for all the FUN, LIVE on the MSC Sea"
      },
      {
        "videoId": "aApgj-mSKPQ",
        "provider": "youtube",
        "title": "MSC Seaside FULL Ship Tour 2023. 10 Cabin tour",
        "description": "On Tonights MSC Seaside FULL Ship Tour 2023 LIVE Shoiw, we are going to share with you 10 cabins or 10 staterooms. From Inside to 2 bedroom Grand Suite. Make sure to tune in. If you would like to supp"
      },
      {
        "videoId": "V0OCCW4Qg50",
        "provider": "youtube",
        "title": "MSC SEASIDE. Dec 5 & 6 Full Tour. Plus Highlghts and Q&A",
        "description": "Tonight on The MSC Seaside LIVE Show, we will cover decks 5 and 6 and show you some highlights of Ocean Cay. That is MSC’s Private island in the Bahamas. If you would like to support the Channel, plea"
      },
      {
        "videoId": "n2BTvuLsMGk",
        "provider": "youtube",
        "title": "MSC Seaside Suite with HOT TUB",
        "description": "Take a look at the MSC Seaside Aurea Balcony Suite with Hot Tub. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan *Do"
      },
      {
        "videoId": "7F3oQET8aLY",
        "provider": "youtube",
        "title": "MSC Seaside. Deluxe Balcony Tour #shorts",
        "description": "Take a look at the MSC Seaside Deluxe Balcony Cabin. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan *Don't forget t"
      },
      {
        "videoId": "QClMsB11X1c",
        "provider": "youtube",
        "title": "MSC Seaside. Inside Cabin #shorts",
        "description": "This is the MSC Seaside. This is an inside cabin. If you want to see more detailed information about the MSC Seaside, check out our main channel. If you would like to support the Channel, please consi"
      },
      {
        "videoId": "e46NmmnC334",
        "provider": "youtube",
        "title": "Spa, Yacht Club and White Night instead of Costa Maya - MSC Seaside Vlog Day 5 of 7",
        "description": "This is our fifth day on the MSC Seaside, and we are in Costa Maya. We decided to make it a ship day instead of going ashore. We try to get a tour of the Yacht Club, spend time in the spa and ramp-up "
      },
      {
        "videoId": "h_XXoHvrydc",
        "provider": "youtube",
        "title": "MSC Seaside Public Deck 16 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore the exciting MSC Seaside Public Deck 16! In this video, we’ll take you on an exclusive tour of this vibrant deck, showcasing its "
      },
      {
        "videoId": "QmlNVeL5jnc",
        "provider": "youtube",
        "title": "MSC Seaside Public Deck 18 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore the exciting and dynamic MSC Seaside Public Deck 18! In this video, we’ll take you on an immersive tour of this spectacular deck,"
      },
      {
        "videoId": "Mmd-90CYGvM",
        "provider": "youtube",
        "title": "MSC Seaside Public Deck 8 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we take you on an exciting journey through the MSC Seaside Public Deck 8! In this video, we'll explore the vibrant amenities, stunning ocean"
      },
      {
        "videoId": "av7XitsC2tw",
        "provider": "youtube",
        "title": "MSC Seaside. Embarkation Day. Join Us LIVE!",
        "description": "Today we embark on another advendure. The MSC Seaside. We have never been on MSC before so this is a new experience for us. We will bring you the good bad and ugly. If you would like to support the Ch"
      },
      {
        "videoId": "AH8ICZOdCRM",
        "provider": "youtube",
        "title": "MSC Seaside Cabin Deck 11 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore the inviting and luxurious MSC Seaside Cabin Deck 11! In this video, we'll take you on a detailed tour of this fantastic deck, hi"
      },
      {
        "videoId": "cVLwcZ0zsRA",
        "provider": "youtube",
        "title": "MSC Seaside Cabin Deck 12 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore the elegant MSC Seaside Cabin Deck 12! In our latest video, we'll take you on a detailed tour of this luxurious deck, showcasing "
      },
      {
        "videoId": "oT-xCPKk1QA",
        "provider": "youtube",
        "title": "MSC Seaside Cabin Deck 5 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us as we explore the stylish and comfortable MSC Seaside Cabin Deck 5! In our latest video, we’ll take you through the accommodations and amenitie"
      },
      {
        "videoId": "ZnH61ZUhpBE",
        "provider": "youtube",
        "title": "A Cozumel Adventure - MSC Seaside Vlog Day 6 of 7",
        "description": "This is our sixth day on the MSC Seaside, and we are in Cozumel. We are doing something we've never done before - heading out with a private guide to check out different things on the island. Join us "
      },
      {
        "videoId": "Ewfvu14JNug",
        "provider": "youtube",
        "title": "Last Day on our Cruise - MSC Seaside Vlog Day 7 of 7",
        "description": "This is our seventh day on the MSC Seaside, and we are at sea. We are privileged to watch a star be born - Wendy sings her heart out in the Main Theatre. We enjoy our last day onboard the MSC Seaside "
      },
      {
        "videoId": "9oAdFMhd3jA",
        "provider": "youtube",
        "title": "MSC Seaside Caribbean Vlog - Blue Hole Jamaica",
        "description": "Explore MSC cruises: https://www.msccruisesusa.com/en-us/Homepage.aspx The hottest ship in the Caribbean, MSC Seaside: https://www.msccruisesusa.com/en-us/Discover-MSC/Cruise-Ships/MSC-Seaside.aspx Do"
      },
      {
        "videoId": "MzDsNVScwT0",
        "provider": "youtube",
        "title": "Post Cruise Adventure - MSC Seaside Vlog Day 8 of 7",
        "description": "This is our eighth day on the MSC Seaside and debarking. We head to Cape Canaveral to pick up a rental car and drive to the Kennedy Space Center. Join us as we have some post-cruise fun before heading"
      },
      {
        "videoId": "IcP1itD119Q",
        "provider": "youtube",
        "title": "MSC Seaside Full Ship Tour, 2023 Review & BEST Spots, MSC Cruises",
        "description": ""
      }
    ],
    "oceanview": [
      {
        "videoId": "NvxSGR7ncfY",
        "provider": "youtube",
        "title": "MSC Seaside. Stateroom Tour. Accessibility Ocean View. #shorts",
        "description": "If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan *Don't forget to smash that like button and subscribe. It really hel"
      }
    ],
    "top ten": [
      {
        "videoId": "BUrHAVgwTSc",
        "provider": "youtube",
        "title": "MSC Seaside Caribbean Cruise Vlog - Spa Day",
        "description": "Special thanks to the awesome team at MSC Cruises for partnering with our family! Explore MSC cruises: https://www.msccruisesusa.com/en-us/Homepage.aspx The hottest ship in the Caribbean, MSC Seaside:"
      }
    ],
    "balcony": [
      {
        "videoId": "tYyGdf_8n6c",
        "provider": "youtube",
        "title": "MSC Seaside Caribbean Cruise Vlog - Atlantis (Repost from 2018)",
        "description": "***This is a REPOST of our 2018 MSC Seaside Cruise. We had an issue with music used, and pulled the old video down! Special thanks to the awesome team at MSC Cruises for partnering with our family! Ex"
      }
    ]
  }
}