{
  "ship": "MSC World America",
  "ship_class": "",
  "cruise_line": "MSC Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "gvUCls_Wypk",
        "provider": "youtube",
        "title": "MSC World America Cabin Deck 19 | Full Tour with Tall Man’s Cruise Adventures",
        "description": "MSC World America Cabin Deck 19 | Full Tour with Tall Man’s Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FULL TOUR of Cabin Deck 19 on the incredible MSC World Amer"
      },
      {
        "videoId": "mWeof0RJh4A",
        "provider": "youtube",
        "title": "Discover the MSC World America FULL Deck Walk Through | Tall Man's Cruise Adventures",
        "description": "Discover the MSC World America FULL Deck Walk Through | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Public Deck 7 on the spectacular new M"
      },
      {
        "videoId": "OC4Ryrn8Snc",
        "provider": "youtube",
        "title": "MSC World America - ULTIMATE Walking Ship Tour | All Public Spaces Explored!",
        "description": "🚢 MSC World America - ULTIMATE Walking Ship Tour | All Public Spaces Explored! 🌊 Welcome aboard, cruisers! Join Tall Man’s Cruise Adventures for the ULTIMATE full walking tour of MSC World America –"
      },
      {
        "videoId": "uJ3AKz2bXCs",
        "provider": "youtube",
        "title": "Fizz Champagne Bar at MSC World America Deck 8",
        "description": "Explore the ultimate fizz champagne bar! Indulge in your favorite bubbly in a dedicated space with a charming outdoor spot. Cheers to sparkling moments! #MSCWorldAmerica #TallMansCruiseAdventures #Cha"
      },
      {
        "videoId": "RRQ-qK0WNRM",
        "provider": "youtube",
        "title": "Gentlemen’s Barber on MSC World America",
        "description": "Step inside the Gentlemen’s Barber on MSC World America 💈🧔 Whether you need a quick trim or a full grooming session, this spot has you covered. While the women’s salon is located up in the spa, this"
      },
      {
        "videoId": "kLRwvwR6LaM",
        "provider": "youtube",
        "title": "MSC World America First Look! Dolce Vita Bar",
        "description": "Join us as we explore a stunning club on an MSC ship, featuring vibrant colors that transform the mood and an exceptional bar with espresso machines. Experience luxury and ambiance like never before! "
      },
      {
        "videoId": "GDj-Og_YIf0",
        "provider": "youtube",
        "title": "Panorama Lounge Tour – MSC World America Hidden Gem!",
        "description": "Join us for an exclusive tour of a cruise ship's panorama lounge, complete with pool table, club space, outdoor access, and spanning two decks! #MSCWorldAmerica #TallMansCruiseAdventures #CruiseShip #"
      },
      {
        "videoId": "owNUHdpsKVc",
        "provider": "youtube",
        "title": "Coffee Emporium At MSC World America Deck 8",
        "description": "Discover the ultimate coffee experience! We explore a coffee emporium perfect for those who appreciate quality and aroma. Lisa enjoys a delicious $4 espresso. #MSCWorldAmerica #TallMansCruiseAdventure"
      },
      {
        "videoId": "j3sbAnoKmTU",
        "provider": "youtube",
        "title": "Early Morning Action at MSC World America Casino!",
        "description": "Join us for an early morning adventure! We explore a surprisingly busy casino, finding both machines and tables still bustling. An unexpected sight! #MSCWorldAmerica #TallMansCruiseAdventures #CasinoL"
      },
      {
        "videoId": "BTbZgob6nF0",
        "provider": "youtube",
        "title": "MSC World America Cabin Deck 9 First Look! | Tall Man's Cruise Adventures",
        "description": "MSC World America Cabin Deck 9 First Look! | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Cabin Deck 9 on the exciting new MSC World Americ"
      },
      {
        "videoId": "NqQYmzyZKao",
        "provider": "youtube",
        "title": "MSC World America Deck 8 The Lanai: Best Hangout Spot on This Ship!",
        "description": "We uncover the ship's ultimate gathering place! This popular spot offers stunning views and a lively atmosphere. Find out why everyone's washing up here! #MSCWorldAmerica #TallMansCruiseAdventures #Th"
      },
      {
        "videoId": "KNl_MvBZQyM",
        "provider": "youtube",
        "title": "MSC World America Deck 8: Ride the Express Elevators to the Slides!",
        "description": "Join us as we explore express elevators that whisk passengers to deck 18 for the ultimate cruise ship water slide experience! Stay tuned as we investigate the deck number! #MSCWorldAmerica #TallMansCr"
      },
      {
        "videoId": "LAMHvfcOscU",
        "provider": "youtube",
        "title": "MSC World America First Look! Cabin Deck 12 Tour | Tall Man's Cruise Adventures",
        "description": "MSC World America First Look! Cabin Deck 12 Tour | Tall Man's Cruise Adventures 🛳️ Welcome aboard Tall Man's Cruise Adventures! Join us for a FIRST LOOK at Cabin Deck 12 on the all-new MSC World Amer"
      },
      {
        "videoId": "iS-tDlrw7Jo",
        "provider": "youtube",
        "title": "MSC World America First Look! Shopping Gallery Experience!",
        "description": "Discover a vibrant shopping gallery featuring diverse shops, from makeup and perfumes to watches, sunglasses, and more. Join us as we navigate through this shopping paradise filled with liquor, snacks"
      },
      {
        "videoId": "nWBwuV8J3ZA",
        "provider": "youtube",
        "title": "Must Visit Luxury Accessories at MSC World America Deck 8",
        "description": "Join us as we explore the cruise ship! We discover luxury accessories. Get a glimpse of the ship's shops. #MSCWorldAmerica #TallMansCruiseAdventures #Deck8 #CruiseShip #LuxuryShopping #TravelVlog #Cru"
      },
      {
        "videoId": "71LsNRFvRlI",
        "provider": "youtube",
        "title": "Outside on MSC World America Deck 8: Supercharged Shuffle and Views!",
        "description": "We explore a game resembling shuffleboard, debating its true name. Join us as we check out deck eight's smoking area, tucked away at the back. #MSCWorldAmerica #TallMansCruiseAdventures #SuperchargedS"
      },
      {
        "videoId": "LobcLaaTvEQ",
        "provider": "youtube",
        "title": "THE HUB Photo & Digit@l! on MSC World America 📸✨",
        "description": "Explore the innovative iris art, transforming eyeball photos into stunning visuals. Discover a hidden studio for capturing beautiful pictures. A must-see for photo and digital enthusiasts! #MSCWorldAm"
      }
    ],
    "accessible": [
      {
        "videoId": "5PvwNX4ktbQ",
        "provider": "youtube",
        "title": "World Promenade at MSC World America Deck 8",
        "description": "Exploring the vibrant World Promenade, surrounded by dazzling LED displays and an exciting nighttime atmosphere. #MSCWorldAmerica #TallMansCruiseAdventures #WorldPromenade #Accessibility #LEDLighting "
      },
      {
        "videoId": "2pljkjhkrl8",
        "provider": "youtube",
        "title": "MSC World America First Look! Public Deck 6: Business Center",
        "description": "Discover how our meeting rooms can be seamlessly adapted for various group functions. With AV-ready setups and customizable spaces, your next event will be a hit! Join us as we explore these dynamic e"
      },
      {
        "videoId": "aEvuQnEa_ko",
        "provider": "youtube",
        "title": "Refreshing Stop at Zest Juice Bar | MSC World America Deck 8",
        "description": "Refreshing stop at Zest Juice Bar on Deck 8 of MSC World America! Need a smoothie or fresh juice while exploring the ship? This is your spot—conveniently located near Les Dunes and right by an accessi"
      }
    ],
    "interior": [
      {
        "videoId": "AxsHnECTyFw",
        "provider": "youtube",
        "title": "MSC World America First Look: Inside the Spectacular Luna Park Arena!",
        "description": "Join us as we dive into the behind-the-scenes of Luna Park Arena's downstairs area, featuring a stunning LED wall and direct access from deck 6. Discover how this unique space comes to life after clea"
      }
    ],
    "food": [
      {
        "videoId": "J6GQiHxDHGc",
        "provider": "youtube",
        "title": "Italian Dining Experience at MSC World America Deck 8: Eataly",
        "description": "Join us as we explore Eataly, a unique Italian restaurant at sea! Watch as we discover this quaint eatery with its open kitchen and delicious offerings. Remember to make reservations! #MSCWorldAmerica"
      },
      {
        "videoId": "xdUXaI4uXes",
        "provider": "youtube",
        "title": "Les Dunes Restaurant at MSC World America Deck 8",
        "description": "We explore a smaller, more exclusive restaurant that seemingly serves similar food to others on Deck 6, but with a surprising corn twist! Join us for a quick peek. #CruiseFood #MSCWorldAmerica #TallMa"
      },
      {
        "videoId": "-zt3Kez92sw",
        "provider": "youtube",
        "title": "MSC World America Cruise Dining Experience At Butcher's Cut!",
        "description": "Discover the Butcher's Cut, MSC's specialty steak restaurant! We explore why it's the ultimate destination for steak lovers seeking a premium dining experience on MSC ships. #MSCWorldAmerica #TallMans"
      },
      {
        "videoId": "rTS5YT26BPQ",
        "provider": "youtube",
        "title": "MSC World America First Look! Bubbles Restaurant",
        "description": "Join us as we explore Bubbles, a unique restaurant offering traditional seating and anytime dining. We take a peek behind the scenes while the team engages in an important meeting, showcasing the size"
      },
      {
        "videoId": "q3aAOK4Vlpo",
        "provider": "youtube",
        "title": "MSC World America First Look! Esagono Restaurant!",
        "description": "Join us as we explore the journey of dining on the ship. From the long walk to the kitchen on deck 5 to the detailed service at your tables, we reveal what happens behind the scenes to ensure a smooth"
      },
      {
        "videoId": "CS-PB-loASg",
        "provider": "youtube",
        "title": "MSC World America First Look: Elegant Dining at La Foglia Restaurant!",
        "description": "Join us as we explore the charming La Foglia restaurant, featuring a stunning entryway and ample seating that spans the entire width of the ship. Discover what makes this dining experience unique and "
      },
      {
        "videoId": "d4ig6J4Gkgc",
        "provider": "youtube",
        "title": "MSC World America’s Kaito Teppanyaki – Intimate or Too Small?",
        "description": "We compare our local Teppanyaki spot to the NCL Aqua's 18-table setup. Is bigger always better? Find out! #MSCWorldAmerica #TallMansCruiseAdventures #KaitoTeppanyaki #Teppanyaki #NCLAqua #CruiseFood #"
      },
      {
        "videoId": "pz393QlntR0",
        "provider": "youtube",
        "title": "Paxos Greek Restaurant: A Must-Try Foodie at MSC World America Deck 8",
        "description": "Join us as we explore Paxos, a delicious Greek restaurant! We check out the full menu and share why we love Greek food. Get ready for a foodie adventure! #MSCWorldAmerica #TallMansCruiseAdventures #Gr"
      },
      {
        "videoId": "izF-c8cH6js",
        "provider": "youtube",
        "title": "Sweet Temptations at MSC World America Deck 8: Candy, Ice Cream & More!",
        "description": "Explore a delightful world of candies, chocolates, ice cream, and build-your-own sundaes! We uncover a hidden seating area and a peek at crepe & waffle creations. #MSCWorldAmerica #TallMansCruiseAdven"
      },
      {
        "videoId": "uK0pnu9AznI",
        "provider": "youtube",
        "title": "MSC World America First Look! Public Deck 6: Jean-Philippe Chocolat and Cafe",
        "description": "Experience the delightful world of Jean-Philippe Chocolat and Cafe, where you can indulge in exquisite gelato and watch chocolate-making magic. This beloved gem is known for its amazing chocolates and"
      }
    ],
    "suite": [
      {
        "videoId": "-VJDgOoj0ic",
        "provider": "youtube",
        "title": "MSC World America Deck 8 Elixir Mixology Bar: Al Fresco Drinks and Hidden Spaces!",
        "description": "Explore Elixir Mixology Bar, a haven for high-craft cocktails with a unique outdoor porch. Join us as we showcase this cool space! #MSCWorldAmerica #TallMansCruiseAdventures #ElixirMixology #CocktailB"
      }
    ]
  }
}