{
  "ship": "MSC Seashore",
  "ship_class": "",
  "cruise_line": "MSC Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "J1fGty7gPeM",
        "provider": "youtube",
        "title": "MSC Seashore Cabin Deck 5 Ship Tour and Review 2024 | Tall Man's Cruise Adventures",
        "description": "MSC Seashore Cabin Deck 5 Ship Tour and Review 2024 | Tall Man's Cruise Adventures Set sail with Tall Man's Cruise Adventures as we embark on an exhilarating journey aboard the magnificent MSC Seashor"
      },
      {
        "videoId": "SXmM-G34KjE",
        "provider": "youtube",
        "title": "MSC Seashore | 2 Bedroom Aurea Grand Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a 2 Bedroom Aurea Grand Suite on the beautiful MSC Seashore. This suite is perfect for families, as it features a primary bedroom, second bedroom, large living space"
      },
      {
        "videoId": "9k4uShl50KE",
        "provider": "youtube",
        "title": "MSC Seashore | Aft Corner Aurea Grand Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour an Aft Corner Aurea Grand Suite on the beautiful MSC Seashore. This spacious suite features a king size bed, large bathroom, sitting area, and a large wraparound bal"
      },
      {
        "videoId": "I010eG_NTVQ",
        "provider": "youtube",
        "title": "MSC Seashore | Aurea Balcony Stateroom Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour an Aurea Balcony Stateroom on the beautiful MSC Seashore. This beautiful stateroom offers plenty of space with a large bed, sofa that can convert to bunk beds, a pri"
      },
      {
        "videoId": "xYkh5EGU8D8",
        "provider": "youtube",
        "title": "MSC Seashore | Aurea Grand Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a Aurea Grand Suite on the beautiful MSC Seashore. This particular suite is a forward middle, and offers a beautiful amount of space with a primary bedroom, living r"
      },
      {
        "videoId": "LHMZWXc4cl4",
        "provider": "youtube",
        "title": "MSC Seashore | Aurea Premium Suite with Terrace Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour an Aurea Premium Suite with Terrace on the beautiful MSC Seashore. This beautiful suite offers a king bed, living area with pull-out sofa, and an extra-large forward"
      },
      {
        "videoId": "Z1MgkNFx66k",
        "provider": "youtube",
        "title": "MSC Seashore | Aurea Premium Suite with Whirlpool Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour an Aurea Premium Suite with Whirlpool on the beautiful MSC Seashore. This beautiful suite offers a king bed, living area with pull-out sofa, and an extra-large balco"
      },
      {
        "videoId": "jbMQhpCI750",
        "provider": "youtube",
        "title": "MSC Seashore | Deluxe Balcony Stateroom Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a Deluxe Balcony Stateroom on the beautiful MSC Seashore. This beautiful stateroom offers plenty of space with a large bed, sofa that can convert to bunk beds, a bat"
      },
      {
        "videoId": "-4rbDbK8vN0",
        "provider": "youtube",
        "title": "MSC Seashore | Forward Corner Aurea Grand Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a Aurea Grand Suite on the beautiful MSC Seashore. This particular suite is a forward corner, and offers a beautiful amount of space with a primary bedroom, living r"
      },
      {
        "videoId": "68qSsyRqbOk",
        "provider": "youtube",
        "title": "MSC Seashore | Full Ship Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour the beautiful MSC Seashore. This incredible ship has so much to offer, from the delicious dining, to the thrilling onboard activities, dynamic entertainment, and so "
      },
      {
        "videoId": "1KC0bBGLZLs",
        "provider": "youtube",
        "title": "MSC Seashore | Junior Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a Junior Suite on the beautiful MSC Seashore. This beautiful suite offers a king bed, living area with pull-out sofa, and a spacious balcony. Ready to book your next"
      },
      {
        "videoId": "bxNqEG_ZT5M",
        "provider": "youtube",
        "title": "MSC Seashore | Yacht Club Deluxe Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a Yacht Club Deluxe Suite on the beautiful MSC Seashore. This incredible suite is the entry-level to the Yacht Club suites, and offers a spacious bedroom/living area"
      },
      {
        "videoId": "wo_2r-OjN90",
        "provider": "youtube",
        "title": "MSC Seashore | Yacht Club Grand Deluxe Suite Full Walkthrough Tour | 2024 | 4K",
        "description": "Join Danny and Taylor as they tour a Yacht Club Grand Deluxe Suite on the beautiful MSC Seashore. This spacious suite features a large king size bed, sitting area with a pull-out sofa, a large bathroo"
      },
      {
        "videoId": "hVPoIZjPK5Y",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Grand Suite #shorts",
        "description": "MSC Seashore Aurea Grand Suite. A Multiple room suite with Living Room, Bedroom, Walk in closet, Bathroom and Balcony.The MSC Seashore Aurea Grand Suite is a MUST see. If you would like to support the"
      },
      {
        "videoId": "oOP6MsjRV5A",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Jr Suite. GIGANTIC Balcony! #shorts",
        "description": "MSC Seashore Aurea Jr Suite. This suite has a Gigantic Balcony. Definitely worth the price. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www."
      },
      {
        "videoId": "suQP9fQaTGc",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Premium Suite With Terrace. Quick Look",
        "description": "This is the MSC Seashore Aurea Premium Suite With Terrace. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Facebook:"
      },
      {
        "videoId": "ydAw1zti8Ik",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Premium Suite with Whirlpool #shorts",
        "description": "MSC Seashore Aurea Premium Suite with Whirlpool Check out this Aurea Premium Suite with Whirlpool on the MSC Seashore. MSC Cruises presents some of the lowest prices for value right now. Whether its a"
      },
      {
        "videoId": "F_-yGq09g70",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Accessibility Balcony. Quick Look!",
        "description": "This is the MSC Seashore Aurea Accessibility Balcony. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Facebook: http"
      },
      {
        "videoId": "uDqs9h4hnGI",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Deluxe Balcony. Quick Look! #shorts",
        "description": "This is the MSC Seashore Aurea Deluxe Balcony. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Facebook: https://www"
      },
      {
        "videoId": "u_I9K-jxRrA",
        "provider": "youtube",
        "title": "MSC Seashore Rear Facing Aurea Premium Balcony Cabin #shorts",
        "description": "This is the MSC Seashore Rear Facing Aurea Premium Balcony Cabin. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Fa"
      },
      {
        "videoId": "0SOi4w3uimA",
        "provider": "youtube",
        "title": "MSC Seashore Oceanview Cabin #shorts",
        "description": "This is the MSC Seashore Oceanview Cabin. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Facebook: https://www.face"
      },
      {
        "videoId": "ct46fkERPsY",
        "provider": "youtube",
        "title": "MSC Seashore Aurea Inside Cabin #shorts",
        "description": "MSC Seashore Aurea Inside Cabin. VERY Spacious for Inside Cabin. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Fac"
      },
      {
        "videoId": "9uCU0rhLdzU",
        "provider": "youtube",
        "title": "MSC Seashore Inside Accessibility Cabin #short",
        "description": "This is the MSC Seashore Inside Accessibility Cabin. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Facebook: https"
      },
      {
        "videoId": "cSKHUNEOWro",
        "provider": "youtube",
        "title": "MSC Seashore Inside Cabin. VERY Spacious!!! #shorts",
        "description": "MSC Seashore Inside Cabin. VERY Spacious for Inside Cabin. If you would like to support the Channel, please consider joining the Tall Man Clan on Patreon. https://www.patreon.com/TallManClan Facebook:"
      },
      {
        "videoId": "GJipDB6AFgA",
        "provider": "youtube",
        "title": "MSC Seashore LIVE! Games and Pools and Slides... Oh My!",
        "description": "On Tonights Tall Man Cruise Adventures LIVE, join us from the MSC Seashore as we go over the last of the public spaces. We will also cover days events and Of course we will have Q&A after. If you have"
      },
      {
        "videoId": "vwzRwrSCGD8",
        "provider": "youtube",
        "title": "MSC SEASHORE Pools, Buffet and MORE!. LIVE!!!",
        "description": "On Tonights Tall Man Cruise Adventures LIVE, join us from the MSC Seashore as we give you a complete tour of decks 8 outside and 16. Of course we will have Q&A after. If you have not been on the MSC S"
      },
      {
        "videoId": "zsq0wQ2_xR4",
        "provider": "youtube",
        "title": "MSC Seashore LIVE EMBARKATION!. Delays and Changes. Oh well!",
        "description": "On Tonights Tall Man Cruise Adventures LIVE, join us from the MSC Seashore as we depart Port Canaveral and head to the Bahamas on the first leg of a Back to Back. Today was a good day to have your pat"
      },
      {
        "videoId": "clz4lL5QqvY",
        "provider": "youtube",
        "title": "Msc Seashore Public Deck 16 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Get ready to explore the excitement and entertainment of MSC Seashore's dynamic Public Deck 16! Join us in our latest video as we embark on a journey t"
      },
      {
        "videoId": "xKhlFqMYHGA",
        "provider": "youtube",
        "title": "Msc Seashore Public Deck 18 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Prepare for an exhilarating adventure as we explore MSC Seashore's vibrant Public Deck 18! Join us in our latest video as we journey through this dynam"
      },
      {
        "videoId": "TqHSFmfurrs",
        "provider": "youtube",
        "title": "MSC Seashore Public Deck 19 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Get ready for an exclusive exploration of MSC Seashore's spectacular Public Deck 19! Join us in our latest video as we ascend to the highest deck of th"
      },
      {
        "videoId": "MurcbYaE1Gw",
        "provider": "youtube",
        "title": "MSC Seashore Public Deck 6 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Prepare to be amazed as we embark on a captivating journey to explore the vibrant Public Deck 6 of the magnificent MSC Seashore! Join us in our latest "
      },
      {
        "videoId": "uNhkYs4L8Jo",
        "provider": "youtube",
        "title": "Msc Seashore PUBLIC Deck 8 Outside | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Get ready to experience the exhilarating outdoor spaces of MSC Seashore's Public Deck 8! Join us in our latest video as we explore this dynamic deck, f"
      },
      {
        "videoId": "7mGu77lfIO0",
        "provider": "youtube",
        "title": "MSC SEASHORE CABIN DECK 12 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Get ready to uncover the elegance and comfort of MSC Seashore's Cabin Deck 12! Join us in our latest video as we guide you through this luxurious deck,"
      },
      {
        "videoId": "A7iQNx7BJrg",
        "provider": "youtube",
        "title": "MSC Seashore Cabin Deck 13 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Prepare to discover the luxury and comfort of MSC Seashore's Cabin Deck 13! Join us in our latest video as we unveil the elegance and breathtaking view"
      },
      {
        "videoId": "OWpPYzZQW4s",
        "provider": "youtube",
        "title": "MSC Seashore CABIN Reviews, B2B Details and MORE. LIVE!!!",
        "description": "On Tonights Tall Man Cruise Adventures LIVE, join us from the MSC Seashore as we give you a complete tour of 14 different cabin categories From inside to suites. We will also cover the B2B experience "
      },
      {
        "videoId": "mqHg7EpQg38",
        "provider": "youtube",
        "title": "MSC Seashore Complete Deck 5 & 6 Tour. LIVE!!!",
        "description": "On Tonights Tall Man Cruise Adventures LIVE, join us from the MSC Seashore as we give you a complete tour of decks 5 and 6. Of course we will have Q&A after. If you have not been on the MSC Seashore 2"
      },
      {
        "videoId": "oUUNRq7IAnA",
        "provider": "youtube",
        "title": "MSC Seashore LIVE! Complete tour of Decks 7 and 8 plus a TON more!",
        "description": "On Tonights Tall Man Cruise Adventures LIVE, join us from the MSC Seashore as we give you a complete tour of decks 7 and 8. Of course we will have Q&A after. If you have not been on the MSC Seashore 2"
      }
    ],
    "food": [
      {
        "videoId": "LokMNJxdwRY",
        "provider": "youtube",
        "title": "MSC Seashore Public Deck 5 | Tall Man's Cruise Adventures",
        "description": "Ahoy, fellow adventurers! 🛳️ Join Tall Man's Cruise Adventures as we take you on an exciting tour of MSC Seashore's vibrant Public Deck 5! In our latest video, \"MSC Seashore Public Deck 5,\" we invite"
      }
    ],
    "suite": [
      {
        "videoId": "sFj5xHNnnsE",
        "provider": "youtube",
        "title": "Discover the New MSC Seashore Cabin Deck 9 | Tall Man's Cruise Adventures",
        "description": "🛳️ Welcome aboard Tall Man's Cruise Adventures! Are you ready to embark on an unforgettable journey to discover the elegance of MSC Seashore's Cabin Deck 9? Join us in our latest adventure as we expl"
      }
    ],
    "oceanview": [
      {
        "videoId": "Urug8rzfCh8",
        "provider": "youtube",
        "title": "MSC Seashore. Should you BOOK MSC in 2024. Tall Man's Cruise Adventures LIVE",
        "description": "Set sail with Tall Man's Cruise Adventures as we embark on an exhilarating journey aboard the magnificent MSC Seashore! 🛳️ In this immersive video experience titled \"MSC Seashore Should you book MSC "
      }
    ]
  }
}