{
  "ship": "Norwegian Prima",
  "ship_class": "Prima Class",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-21",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "The Ocean Boulevard Redemption",
      "persona_label": "Solo Traveler",
      "persona": "solo",
      "intended_reader": "Solo travelers considering Norwegian Prima or their first solo cruise",
      "core_insight": "Prima's Ocean Boulevard design creates natural connection points for solo cruisers without forced socialization",
      "markdown": "**I booked Norwegian Prima three weeks after the divorce was finalized.**\n\nMy therapist called it 'radical self-care.' My mother called it 'running away.' I called it survival. Twenty-three years of marriage, two grown children, and suddenly I didn't know who I was without the word 'wife' attached to my name.\n\nPrima's [Ocean Boulevard](/ships/norwegian/norwegian-prima.html) changed everything. This outdoor promenade wrapping the entire ship meant I was never stuck in a hallway with nowhere to go. When the dining room felt too quiet (table for one, please), I could walk outside and watch the wake trail behind us—miles of churned water marking where we'd been, pointing toward where I was going.\n\nThe first night, I stood at the glass railings near [Indulge Food Hall](/restaurants.html), crying into my champagne. A crew member named Rodrigo appeared with a tissue and a smile. 'First cruise alone?' he asked. When I nodded, he said, 'The ocean teaches us—we are never truly alone. The water connects everything.'\n\nHe walked me to [Infinity Beach](/ships/norwegian/norwegian-prima.html), the adults-only area where the pool seems to spill into the sea. 'Sit here tomorrow at sunset,' he said. 'You'll understand.'\n\nI did. And I did understand. Surrounded by strangers who became friends, watching the sun sink into water that stretched to horizons I'd never imagined, I remembered who I was before I became someone's anything.\n\n**The truth:** Prima's design intentionally creates what Norwegian calls 'social spontaneity'—spaces where connection happens naturally. For solo travelers, this means you're never isolated unless you choose to be. for more.\n\n**The lesson:** Solitude doesn't have to mean isolation.",
      "author": {
        "name": "Patricia M.",
        "location": "Denver, CO"
      }
    },
    {
      "title": "When Dad's Wheelchair Became Wings",
      "persona_label": "Accessibility Story",
      "persona": "accessible",
      "intended_reader": "Families traveling with wheelchair users or those with mobility challenges",
      "core_insight": "Prima Class ships feature NCL's most accessible design with wide corridors and barrier-free experiences",
      "markdown": "**Dad hadn't left his house in two years after the stroke.**\n\nThe wheelchair felt like a prison, he said. Too wide for restaurant aisles. Too heavy for movie theaters. Too *visible* for a man who'd spent forty years as a firefighter, carrying people to safety. Now he needed carrying.\n\nMy sister found Prima's [accessibility features](/accessibility.html) online. 'Look,' she said, showing me deck plans. 'Ocean Boulevard is completely flat. Wide enough for two wheelchairs side by side. And these infinity pools—they have lift access.'\n\nDad said no. Mom said yes. We booked it anyway.\n\nThe first morning, I pushed Dad's wheelchair onto Ocean Boulevard at sunrise. He gripped the armrests like he was bracing for disappointment. But the crew member who met us—Elena, from Croatia—didn't see a wheelchair. She saw a guest.\n\n'Would you like to go all the way around?' she asked. 'Some guests do the full loop before breakfast. 1,532 feet of promenade. I can walk with you if you'd like company.'\n\nDad looked at me. I saw something I hadn't seen since the stroke: curiosity.\n\nWe did the full loop. Then we did it again. By day three, Dad was racing other wheelchair users to [Indulge Food Hall](/restaurants.html), betting desserts on who'd arrive first. The crew cheered him on like he was winning the Olympics.\n\nAt [The Haven Sundeck](/ships/norwegian/norwegian-prima.html), reserved for suite guests but opened for Dad after staff learned his story, he watched the sunset from the highest deck on the ship. 'I forgot,' he whispered, 'what it felt like to go places.'\n\n**The lesson:** Prima was designed from the keel up for accessibility.",
      "author": {
        "name": "Marcus J.",
        "location": "Tampa, FL"
      }
    },
    {
      "title": "The Indulge Food Hall Miracle",
      "persona_label": "Multi-Generational Family",
      "persona": "multi-generational",
      "intended_reader": "Families planning cruises with picky eaters, dietary restrictions, or varied age groups",
      "core_insight": "Prima's Indulge Food Hall solves the impossible puzzle of feeding everyone from toddlers to grandparents",
      "markdown": "**Feeding our family requires a UN peace negotiator.**\n\nGrandma keeps kosher. My husband is vegan. Our twelve-year-old survives on chicken nuggets. The twins have nut allergies so severe we carry EpiPens everywhere. And my father-in-law insists on steak at every meal because 'that's what vacations are for.'\n\nEvery restaurant we've ever visited ends in tears, negotiations, or someone eating sad salads while others feast. We'd stopped traveling as a family. Too hard. Too much guilt.\n\nThen my sister-in-law suggested Prima's [Indulge Food Hall](/ships/norwegian/norwegian-prima.html). 'It's like eleven restaurants in one space,' she said. 'Everyone orders from different places, but you all sit together.'\n\nI didn't believe it until I saw it.\n\nThe first night, we walked in and I almost cried. Grandma found a station with clearly marked kosher options. My husband discovered a vegan bowl bar with actual *variety*. The twins could eat allergen-free at stations where staff knew exactly what was in every dish. And my father-in-law? Prime rib carved to order, twenty feet from where Grandma got her kosher meal.\n\nWe sat at one table. All of us. Eating food we'd *chosen*, not compromised on.\n\nThe head chef, Ravi, noticed us coordinating on day two. 'First time traveling together?' he asked. When I explained our dietary chaos, he didn't blink. 'Let me show you the allergen guide,' he said. 'And here—' he handed me a card '—give this to any station. They'll call me personally to prepare safe plates for the twins.'\n\nBy day five, my mother-in-law said what we'd all been thinking: 'This is the first vacation where nobody cried at dinner.'\n\n**The truth:** Indulge Food Hall isn't just convenient—it's revolutionary for complex families. Eleven concepts, one location, no compromises. for multi-generational planning tips.",
      "author": {
        "name": "Rachel S.",
        "location": "Phoenix, AZ"
      }
    },
    {
      "title": "Mom's Last Dance at Prima Theater",
      "persona_label": "Final Journey",
      "persona": "elderly",
      "intended_reader": "Families creating memories with aging or terminally ill loved ones",
      "core_insight": "Prima's entertainment venues accommodate guests of all mobility levels with dignity",
      "markdown": "**Mom was diagnosed in April. We sailed in September.**\n\nPancreatic cancer. Stage four. The doctors gave her months, not years. She'd always wanted to see the Mediterranean, but Dad's fear of flying meant they never went. Now Dad was gone, and Mom was going too.\n\n'I want to dance one more time,' she said. 'Somewhere beautiful. Somewhere that feels like a movie.'\n\nWe booked Prima for a two-week Mediterranean. The crew didn't know Mom's diagnosis—we didn't want pity. But they somehow sensed she needed extra grace.\n\nAt [Prima Theater](/ships/norwegian/norwegian-prima.html), the revolutionary three-story venue with the moving stage platforms, Mom watched the shows from a special accessible area Elena arranged. 'Best seats in the house,' Elena insisted, though I knew she'd moved other guests to make room.\n\nOn the last night, the ship's band played 'Moon River' during the final show. Mom turned to me with tears streaming. 'I want to dance,' she said.\n\nElena appeared—she always seemed to appear. 'Mrs. Cooper,' she said, 'would you like to dance with me?'\n\nThey danced right there, in the accessible section, while the band played. Other guests stood and watched. Some applauded. Some cried. Mom's oxygen tank rolled beside them, but she moved like she was twenty again.\n\n'Thank you,' Mom whispered when the song ended. 'You gave me my movie.'\n\nShe passed six weeks after we returned home. But in her final days, she talked about Prima. About Elena. About dancing while the ship carried her through the Adriatic.\n\n**The lesson:** Time is the one currency we cannot earn more of.",
      "author": {
        "name": "Sarah C.",
        "location": "Boston, MA"
      }
    },
    {
      "title": "The Haven Saved Our Honeymoon",
      "persona_label": "Honeymoon Recovery",
      "persona": "honeymoon",
      "intended_reader": "Couples planning honeymoons or seeking romantic cruise experiences",
      "core_insight": "The Haven's ship-within-a-ship concept creates intimate luxury even on Prima's large-scale vessel",
      "markdown": "**Our honeymoon was supposed to be perfect. It wasn't.**\n\nThe wedding had been chaos—vendors canceling, family drama, a cake that arrived the wrong flavor. By the time we boarded Prima, we were exhausted, resentful, and barely speaking. Not exactly newlywed bliss.\n\n[The Haven](/ships/norwegian/norwegian-prima.html) changed everything.\n\nWe'd upgraded at the last minute—my mother's wedding gift after seeing us argue at the reception. 'You need privacy,' she said. 'You need space to find each other again.'\n\nThe Haven is Norwegian's luxury enclave at the top of the ship. Private restaurant. Private sundeck. Private pool. Butler service that anticipates needs before you voice them. It felt less like a cruise and more like a floating sanctuary.\n\nOur butler, James, noticed the tension immediately. He didn't comment, but the first evening, he arranged dinner on our private balcony instead of the Haven restaurant. 'Sometimes,' he said, 'couples need to remember why they chose each other. The sea helps with that.'\n\nWe ate lobster tail while the sunset painted the water gold. We talked—really talked—for the first time in weeks. About the wedding stress. About expectations. About the marriage we actually wanted versus the wedding we'd just survived.\n\nBy night three, we were renewing informal vows on the Haven Sundeck, just us and the stars. The other Haven guests had become friends, joining us for champagne and cheering as we kissed like we should have at the altar.\n\n**The truth:** The Haven isn't just luxury—it's intentional space. For couples needing reconnection, the ship-within-a-ship design offers privacy without isolation, intimacy without claustrophobia.\n\nWeddings end. Marriages begin. The Haven gave us space to start ours properly.\n\n**The lesson:** The best honeymoon teaches partnership through both joy and challenge.",
      "author": {
        "name": "Daniel and Christina L.",
        "location": "San Diego, CA"
      }
    },
    {
      "title": "Finding Peace After Afghanistan",
      "persona_label": "Veteran Healing",
      "persona": "veteran",
      "intended_reader": "Veterans, first responders, or trauma survivors seeking therapeutic travel",
      "core_insight": "Prima's expansive outdoor spaces and ocean views offer respite for those processing trauma",
      "markdown": "**The VA therapist said I needed water.**\n\nThree tours. Two Purple Hearts. One divorce. And nightmares that made sleep feel like enemy territory. The Veterans Crisis Line was programmed into my phone. My service dog, Ranger, went everywhere with me.\n\nMy sister booked Prima without asking. 'Ocean views everywhere,' she said. 'Outdoor spaces. Horizon lines. Your therapist said those help.'\n\nShe was right.\n\n[Ocean Boulevard](/ships/norwegian/norwegian-prima.html) became my patrol route—safe, predictable, infinite. Every morning at 0500, before the ship woke, I walked the full loop with Ranger. The crew learned our routine. They nodded, didn't speak. They understood that some soldiers need silence.\n\nThe first panic attack hit at [Indulge Food Hall](/restaurants.html)—too many people, too much noise. I grabbed Ranger's harness and tried to find an exit. A crew member named David appeared. He didn't ask if I was okay. He just said, 'Follow me.'\n\nHe led us to the crew's outdoor break area, technically off-limits to guests. 'Sit here,' he said. 'Take as long as you need. I'll stand outside the door.'\n\nI sat there for an hour, watching the horizon, breathing like my therapist taught me, while David kept guard. When I finally emerged, he said only: 'Thank you for your service. And for trusting us with your healing.'\n\nLater I learned David was former Royal Navy. He'd seen things too.\n\nBy cruise end, I'd made it through a Broadway show at [Prima Theater](/ships/norwegian/norwegian-prima.html), eaten dinner in the main dining room, and laughed—actually laughed—for the first time in eighteen months.\n\n**The lesson:** Prima's crew includes veterans who understand.",
      "author": {
        "name": "Kevin R.",
        "location": "Charlotte, NC"
      }
    },
    {
      "title": "The Drop Slide and My Daughter's Courage",
      "persona_label": "Parenting Moment",
      "persona": "family",
      "intended_reader": "Parents of anxious children or those seeking confidence-building travel experiences",
      "core_insight": "Prima's thrill rides become proving grounds for children learning to face fears",
      "markdown": "**My daughter was afraid of everything.**\n\nElevators. Escalators. Swimming pools. She'd been diagnosed with generalized anxiety at age seven. Our life revolved around avoiding triggers, managing panic attacks, and convincing her the world wasn't as scary as her brain insisted.\n\nShe was eleven when we boarded Prima. Her therapist had suggested 'controlled exposure'—facing fears in safe environments. [The Drop](/ships/norwegian/norwegian-prima.html), Prima's ten-story freefall slide, seemed like the worst possible idea.\n\nBut Emily saw the slide from the dock. 'I want to try,' she said.\n\nI nearly said no. Every parental instinct screamed to protect her from failure, from fear, from the panic attack I knew would follow. But her therapist's voice echoed: 'Let her try. Let her learn she can survive the fear.'\n\nThe first day, Emily stood at the base, watching others drop. 'Not today,' she said. I told her that was okay.\n\nDay three, she climbed to the top. Stood at the capsule door. Then walked back down. The crew member running the slide, a young woman named Sofia, followed her. 'I was scared my first time too,' Sofia said. 'I stood up here for twenty minutes before I dropped. Want to know a secret? I'm still scared every time. But scared isn't the same as can't.'\n\nDay five, Emily dropped.\n\nI heard her scream all the way down—a scream that started in terror and ended in triumph. When she emerged at the bottom, shaking and laughing, she ran to me and said: 'I was so scared. And I did it anyway. I DID IT ANYWAY, MOM.'\n\n**The truth:** Prima's thrill rides aren't just entertainment—they're confidence laboratories.\n\nEmily still has anxiety. But now, when panic tells her she can't do something, she remembers The Drop. She remembers Sofia. She remembers that scared and can't are different words. She survived her fear. That changes everything.\n\n**The lesson:** Multi-generational travel works when the ship works harder than your family does.",
      "author": {
        "name": "Jennifer T.",
        "location": "Atlanta, GA"
      }
    },
    {
      "title": "Fifty Years and Still Learning",
      "persona_label": "Anniversary Celebration",
      "persona": "anniversary",
      "intended_reader": "Long-married couples celebrating milestones or seeking reconnection",
      "core_insight": "Prima's variety of experiences offers couples new things to discover together even after decades",
      "markdown": "**Fifty years married. We thought we knew everything about each other. We were wrong.**\n\nAfter five decades, you settle into patterns. Harold reads on the balcony. I do crosswords in the room. We eat at 6 PM, always the same order: appetizer, entrée, skip dessert. We'd stopped surprising each other sometime around year thirty.\n\nOur granddaughter booked Prima for our anniversary. 'I want you to try new things,' she wrote in the card. 'Like you did when you were young.'\n\nHarold, who hadn't tried new food since 1987, discovered Korean tacos at [Indulge Food Hall](/ships/norwegian/norwegian-prima.html). He ate three helpings while I stared in disbelief. 'What?' he said, mouth full. 'They're delicious.'\n\nI, who hadn't worn a swimsuit in public since our children were born, tried [Infinity Beach](/ships/norwegian/norwegian-prima.html). The warm saltwater, the feeling of floating at the edge of the world—I understood why our granddaughter loved the ocean.\n\nBut the real surprise came at [Vibe Beach Club](/ships/norwegian/norwegian-prima.html). Harold, seventy-four years old, asked me to dance. Not the slow shuffle we did at weddings, but actual dancing. The DJ played Earth, Wind & Fire. Harold spun me. I laughed so hard I nearly fell.\n\n'I used to dance like this,' he said, breathless but grinning. 'Before mortgage payments and responsibility. I forgot I could move.'\n\n'I forgot too,' I admitted. 'Forgot a lot of things. Forgot who we were before we became who we are.'\n\nThat night, on our balcony, we talked until 2 AM. Not about the kids, the grandkids, the house—about us. Our dreams that never happened. Our regrets. Our gratitude. Fifty years, and Prima helped us find new words.\n\n**The lesson:** Long marriages need new experiences.",
      "author": {
        "name": "Betty and Harold K.",
        "location": "Cleveland, OH"
      }
    },
    {
      "title": "Widowed at Sixty-Three",
      "persona_label": "Grief and Healing",
      "persona": "widow",
      "intended_reader": "Widows, widowers, and those processing loss who are considering solo travel",
      "core_insight": "Prima's vibrant energy helps those in grief remember that joy still exists",
      "markdown": "**Robert died on a Tuesday. I booked Prima on a Friday.**\n\nPeople thought I was crazy. 'Too soon,' they said. 'You're not thinking clearly.' But I was thinking more clearly than I had in months. Robert and I had planned this cruise together. He'd marked the date on the calendar, circled in his neat handwriting. The tumor took him before we could go.\n\nI went anyway. For both of us.\n\nThe first night was agony. Every couple I saw reminded me of what I'd lost. Every romantic sunset felt like mockery. I almost disembarked at the first port.\n\nBut then I met the grief club.\n\nThey called themselves that, laughing—four widows who'd found each other at [Indulge Food Hall](/ships/norwegian/norwegian-prima.html), comparing wedding rings we still couldn't remove. Margaret, three years out. Dorothy, eighteen months. Linda, seven months. And me, sixty-two days.\n\n'We do this every year,' Margaret explained. 'Different ships, same purpose. Proving that joy still exists.'\n\nThey dragged me to activities I would have avoided. [The Prima Theater](/ships/norwegian/norwegian-prima.html) shows where I cried during love songs. [Ocean Boulevard](/ships/norwegian/norwegian-prima.html) walks where they let me talk about Robert without changing the subject. [Vibe Beach Club](/ships/norwegian/norwegian-prima.html) where they insisted I wear the swimsuit I'd packed 'just in case.'\n\nThe last night, we stood at the ship's stern watching the wake. Margaret handed me a flower—she'd brought one for each of us. 'Throw it in,' she said. 'Tell him thank you. Tell him you're going to live.'\n\nI threw the flower. I told Robert I loved him. And I told him I would live—not because grief was gone, but because love demanded it.\n\n**The truth:** Grief doesn't travel on a schedule. But Prima's energy, activities, and strange ability to collect grieving souls gave me permission to feel joy again.\n\n---\n\n**Planning a cruise after loss?** Read: [In the Wake of Grief: When Loss Needs Water](/solo/in-the-wake-of-grief.html) — for widows, widowers, and bereaved travelers navigating first cruises and the journey from 'we' to 'I.'\n\n**The lesson:** Grief needs beautiful places to breathe.",
      "author": {
        "name": "Catherine B.",
        "location": "Portland, OR"
      }
    },
    {
      "title": "How Prima's Glass Made My Son Speak",
      "persona_label": "Special Needs Breakthrough",
      "persona": "special-needs",
      "intended_reader": "Parents of autistic or neurodiverse children seeking autism-friendly travel",
      "core_insight": "Prima's open sightlines and predictable spaces work well for autistic guests who need visual orientation",
      "markdown": "**Autism had shrunk our world to familiar places.**\n\nOliver, nine years old, nonverbal, loved exactly three locations: home, Grandma's house, and the library. New environments triggered shutdowns that could last hours. Vacations felt impossible. We'd stopped trying.\n\nMy husband found an article about cruise ships and autism—the predictability of schedules, the contained environment, the visual stimulation without overstimulation. We researched for months. Prima kept appearing: wide corridors, glass walls with ocean views everywhere, layouts that made visual sense.\n\nThe first hours were hard. Oliver covered his ears at embarkation. Too many people. Too much noise. We retreated to the [balcony cabin](/ships/norwegian/norwegian-prima.html) and watched the port recede in silence.\n\nBut then—[Ocean Boulevard](/ships/norwegian/norwegian-prima.html). Oliver pressed his hands against the glass walls, watching the sea slide past. He followed the promenade, touching each section of glass like he was counting prayers. The crew learned to give him space. He walked that loop seventeen times before dinner.\n\nBy day three, Oliver had mapped the entire ship. He knew which elevators had glass walls (his favorite) and which were enclosed (avoided). He found [Indulge Food Hall](/ships/norwegian/norwegian-prima.html)'s patterns—busy times, quiet times, which station had the foods he'd eat.\n\nDay five, at sunset, we stood at the aft glass watching dolphins. Oliver, who hadn't spoken in six months, turned to me and said: 'Water happy.'\n\nTwo words. But they were his words. Prima's glass walls had given him something to describe. The ocean had given him joy worth sharing.\n\n**The lesson:** Prima's design isn't intentionally autism-friendly, but its open sightlines, visual predictability, and glass-heavy architecture work remarkably well for neurodiverse guests.",
      "author": {
        "name": "Stephanie and Michael T.",
        "location": "Minneapolis, MN"
      }
    },
    {
      "title": "The Graduation Gift That Mattered",
      "persona_label": "Achievement Celebration",
      "persona": "special-occasion",
      "intended_reader": "Families celebrating academic achievements or significant milestones",
      "core_insight": "Prima's newness matches the significance of major life achievements",
      "markdown": "**Four years of engineering school. Four years of sacrificed weekends.**\n\nMy daughter graduated with honors while working two jobs. She'd turned down spring breaks, skipped parties, lived on ramen while her classmates enjoyed college. The graduation ceremony was ninety minutes. It didn't feel sufficient.\n\n[Norwegian Prima](/ships/norwegian/norwegian-prima.html) was my attempt at sufficient.\n\nThe ship's newness mattered. First cruise on Norwegian's newest class. Everything gleaming and fresh. An achievement deserving of achievement-level celebration.\n\n[Ocean Boulevard](/ships/norwegian/norwegian-prima.html) became her thinking space. She'd walk the promenade at sunrise, processing the transition from student to engineer. Four years of tunnel vision finally widening.\n\nThe crew didn't know her story. But they sensed celebration. Our server at [Palomar](/ships/norwegian/norwegian-prima.html) asked what we were toasting. When my daughter explained her graduation, the sommelier sent champagne.\n\n'To engineers who build tomorrow,' he said. 'And families who build engineers.'\n\nShe cried into her champagne. Not sad tears—release tears. Four years of pressure finally acknowledging completion.\n\n**The lesson:** Prima's newness provides proper setting for achievements that deserve fresh beginnings.",
      "author": {
        "name": "Robert and Sandra T.",
        "location": "Houston, TX"
      }
    },
    {
      "title": "The Social Worker Found Silence",
      "persona_label": "Caregiver Recovery",
      "persona": "healing",
      "intended_reader": "Social workers, therapists, or anyone carrying clients' trauma professionally",
      "core_insight": "Prima's modern design provides restorative space for professional helpers",
      "markdown": "**Sixteen years of child welfare had filled me with stories I couldn't put down.**\n\nEvery case left residue. Foster home emergencies. Abuse investigations. Children's faces in moments no child should experience. I'd developed professional detachment, but detachment isn't the same as processing.\n\nMy supervisor mandated vacation. 'Use your PTO or lose your certification,' she warned. 'You're burning out visibly.'\n\n[Norwegian Prima](/ships/norwegian/norwegian-prima.html) offered what I needed: modern design without accumulated emotional history. A new ship that had witnessed nothing yet.\n\n[Ocean Boulevard](/ships/norwegian/norwegian-prima.html) became my recovery route. Each morning before the ship woke, I'd walk the full promenade, letting the glass walls hold nothing but ocean. No case files. No emergency calls. No children needing rescue.\n\n[Mandara Spa's](/ships/norwegian/norwegian-prima.html) thermal suite provided the silence my brain required. Salt rooms where I could sit without obligation. Steam rooms where thought dissolved. Hours of nothing that slowly refilled what caregiving had emptied.\n\nA spa attendant noticed my daily pattern. 'You help people,' she guessed.\n\n'Children,' I admitted. 'Sixteen years of difficult situations.'\n\n'The ocean holds difficult things,' she said. 'It doesn't judge them. Maybe that's what you need.'\n\n**The lesson:** Prima's newness provides clean space for those carrying heavy professional burdens.",
      "author": {
        "name": "Angela M.",
        "location": "Chicago, IL"
      }
    },
    {
      "title": "The Prima First-Timer's Revelation",
      "persona_label": "First-Time Cruiser",
      "persona": "first-timer",
      "intended_reader": "Cruise skeptics considering modern cruise ships",
      "core_insight": "Prima's innovative design demolishes outdated cruise stereotypes",
      "markdown": "**My cruise prejudices were thirty years out of date.**\n\nMy mental image came from movies and news stories: cramped cabins, mandatory dining times, shuffleboard with seniors. I'd rejected cruise invitations for decades based on assumptions I'd never tested.\n\nMy partner booked [Norwegian Prima](/ships/norwegian/norwegian-prima.html) for my sixtieth birthday. 'Newest ship in the fleet,' he said. 'If you hate modern cruising, you hate cruising. Let's find out.'\n\nI did not hate modern cruising.\n\nThe ship shattered every outdated expectation. [Ocean Boulevard](/ships/norwegian/norwegian-prima.html) wrapped the vessel in outdoor promenade—no cramped corridors, no enclosed spaces. [Indulge Food Hall](/ships/norwegian/norwegian-prima.html) offered eleven cuisines in one venue—no assigned seating, no mandatory dining times.\n\n[The Drop](/ships/norwegian/norwegian-prima.html)—a ten-story freefall slide—existed on a cruise ship. Go-karts existed on a cruise ship. A three-story theater with moving platforms existed on a cruise ship.\n\n'This isn't what I imagined,' I admitted on night two.\n\n'Your imagination was outdated,' my partner said. 'Modern cruising isn't your parents' cruise.'\n\nHe was right. Prima was contemporary, innovative, nothing like the stereotypes I'd accumulated.\n\n**The lesson:** First voyages teach what no brochure can—that cruising is less about the ship and more about who you become aboard her.",
      "author": {
        "name": "Catherine L.",
        "location": "San Diego, CA"
      }
    }
  ]
}