{
  "ship": "Pride of America",
  "ship_class": "America Class",
  "cruise_line": "Norwegian Cruise Line",
  "last_updated": "2026-01-21",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "The Only Way to See Hawaii",
      "persona_label": "Hawaii First-Timer",
      "persona": "hawaii",
      "intended_reader": "Travelers planning their first Hawaii multi-island experience",
      "core_insight": "Pride of America is the only cruise ship that visits four Hawaiian islands without foreign ports",
      "markdown": "**I'd been to Hawaii three times. I'd only seen Oahu.**\n\nFlying between islands seemed complicated. Different hotels every few nights. Repacking. Airport transfers. The logistics defeated me before I started.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) eliminated every obstacle.\n\nThis is the only cruise ship sailing round-trip from Hawaii—no foreign port requirements because she flies the American flag. We unpacked once and visited four islands: Oahu, Maui, the Big Island, and Kauai.\n\nThe first morning, I woke anchored off Maui. The second, I watched lava flows from the Big Island's coast. By day four, Kauai's Na Pali cliffs towered beside the ship.\n\n'Why didn't we do this years ago?' my husband asked, watching sunrise over Kilauea.\n\n'Because I didn't know this ship existed,' I admitted.\n\nPride of America solved the multi-island problem completely. One cabin. One suitcase location. Four islands in seven days without a single airport, rental car, or hotel checkout.\n\n**The truth:** Pride of America is the only way to see multiple Hawaiian islands without logistics. The ship is your floating hotel; Hawaii comes to you.\n\nI've cruised Pride of America four times now. Each voyage reveals new islands, new beaches, new perspectives. Hawaii isn't one destination—it's many. This ship proves it.",
      "author": {
        "name": "Sandra M.",
        "location": "Denver, CO"
      }
    },
    {
      "title": "The Overnight in Kauai Changed Everything",
      "persona_label": "Extended Exploration",
      "persona": "exploration",
      "intended_reader": "Travelers seeking deep destination experiences",
      "core_insight": "Pride of America's overnight stays allow experiences impossible on other cruises",
      "markdown": "**Most cruise ships leave port at 5 PM. Pride of America stayed all night.**\n\nThe overnight in Kauai seemed like a scheduling quirk until I realized what it meant: we could explore after sunset. Dinner on land. Stargazing without ship light pollution. Morning hikes before tourist crowds arrived.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) includes two overnight stays—Maui and Kauai. These aren't port calls; they're immersions.\n\nOn Kauai, we drove to Waimea Canyon for sunset. The reds and oranges intensified as the sun dropped. Other tourists rushed back to hotels; we had nowhere to be. The ship waited in Nawiliwili Harbor, patient as the mountain.\n\nWe ate dinner in a local restaurant, not a tourist trap near the port. We stargazed from Poipu Beach at midnight—no cruise ship lights competing with the Milky Way.\n\nThe next morning, we hiked Sleeping Giant before most tourists woke. The trails belonged to us and a few locals.\n\n'This doesn't feel like cruising,' my wife observed.\n\n'It's not,' I agreed. 'It's living in Hawaii. The ship is just where we sleep.'\n\n**The lesson:** Pride of America's overnights transform cruise tourism into genuine exploration.",
      "author": {
        "name": "Michael T.",
        "location": "Portland, OR"
      }
    },
    {
      "title": "The Widow Found Aloha",
      "persona_label": "Grief Journey",
      "persona": "widow",
      "intended_reader": "Widows seeking healing through meaningful travel",
      "core_insight": "Pride of America's Hawaiian journey offers unique grief processing opportunities",
      "markdown": "**David always said Hawaii would heal anything.**\n\nWe planned to go for our fortieth anniversary. He died six months before. Pancreatic cancer moves faster than airline reservations.\n\nMy daughter bought me a [Pride of America](/ships/norwegian/pride-of-america.html) ticket. 'Mom, you're going to Hawaii. For both of you.'\n\nI didn't want to go alone. I went anyway.\n\nThe Hawaiians understand grief differently. They call it aloha too—love that continues beyond death. The culture welcomes mourning instead of hiding it.\n\nIn Maui, I scattered a small portion of David's ashes at sunrise. The crew had helped me arrange a private beach moment. The ocean accepted him gently, the way he'd always said it would.\n\nIn Kona, I visited a heiau—an ancient Hawaiian temple. The docent noticed my tears and said nothing intrusive. 'The ancestors are listening,' she mentioned quietly. 'They always do.'\n\n'Is that true?' I asked.\n\n'It's true enough,' she answered. 'Grief needs witnesses. Even invisible ones.'\n\n**The truth:** Pride of America's Hawaiian itinerary offers grief processing that Caribbean cruises cannot. The culture embraces loss as part of living.\n\nI cruise Pride of America annually now. David is part of the ocean. I visit him every time.\n\n**The lesson:** Grief needs beautiful places to breathe.",
      "author": {
        "name": "Margaret K.",
        "location": "Sacramento, CA"
      }
    },
    {
      "title": "The Volcano Night Changed My Son",
      "persona_label": "Educational Travel",
      "persona": "family-educational",
      "intended_reader": "Parents seeking meaningful educational experiences for children",
      "core_insight": "Pride of America's Big Island visit provides volcanic education impossible elsewhere",
      "markdown": "**My son thought volcanoes were extinct.**\n\nAt eleven, his understanding of geology came from movies—volcanoes were dramatic disasters or ancient history. Living, active volcanoes seemed fictional.\n\nPride of America changed his education permanently.\n\nWe docked at Hilo, and by evening we'd driven to Hawaii Volcanoes National Park. The caldera glowed red in the darkness. Sulfur steamed from vents we walked past. The ground itself was warm.\n\n'This is happening right now?' he whispered, staring at Kilauea's active crater.\n\n'Right now,' I confirmed. 'The Earth is creating new land while we watch.'\n\nHe stood transfixed for an hour. No phone. No complaints. Just a child confronting geological reality that no textbook could provide.\n\nThe park ranger noticed his intensity and offered extra explanations. Chain of craters. Lava tubes. The fact that the Hawaiian islands themselves were volcano peaks rising from the ocean floor.\n\n'So we're standing on a volcano right now?' he asked.\n\n'You're standing on several,' the ranger said. 'Stacked like pancakes over millions of years.'\n\n**The lesson:** Pride of America's Big Island stop provides educational experiences impossible to replicate.",
      "author": {
        "name": "Robert H.",
        "location": "Phoenix, AZ"
      }
    },
    {
      "title": "The Na Pali Coast Made Me Believe",
      "persona_label": "Natural Wonder",
      "persona": "nature",
      "intended_reader": "Travelers seeking profound natural beauty",
      "core_insight": "Pride of America's Kauai sail-by reveals coastline inaccessible any other way",
      "markdown": "**The Na Pali Coast is unreachable by car.**\n\nNo road crosses those cliffs. Helicopters show you from above. Kayaks take the brave along the water. But watching from a cruise ship—slowly, silently, at eye level with the peaks—offers something neither provides.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) sails past the Na Pali Coast twice: departing and approaching Kauai. The captain announced we'd slow for photography. What he didn't announce was the emotional impact.\n\nThe cliffs rise 4,000 feet directly from the ocean. Green ridges fold into valleys where waterfalls disappear into mist. The scale defeats cameras—nothing I photographed captured what my eyes saw.\n\nI cried. I'm not a person who cries at scenery. But Na Pali broke something—some resistance to beauty that I didn't know I'd been maintaining.\n\n'That's the most beautiful thing I've ever seen,' a passenger beside me said.\n\n'I believe you,' I answered. 'I believe everything now.'\n\nThe slow approach let us absorb rather than glimpse. Fifteen minutes of coastline that felt like testimony. Evidence that nature creates without needing human approval.\n\n**The truth:** Pride of America's Na Pali sail-by delivers one of Earth's great views at the perfect pace. Not too fast to process. Not too close to lose scale.\n\nI position myself on deck for every Na Pali passage now. Some things deserve repeated witness.",
      "author": {
        "name": "Jennifer L.",
        "location": "Austin, TX"
      }
    },
    {
      "title": "The Accessible Hawaii Dream",
      "persona_label": "Mobility Victory",
      "persona": "accessible",
      "intended_reader": "Wheelchair users planning Hawaii vacations",
      "core_insight": "Pride of America makes multi-island Hawaii accessible to wheelchair users",
      "markdown": "**Hawaii by wheelchair seemed impossible.**\n\nFlying between islands with a power chair. Different accessible hotel rooms every few nights. Rental vans that might or might not accommodate my equipment. The logistics exhausted me before I started planning.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) eliminated every obstacle.\n\nOne [accessible cabin](/accessibility.html) for the entire week. My chair stayed safe while I visited four islands without ever navigating an airport or transferring hotels. The ship moved; I didn't have to.\n\nThe accessible excursions exceeded mainland cruise experiences. In Maui, an adapted van took me to Haleakala's summit—10,000 feet above sea level, volcanic crater at my wheels. In Kona, beach wheelchairs let me touch Hawaiian sand for the first time.\n\n'You've done Hawaii accessibility before,' the crew member coordinating my excursions noted. I hadn't. She was just that prepared.\n\nEvery port had options researched in advance. Which beaches had boardwalks. Which tours had lifts. Which experiences welcomed wheels without the awkwardness I'd learned to expect.\n\n**The lesson:** Pride of America makes multi-island Hawaii accessible.",
      "author": {
        "name": "Susan R.",
        "location": "Minneapolis, MN"
      }
    },
    {
      "title": "The Luau Under Stars",
      "persona_label": "Cultural Immersion",
      "persona": "cultural",
      "intended_reader": "Travelers seeking authentic cultural experiences",
      "core_insight": "Pride of America's overnight stays enable authentic Hawaiian cultural experiences",
      "markdown": "**I expected tourist luaus with plastic leis.**\n\nEvery Hawaii brochure showed the same thing: hotel ballrooms, all-you-can-eat buffets, performances designed for cameras. Cultural theater pretending to be culture.\n\n[Pride of America's](/ships/norwegian/pride-of-america.html) overnight in Maui changed everything.\n\nBecause the ship stayed until morning, we could attend Old Lahaina Luau at sunset instead of rushing back. This wasn't hotel entertainment—this was Hawaiian families teaching their culture with obvious pride.\n\nThe imu ceremony—unearthing the pig from underground ovens—felt like genuine tradition, not performance. The dancers told stories their grandparents had learned from their grandparents. When the sun set over Lahaina, the hula continued in torchlight.\n\n'This is different,' my wife whispered during the creation chant.\n\n'This is real,' I agreed. 'The ship staying overnight let us find the real thing.'\n\nWe walked back through Lahaina at midnight, streets quiet, culture still resonating. Day visitors would have been on a dinner shuttle hours ago.\n\n**The truth:** Pride of America's overnight stays unlock authentic Hawaii that day-trippers miss. Evening experiences, sunrise hikes, genuine cultural immersion.\n\nI research evening cultural events for every Pride of America port now. The authentic Hawaii happens after 6 PM. The overnight stays let me find it.",
      "author": {
        "name": "Richard M.",
        "location": "Chicago, IL"
      }
    },
    {
      "title": "The American Crew Made the Difference",
      "persona_label": "Service Excellence",
      "persona": "service",
      "intended_reader": "Travelers who value exceptional service",
      "core_insight": "Pride of America's American crew provides unique service dynamics",
      "markdown": "**The crew spoke my language—literally and culturally.**\n\nAs the only US-flagged cruise ship, [Pride of America](/ships/norwegian/pride-of-america.html) employs American crew. This isn't just a legal requirement; it fundamentally changes the experience.\n\nOur server, Keoni, grew up on the Big Island. When we asked about local restaurants in Kona, he didn't recite tourist recommendations—he told us where his family ate. 'My auntie makes the best loco moco. I'll write down directions.'\n\nWe found his auntie's restaurant. He was right.\n\nThe bartender, Marcus, was from Maui and knew which beaches locals preferred. The cabin steward, Rachel, had suggestions for hiking trails her running group used. They weren't sharing curated information; they were sharing home.\n\n'It's different working a ship that never leaves your islands,' Keoni explained. 'This isn't a job in a foreign country. This is showing people my home.'\n\nThe cultural continuity showed everywhere. Hawaiian phrases woven into announcements. Local knowledge available at every conversation. Pride in place that couldn't be trained—only inherited.\n\n**The lesson:** Pride of America's American crew provides insider access that international crews cannot.",
      "author": {
        "name": "Patricia K.",
        "location": "Boston, MA"
      }
    },
    {
      "title": "The Solo Traveler's Island Hopping",
      "persona_label": "Solo Success",
      "persona": "solo",
      "intended_reader": "Solo travelers intimidated by multi-island Hawaii logistics",
      "core_insight": "Pride of America eliminates solo travel logistics across Hawaiian islands",
      "markdown": "**Island hopping alone terrified me.**\n\nMultiple flights. Rental cars I'd drive solo on unfamiliar roads. Hotels where I'd eat alone every evening. The independence I usually valued felt like isolation when I imagined navigating Hawaii's complexity.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) removed every solo concern.\n\nOne boarding. One cabin. Four islands without a single rental car, inter-island flight, or hotel check-in. The logistics that overwhelmed my planning disappeared.\n\nBut the social benefits surprised me more.\n\nThe ship created community I could enter or avoid. Dining companions when I wanted conversation. Solo tables when I needed quiet. Excursion groups that formed naturally around shared interests.\n\nA retired teacher from Maine became my Big Island volcano buddy. A couple from Toronto joined me for snorkeling in Kauai. By cruise end, I had friends across four islands' worth of experiences.\n\n'I came for solo adventure,' I told my new friends at the farewell dinner.\n\n'You found both,' the teacher observed. 'Solo when you wanted. Companionship when you didn't.'\n\n**The truth:** Pride of America converts solo Hawaii from logistical nightmare to structured adventure. The ship handles complexity; you handle experience.\n\nI cruise Pride of America solo annually now. Hawaii's four islands, one ship, zero loneliness. The balance works.\n\n**The lesson:** Solitude doesn't have to mean isolation.",
      "author": {
        "name": "Catherine B.",
        "location": "Seattle, WA"
      }
    },
    {
      "title": "The Honeymoon We Almost Canceled",
      "persona_label": "Honeymoon Rescue",
      "persona": "honeymoon",
      "intended_reader": "Couples planning Hawaii honeymoons",
      "core_insight": "Pride of America simplifies Hawaii honeymoon logistics completely",
      "markdown": "**Our Hawaii honeymoon planning was destroying us.**\n\nWhich island? All of them sounded perfect. How long on each? Different recommendations everywhere. Resorts, flights, cars, restaurants—the decisions multiplied until our honeymoon planning felt like a second job.\n\n'I don't care anymore,' my fiancée finally said. 'Pick something. Anything.'\n\nI found [Pride of America](/ships/norwegian/pride-of-america.html). One booking. Four islands. Zero additional decisions required.\n\nThe ship solved every argument we'd been having. We saw Maui's beaches AND the Big Island's volcanoes AND Kauai's cliffs AND Oahu's history. No compromise. No choosing one island over another.\n\nThe overnight stays provided honeymoon romance that island-hopping couldn't match. Sunset dinner in Lahaina. Stargazing from Poipu Beach. Mornings without airport anxiety.\n\n'This was brilliant,' she said on night three, watching lava glow from our balcony.\n\n'This was desperate,' I admitted. 'I was about to book a cruise ship because I couldn't make any more decisions.'\n\n'Sometimes desperate is brilliant,' she answered. 'We're seeing everything. That was my dream.'\n\n**The truth:** Pride of America rescues indecisive honeymoon planning. See all four major islands without choosing between them.\n\nWe cruise Pride of America for anniversaries now. Same logic applies: why choose when you can have everything?\n\n**The lesson:** The best honeymoon teaches partnership through both joy and challenge.",
      "author": {
        "name": "Jason and Emily R.",
        "location": "San Diego, CA"
      }
    },
    {
      "title": "The Birthday That Demanded Hawaii",
      "persona_label": "Milestone Celebration",
      "persona": "special-occasion",
      "intended_reader": "Those marking significant birthdays with meaningful travel",
      "core_insight": "Pride of America provides scale that matches major birthday milestones",
      "markdown": "**Sixty deserved more than a party.**\n\nSix decades of living required acknowledgment that dinner reservations couldn't provide. My children agreed, booking [Pride of America](/ships/norwegian/pride-of-america.html) before I could refuse.\n\n'Four islands for sixty years,' my daughter explained. 'One island per fifteen years of your life.'\n\nThe logic was ridiculous. The execution was perfect.\n\nEach island became a reflection point. Maui for my twenties—adventurous, full of possibility. Big Island for my thirties—volcanic, transformative. Kauai for my forties—mature beauty. Oahu for recent decades—complex, layered, still revealing.\n\nThe crew discovered my birthday. Champagne appeared at every port. The captain mentioned milestone celebrations. Fellow passengers who'd never meet me again raised glasses to my six decades.\n\n'I feel celebrated,' I admitted on the final evening.\n\n'You should,' my son answered. 'Sixty years is worth celebrating. Hawaii helped us do it properly.'\n\n**The lesson:** Pride of America provides scale for birthdays that deserve more than parties.",
      "author": {
        "name": "Susan R.",
        "location": "Phoenix, AZ"
      }
    },
    {
      "title": "The Hospice Chaplain Found Aloha",
      "persona_label": "Caregiver Recovery",
      "persona": "healing",
      "intended_reader": "Hospice workers, chaplains, or anyone carrying professional grief",
      "core_insight": "Hawaii's healing culture provides unique restoration for death-adjacent professionals",
      "markdown": "**Fifteen years of deathbeds had accumulated in my soul.**\n\nAs a hospice chaplain, I'd held hundreds of dying hands. Spoken thousands of final prayers. Comforted families in their worst moments. The sacred work had become sacred exhaustion.\n\nMy supervisor noticed before I did. 'Hawaii,' he prescribed. 'The Hawaiians understand death differently. Let them teach you.'\n\n[Pride of America](/ships/norwegian/pride-of-america.html) carried me to that teaching.\n\nThe Hawaiian concept of death isn't ending—it's transition. Ancestors remain present. Grief becomes gratitude. The culture that had invented aloha understood something Western theology had missed.\n\nIn Kauai, I visited an ancient heiau. The docent noticed my clerical collar and my tears. 'You carry many spirits,' she observed.\n\n'Hundreds,' I admitted.\n\n'They're not heavy here,' she said. 'In Hawaii, spirits are welcome. They don't weigh as much.'\n\nI cried at that temple. Not sad tears exactly—release tears. Permission to honor the dying I'd accompanied without carrying them forever.\n\n**The lesson:** Pride of America connects caregivers to Hawaiian healing traditions.",
      "author": {
        "name": "Rev. Thomas H.",
        "location": "Seattle, WA"
      }
    },
    {
      "title": "The Hawaii First-Timer's Four-Island Revelation",
      "persona_label": "First-Time Cruiser",
      "persona": "first-timer",
      "intended_reader": "Cruise skeptics or Hawaii first-timers",
      "core_insight": "Pride of America provides the only comprehensive Hawaii experience available",
      "markdown": "**I'd visited Hawaii three times. I'd only seen Oahu.**\n\nFlying between islands seemed complicated. Different hotels, different cars, different logistics every few days. I'd resigned myself to knowing only one island.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) changed that calculation completely.\n\nOne boarding. Four islands. No inter-island flights, rental cars, or hotel checkouts. The logistics that had defeated me for years simply disappeared.\n\nMaui surprised me—I'd imagined it similar to Oahu but found something entirely different. The Big Island stunned me—active volcanoes I'd only seen in documentaries. Kauai broke my heart—Na Pali cliffs that justified every photograph I'd dismissed.\n\n'Why didn't I know this existed?' I asked my wife on the final evening.\n\n'Because you thought you knew Hawaii,' she answered. 'Oahu isn't Hawaii. It's one Hawaii. Pride of America showed you four.'\n\n**The lesson:** First voyages teach what no brochure can—that cruising is less about the ship and more about who you become aboard her.",
      "author": {
        "name": "Michael R.",
        "location": "Denver, CO"
      }
    },
    {
      "title": "My Father's Hawaii at 84",
      "persona_label": "Elder Achievement",
      "persona": "elderly",
      "intended_reader": "Elderly travelers or families planning Hawaii trips for older relatives",
      "core_insight": "Pride of America eliminates barriers that prevent elderly travelers from seeing multiple islands",
      "markdown": "**At eighty-four, Dad had stopped believing Hawaii was possible.**\n\nFlying exhausted him. Hotel changes confused him. The multi-island trip he'd dreamed about since watching documentaries seemed permanently out of reach.\n\nThen I explained [Pride of America](/ships/norwegian/pride-of-america.html). One cabin. Four islands. No inter-island flights.\n\n'You mean I don't have to fly between islands?' he asked.\n\n'The ship does the traveling,' I confirmed. 'You just enjoy Hawaii.'\n\nThe [accessible cabin](/accessibility.html) accommodated his walker and his dignity. But the real gift was simplicity. One bed for the whole trip. One bathroom to learn. One routine that didn't change island to island.\n\nAt the Na Pali Coast, watching cliffs he'd only imagined, he cried. 'I never thought I'd see this,' he said. 'I thought I'd missed my chance.'\n\n'You almost did,' I admitted. 'But Pride of America made it possible.'\n\n**The lesson:** Pride of America enables elderly travelers to achieve multi-island Hawaii dreams.",
      "author": {
        "name": "Patricia D.",
        "location": "Sacramento, CA"
      }
    },
    {
      "title": "The Marine Found Aloha",
      "persona_label": "Veteran Healing",
      "persona": "veteran",
      "intended_reader": "Veterans seeking meaningful Hawaii travel experiences",
      "core_insight": "Pride of America connects veterans to Hawaii's healing traditions",
      "markdown": "**Hawaii meant Pearl Harbor memorial. Nothing more.**\n\nTwenty years in the Marines had left me with hypervigilance that couldn't shut off. Hawaii was duty—paying respects at the Arizona Memorial, honoring sacrifice, maintaining the particular tension of military memory.\n\nMy wife suggested [Pride of America](/ships/norwegian/pride-of-america.html) might offer different Hawaii.\n\nShe was right about different Hawaii.\n\nThe Arizona Memorial mattered. I went. I paid respects. But Kauai offered something else—healing I hadn't known I needed.\n\nAt an ancient heiau, a Hawaiian elder noticed my military bearing. 'Warrior,' he said. Not a question.\n\n'Marine,' I confirmed.\n\n'Hawaiian warriors had healing rituals,' he explained. 'The water cleanses. The land grounds. Aloha isn't just greeting—it's restoration.'\n\nI floated in Kauai waters that afternoon. Let the ocean hold me without assessment, without vigilance, without the military tension I'd carried for decades.\n\n'You're breathing differently,' my wife noticed.\n\n'Aloha,' I answered. 'I think I finally understand what it means.'\n\n**The lesson:** Pride of America connects veterans to Hawaiian healing beyond memorials.",
      "author": {
        "name": "Gunnery Sergeant (Ret.) James R.",
        "location": "San Diego, CA"
      }
    },
    {
      "title": "Four Islands, Three Generations",
      "persona_label": "Family Connection",
      "persona": "family",
      "intended_reader": "Families planning multi-generational Hawaii trips",
      "core_insight": "Pride of America unites multi-generational families around shared Hawaiian wonder",
      "markdown": "**Three generations had never vacationed together successfully.**\n\nDifferent schedules. Different budgets. Different tolerances for logistics. Previous family trips had collapsed under coordination challenges.\n\n[Pride of America](/ships/norwegian/pride-of-america.html) solved every obstacle.\n\nOne ship. Four islands. Zero logistics for anyone to manage. Grandparents in accessible cabins. Parents in balcony rooms. Kids running between generations freely.\n\nHawaii provided what artificial destinations couldn't: shared wonder that transcended age.\n\nAt Kilauea, three generations stared into an active volcano. At Na Pali, three generations photographed the same impossible cliffs. At every island, we reunited around beauty that interested everyone.\n\n'This actually worked,' my mother observed on the final evening.\n\n'Because Hawaii worked,' I explained. 'And the ship handled logistics nobody had to manage.'\n\nGrandparents, parents, and grandchildren had finally shared a vacation. The ship made it possible. Hawaii made it meaningful.\n\n**The lesson:** Pride of America enables multi-generational Hawaiian experiences through simplicity.",
      "author": {
        "name": "Jennifer and Mark L.",
        "location": "Portland, OR"
      }
    }
  ]
}