{
  "ship": "Celebrity Apex",
  "ship_class": "",
  "cruise_line": "Celebrity Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "T80KXmCgeJ4",
        "provider": "youtube",
        "title": "Celebrity Apex Full Walkthrough Ship Tour & Review 4K | All Spaces Toured & Explained!",
        "description": "Join Danny on a full walkthrough tour of the brand new Celebrity APEX! From the design, to the amazing restaurants, this ship is an incredible addition to the Celebrity fleet. The addition of the Magi"
      },
      {
        "videoId": "c97xQ4r0F6E",
        "provider": "youtube",
        "title": "Deluxe Ocean View Stateroom (Forward Facing) | Celebrity Apex Full Walkthrough Tour & Review 4K",
        "description": "Join Danny on a full walkthrough tour of a Deluxe Ocean View Stateroom aboard the brand new Celebrity Apex. These great forward facing options on the Edge Series are substantially larger than other cr"
      },
      {
        "videoId": "0AJdIuVF-3w",
        "provider": "youtube",
        "title": "Deluxe Porthole View with Veranda | Celebrity Apex Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of a Deluxe Porthole Veranda aboard the brand new Celebrity Apex. Positioned near the front of the ship, these hidden corner rooms have a more traditional balcony"
      },
      {
        "videoId": "T-ZyY73nJyQ",
        "provider": "youtube",
        "title": "Edge Stateroom With Infinite Veranda | Celebrity Apex Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of an Edge Stateroom with Infinite Veranda aboard the brand new Celebrity Apex. These brand new revolutionary designs provide more space, and give you access to t"
      },
      {
        "videoId": "0j9TYWkiGOE",
        "provider": "youtube",
        "title": "Inside Stateroom | Celebrity Apex Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of an Inside Stateroom aboard the Celebrity Apex. These more affordable Inside accommodations provide a comfortable area to unwind after an exciting day aboard or"
      },
      {
        "videoId": "3-kSdrIGLf8",
        "provider": "youtube",
        "title": "Ocean View Stateroom | Celebrity Apex Full Walkthrough Tour & Review 4K | Retreat 2021",
        "description": "Join Danny on a full walkthrough tour of an Ocean View Stateroom aboard the Celebrity Edge. These Ocean View Staterooms provide a good balance of value but still with those lower views out the side of"
      },
      {
        "videoId": "pFyCXbtb0mc",
        "provider": "youtube",
        "title": "Panoramic Ocean View Stateroom | Celebrity Apex Full Walkthrough Tour & Review 4K | Retreat 2021",
        "description": "Join Danny on a full walkthrough tour of a Panoramic Ocean View Stateroom aboard the Celebrity Apex. These Ocean View Staterooms provide a good balance of value but still with those amazing views out "
      }
    ]
  }
}