{
  "ship": "Celebrity Solstice",
  "ship_class": "",
  "cruise_line": "Celebrity Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "XAnuPCWpayI",
        "provider": "youtube",
        "title": "Celebrity Solstice | Accessible Sky Suite | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of an Accessible Sky Suite aboard the Celebrity Solstice. With additional accessible features throughout the room, and the suite class experience these are such a"
      },
      {
        "videoId": "y3oQkGhJUVA",
        "provider": "youtube",
        "title": "Celebrity Solstice | Aft Aquaclass Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of an Aft AquaClass Stateroom aboard the Celebrity Solstice. These are some of our favorite mid-tier room on the Solstice. The added Aquaclass amenities are a fan"
      },
      {
        "videoId": "mQgOyU_JquQ",
        "provider": "youtube",
        "title": "Celebrity Solstice | Celebrity Suite | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Celebrity Suite aboard the Celebrity Solstice. These larger suites feature a separated living room and master bedroom. Situated in prime areas around the shi"
      },
      {
        "videoId": "3LI0iedR9l4",
        "provider": "youtube",
        "title": "Celebrity Solstice | Concierge Class Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Concierge Class Stateroom aboard the Celebrity Solstice. With the same footprint as a standard balcony, and set in premium locations these Concierge Class St"
      },
      {
        "videoId": "1Hvmt_Pkr7g",
        "provider": "youtube",
        "title": "Celebrity Solstice | Corner Sky Suite | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Corner Sky Suite aboard the Celebrity Solstice. With their unique corner-aft location, these are a perfect suite for someone who wants all of the Retreat ben"
      },
      {
        "videoId": "BQDd5AN0nLA",
        "provider": "youtube",
        "title": "Celebrity Solstice | Full Walkthrough Ship Tour & Review 4K | Celebrity Cruises",
        "description": "Join Danny and Taylor as they tour through the Celebrity Solstice. This marvelous ship has more space and more luxury than ever before. With all the beautiful decor, accommodations, and design this sh"
      },
      {
        "videoId": "2MDMp0o4mlA",
        "provider": "youtube",
        "title": "Celebrity Solstice | Inside Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of Inside Stateroom aboard the Celebrity Solstice. This is the entry level category on the Solstice. If cost is your biggest factor these are going to be the lowe"
      },
      {
        "videoId": "nVcMwveWCDQ",
        "provider": "youtube",
        "title": "Celebrity Solstice | Ocean View Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of an Ocean View Stateroom aboard the Celebrity Solstice. These are a great option to upgrade to from an Inside Stateroom. The combination of value, space, and vi"
      },
      {
        "videoId": "F-UKKLdZGEc",
        "provider": "youtube",
        "title": "Celebrity Solstice | Sunset Concierge Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Sunset Concierge Stateroom aboard the Celebrity Solstice. Everyone knows, these are Danny's favorite! They have the same layout inside as a standard Veranda "
      },
      {
        "videoId": "dnOoJH88Vr8",
        "provider": "youtube",
        "title": "Celebrity Solstice | Sunset Veranda Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Sunset Veranda Stateroom aboard the Celebrity Solstice. Everyone knows, these are Danny's favorite! They have the same layout inside as a standard Veranda bu"
      },
      {
        "videoId": "j1m-OycBsoU",
        "provider": "youtube",
        "title": "Celebrity Solstice | Ultra Deluxe Veranda Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Ultra Deluxe Veranda aboard the Celebrity Solstice. These are by far the largest stateroom with a veranda - plenty of room for you and the family! Ready to b"
      },
      {
        "videoId": "8tZpcr6kcRs",
        "provider": "youtube",
        "title": "Celebrity Solstice | Veranda Stateroom | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny on a full walkthrough tour of a Veranda Stateroom aboard the Celebrity Solstice. In this video Danny will show you everything you need to know about this Veranda Stateroom. Providing that i"
      }
    ]
  }
}