{
  "ship": "Celebrity Edge",
  "ship_class": "",
  "cruise_line": "Celebrity Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "D0z40ZJ-K30",
        "provider": "youtube",
        "title": "Accessible Edge Stateroom With Infinite Veranda | Celebrity Edge Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of an Accessible Veranda aboard the Celebrity Edge. Celebrity has done an amazing job making the Edge an incredibly accessible ship. From shows, to bars, restaura"
      },
      {
        "videoId": "2GYphKyoDac",
        "provider": "youtube",
        "title": "Celebrity Edge Full Walkthrough Ship Tour & Review 4K | All Spaces Toured & Explained!",
        "description": "Join Danny on a full walkthrough tour of the beautiful Celebrity Edge. From the design, to the amazing restaurants, this ship is an incredible addition to the Celebrity fleet. The addition of the Magi"
      },
      {
        "videoId": "IjLLGuOL1YU",
        "provider": "youtube",
        "title": "Concierge Class Stateroom | Celebrity Edge Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of Concierge Class Stateroom aboard the Celebrity Edge. This upgraded category has the same layout as the Edge Stateroom With Infinity Veranda but with added amen"
      },
      {
        "videoId": "J5dqQH3NZCA",
        "provider": "youtube",
        "title": "Deluxe Ocean View Stateroom (Forward Facing) | Celebrity Edge Full Walkthrough Tour & Review 4K",
        "description": "Join Danny on a full walkthrough tour of a Deluxe Ocean View Stateroom aboard the Celebrity Edge. These forward facing rooms offer great views out the front of the ship, and trade balcony space for mo"
      },
      {
        "videoId": "7naAQNtbFDs",
        "provider": "youtube",
        "title": "Deluxe Porthole View with Veranda | Celebrity Edge Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of a Deluxe Porthole Veranda aboard the Celebrity Edge. Positioned near the front of the ship, these hidden corner rooms have a more traditional balcony experienc"
      },
      {
        "videoId": "bgmY_oyeTLI",
        "provider": "youtube",
        "title": "Edge Stateroom With Infinite Veranda | Celebrity Edge Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of an Edge Stateroom with Infinite Veranda aboard the Celebrity Edge. These brand new revolutionary designs provide more space, and give you access to the ocean i"
      },
      {
        "videoId": "rr-xoBPHEv4",
        "provider": "youtube",
        "title": "Inside Stateroom | Celebrity Edge Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of an Inside Stateroom aboard the Celebrity Edge. These more affordable Inside accommodations provide a comfortable area to unwind after an exciting day aboard or"
      },
      {
        "videoId": "AovoJLUJkWs",
        "provider": "youtube",
        "title": "Panoramic Ocean View Stateroom | Celebrity Edge Full Walkthrough Tour & Review 4K | Retreat 2021",
        "description": "Join Danny on a full walkthrough tour of a Panoramic Ocean View Stateroom aboard the Celebrity Edge. These Ocean View Staterooms provide a good balance of value but still with those amazing views out "
      },
      {
        "videoId": "4c4lb-PuBrc",
        "provider": "youtube",
        "title": "Sunset Veranda Stateroom | Celebrity Edge Full Walkthrough Tour & Review 4K | 2021",
        "description": "Join Danny on a full walkthrough tour of a Sunset Veranda Stateroom aboard the Celebrity Edge. These aft-facing staterooms are perfect for those who want a more traditional veranda experience and thos"
      }
    ]
  }
}