{
  "title": "File:Abel Janszoon Tasman (11313033535).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/5/54/Abel_Janszoon_Tasman_%2811313033535%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/5/54/Abel_Janszoon_Tasman_%2811313033535%29.jpg",
  "license": "CC BY-SA 2.0",
  "license_url": "https://creativecommons.org/licenses/by-sa/2.0",
  "author": "<a rel=\"nofollow\" class=\"external text\" href=\"https://www.flickr.com/people/35759981@N08\">Archives New Zealand</a> from New Zealand",
  "description": "On 18 December 1642, Abel Janszoon Tasman anchored his two ships near Wainui in Mohua (Golden Bay), the first European visitor to visit Aotearoa New Zealand.\n<p>Tasman had sighted land on the 13th, and upon assuming  that it was connected to an island at the southern tip of South America, named it Staten Landt. Proceeding north, and then east, Tasman came to present day Golden Bay, where he anchored his two ships. One of the ships was attacked by Ngati Tumatakokiri Maori. Four of Tasman's men, and several Maori were killed in the altercation. Tasman named the bay Murderers Bay, and sailed north, mistaking Cook Strait for a bight, naming it Zeehaen's Bight. Two names Tasman gave to New Zealand landmarks still endure - Cape Maria van Diemen, and Three Kings Island. Tasman is also responsible for the name New Zealand (Nieuw Zeeland).\n</p><p>Tasman was a Dutch seafarer, explorer and merchant, best known for his voyages of 1642 and 1644 in the service of the Vereenigde Oost-Indische Compagnie (United East India Company). As well as being the first known European to visit New Zealand, he also the first to reach Van Diemen's Land (Tasmania), and to sight the Fijian islands. His navigator François Visscher, and his merchant Isaack Gilsemans, mapped substantial portions of Australia, New Zealand and some Pacific Islands. \n</p><p>Archives reference:  AAQT  6539    32 /   A1111   R21010205\n</p><p>For updates on our On This Day series and news from Archives New Zealand, follow us on Twitter <a rel=\"nofollow\" class=\"external text\" href=\"https://twitter.com/ArchivesNZ\">www.twitter.com/ArchivesNZ</a>  \n</p>\nMaterial from Archives New Zealand",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AAbel%20Janszoon%20Tasman%20%2811313033535%29.jpg"
}