{
  "title": "File:ISS-30 Perito Moreno Glacier near Lake Argentino, Argentina.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e9/ISS-30_Perito_Moreno_Glacier_near_Lake_Argentino%2C_Argentina.jpg/1280px-ISS-30_Perito_Moreno_Glacier_near_Lake_Argentino%2C_Argentina.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/e/e9/ISS-30_Perito_Moreno_Glacier_near_Lake_Argentino%2C_Argentina.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "NASA",
  "description": "Perito Moreno Glacier near Lake Argentino, Argentina is featured in this image photographed by an Expedition 30 crew member on the International Space Station.\n<ul><li>The largest glacier tongue in this image is known as the Perito Moreno Glacier (center). It descends from the Southern Patagonian Icefield (top) at great altitudes (greater than 2,100 meters, 6,825 feet) in the southern Andes Mountains, down into the water and warmer altitudes of Lake Argentino at approximately 180 meters above sea level.</li>\n<li>The glacier is 30 kilometers long (image width represents approximately 60 kilometers on the ground). Perito Moreno is one of the largest glaciers in Patagonia, and is perhaps the most famous for the fact that it periodically cuts off the major southern arm (known as Brazo Rico) of Lake Argentino completely from the rest of the lake. This is because the glacier advances right across the lake until it meets the opposite shoreline.</li>\n<li>The ice tongue is \"grounded\" (meaning that it is not floating, as occurs at the termini of glaciers and ice shelves where they enter the sea), thus forming a natural dam which prevents the lake water on either side from circulating, which in turn causes muddier, \"milkier\" water to concentrate in Brazo Rico. Sub-ice water, flows under the ice, not only carrying the mud into the lake but also helping lubricate the glacier's downhill movement.</li>\n<li>Because of its effect as a dam, meltwater from the south raises water levels in Brazo Rico by as much as 30 meters above the level of the water in Lago Argentino. The great pressure of this higher water ultimately causes the ice tongue to rupture catastrophically, in a great natural spectacle. The last rupture took place in March 2012.</li>\n<li>The process then repeats, on average every four to five years, as the glacier starts to grow back towards the opposite shoreline. The repeatability of the rupture has contributed to the event becoming a major tourist attraction in the region.</li></ul>",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AISS-30%20Perito%20Moreno%20Glacier%20near%20Lake%20Argentino%2C%20Argentina.jpg"
}