{
  "title": "File:Juneau from the water, September 30, 1916 (AL+CA 341).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/a/af/Juneau_from_the_water%2C_September_30%2C_1916_%28AL%2BCA_341%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/a/af/Juneau_from_the_water%2C_September_30%2C_1916_%28AL%2BCA_341%29.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "Peter Buhl",
  "description": "<p>On verso of image:  Juneau, Alaska, Sept. 30, 1916.  By Peter Buhl\nFiled in Alaska--Cities--Juneau</p>\n<p>Located on the mainland of Southeast Alaska, Juneau was built at the heart of the Inside Passage along the Gastineau Channel. The area was a fish camp for the indigenous Tlingit Indians. In 1880, nearly 20 years before the gold rushes to the Klondike and Nome, Joe Juneau and Richard Harris were led to Gold Creek by Chief Kowee of the Auk Tribe. They found mother lode deposits upstream, staked their mining claims, and developed a 160 acre incorporated city they called Harrisburg, which brought many prospectors to the area. The City of Juneau was formed in 1900. The state capital was transferred from Sitka to Juneau in 1906 while Alaska was a U.S. Territory. The Treadwell and Ready Bullion mines across the channel on Douglas Island became world-scale mines, operating from 1882 to 1917. In 1916, the Alaska-Juneau gold mine was built on the mainland, and became the largest operation of its kind in the world. In 1917, a cave-in and flood closed the Treadwell mine on Douglas. It produced $66 million in gold in its 35 years of operation. Fishing, canneries, transportation and trading services, and a sawmill contributed to Juneau's growth through the early 1900s.  A federally recognized tribe is located in the community -- the Central Council Tlingit &amp; Haida Indian Tribes of Alaska; Douglas Indian Association; Aukquan Traditional Council (not recognized). Juneau has a Tlingit history with a strong historical influence from the early prospectors and boom town that grew around full-scale gold mining operations. \n\nPeter Buhl was born ca. 1893 in Denmark and came to the United States in 1914.  In 1920, he was living at Kennicott, working as a laborer in a leading plant. [Source: 1920 U.S. Census</p>\n<ul><li>Subjects (LCTGM): Harbors--Alaska--Juneau; Waterfronts--Alaska--Juneau; Piers &amp; wharves--Alaska--Juneau</li>\n<li>Subjects (LCSH): Juneau (Alaska)--Buildings, structures, etc.</li></ul>",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AJuneau%20from%20the%20water%2C%20September%2030%2C%201916%20%28AL%2BCA%20341%29.jpg"
}