{
  "version": "v2.256",
  "ship_name": "Radiance of the Seas",
  "cruise_line": "Royal Caribbean",
  "personas": [
    {
      "id": "p1-harper",
      "persona_label": "A solo teacher learning to walk again—literally and figuratively. Her week aboard Radiance of the Seas becomes an unexpected lesson in healing and grace.",
      "title": "Harper’s Northbound Journey: Learning to Walk Again on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed *Radiance of the Seas*. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nWhen I stepped aboard in Vancouver, the cast boot around my ankle drew more attention than my smile. I’d sprained it three months earlier—nothing heroic, just a tumble on the school steps after chasing a seventh-grader who’d forgotten his trombone. But for a woman who lives by the bell schedule, being forced to slow down felt like punishment. The crew didn’t see it that way. From the first greeting—“Welcome home, Miss Harper”—to the way the stateroom attendant quietly left an extra ice pack in my mini-fridge, I was reminded that kindness moves faster than pain. One barista learned my order (“half-sweet mocha, extra patience”) by day two. The ship itself seemed to conspire in my healing.\n\n## Embarkation & Disembarkation\nBoarding at Canada Place was smoother than my own stride. The pier staff guided me to the accessibility lane, and within twenty minutes I was leaning on the rail, watching seaplanes lift off like prayers over the harbor. Disembarkation in Seward a week later felt harder—not physically, but emotionally. There’s something about the final morning at sea, the slow rotation of the ship into the fjord light, that makes you realize the horizon was never the point. It was learning to look up again.\n\n## The Real Talk\nNot every moment was picture-perfect. There were times I caught my reflection in the elevator mirror and hated the limp. The jogging track mocked me. And yes, sometimes the Wi-Fi vanished like motivation on a Monday. But one evening near Hubbard Glacier, I sat alone on Deck 12 as the captain swung us broadside to the ice. The ship fell utterly silent—no announcements, no chatter—just the groan of ancient ice cracking open. A stranger, maybe late sixties, eased into the chair beside me. He didn’t offer a drink; he offered a story. Thirty years married, first cruise since his wife’s chemo ended. He said, “You never realize how loud healing is until you hear it echo.” We sat there in shared quiet until a chunk of ice calved and thundered into the sea. For the first time in months, I didn’t wince at the sound of breaking. I whispered, mostly to myself, “This is what grace sounds like.”\n\n## Accessibility on the Seas\nRadiance is one of the easier ships I’ve navigated—wide corridors, elevators at every turn, and crew who don’t treat accessibility like charity. The spa arranged a short-duration massage suited for limited mobility. Even tender ports like Icy Strait Point were managed with thoughtful ramps and steady hands. My favorite detail? Crew members never hovered—they simply appeared when needed, like well-timed commas in a long sentence.\n\n## A Female Crewmate’s Perspective\nOn day four, a housekeeper named Lila found me sketching glaciers in the Solarium. She sat down on break and said, “We all come to sea for something. Some to run, some to rest.” She told me she sends most of her paycheck home to Cebu and hasn’t seen her children in two years. Then she smiled: “But I still get to watch people heal.” There was no sermon in her words, yet I felt one forming in my chest. Grace again—steady, unspectacular, holy.\n\n## Closing Thoughts\nBy the time we reached Seward, I no longer cared how fast I walked. I cared that I could stand on my own deck and breathe without rushing the view. Radiance didn’t cure me; it recalibrated me. It taught me that healing isn’t about getting back to normal—it’s about finding beauty in the limp. If you see a woman on the next sailing, camera in one hand and a slow step in the other, say hello. I might just tell you what grace sounds like in glacier light.",
      "nav_port": {
        "target_persona_id": "p2-mateo",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p2-mateo",
        "label": "Port: a dad’s Tampa escape where small wins added up to big rest."
      },
      "nav_starboard": {
        "target_persona_id": "p3-nora",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p3-nora",
        "label": "Starboard: southbound glaciers and a promise kept to Mom."
      }
    },
  {
      "id": "p2-mateo",
      "persona_label": "A single father from Tampa learning that rest can be redemptive, not earned. His five-night sailing on Radiance became a quiet turning point.",
      "title": "Mateo’s Gulf Escape: Finding Still Waters on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed *Radiance of the Seas*. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nI boarded Radiance in Tampa with more tension than luggage. Divorce papers finalized six months earlier, two kids back home with my sister, and a silence in my life I didn’t know how to fill. The crew seemed to notice without asking. My stateroom attendant, Dinesh, greeted me with a grin and a simple line: “You look like a man who needs the sea.” Each day he left a towel animal holding a note—quotes about rest, hope, and patience. By the third day, I started looking forward to them more than breakfast. At the bar, Eleni from Thessaloniki replaced my first order of whiskey with pineapple juice and winked: “Start soft, sir. You’ll taste more of life that way.” Somehow, she was right.\n\n## Embarkation & Disembarkation\nTampa’s morning air was thick as memory when we sailed for Cozumel and Costa Maya—five nights in March 2025, a short loop through the Gulf. Boarding took less than half an hour, but emotionally it felt longer, like stepping out of the past one footprint at a time. Disembarkation was the opposite: too quick. When the port came back into view, I realized I wasn’t returning to the same shore I’d left.\n\n## The Real Talk\nDay two hit hard. Families surrounded me—matching shirts, inside jokes, small hands gripping soft-serve cones. Mine weren’t there. I almost retreated to my cabin, but a trivia host roped me into a team called “The Unsinkables.” We lost every round, but laughter filled the space that loneliness had carved out. On night four, the captain slowed us off Mexico’s coast for an at-sea stargazing event. I found myself beside an older couple celebrating fifty years married. The wife turned to me and said, “You know, son, healing doesn’t happen on calendars—it happens on waves.” Her words landed heavier than the warm night air. I watched her lean her head on her husband’s shoulder, and for the first time, I prayed—not for my marriage to come back, but for peace to stay.\n\n## Accessibility on the Seas\nRadiance might be one of Royal’s smaller ships, but she’s big on compassion. I saw it in crew offering an arm to a man with a cane on the gangway, in the staff quietly clearing space for a wheelchair at trivia, in how the elevators never felt like an afterthought. Accessibility here isn’t just physical—it’s emotional. There’s room to breathe, to walk slowly, to be seen without being explained.\n\n## A Female Crewmate’s Perspective\nMid-voyage, I found Eleni again at the Schooner Bar. She told me she’d been at sea nine years, sending money home for her mother’s dialysis. “The ocean gives, but it also takes,” she said, stirring soda water with a straw. “Our job is to keep giving anyway.” I asked how she stayed hopeful. She smiled, tapping the counter: “Because every sunrise out here feels like a second chance.” I realized then that the ship’s glow at night wasn’t just lighting the waves—it was reflecting off people like her.\n\n## Closing Thoughts\nWhen we docked back in Tampa, I didn’t rush off. I stood on Deck 12 until the last passenger left, breathing in the salt like I was learning to live again. Radiance didn’t erase my losses; she reframed them. She taught me that calm isn’t something you wait for—it’s something you choose, moment by moment. If you ever spot a dad standing alone at sunrise with coffee in one hand and gratitude in the other, that’s probably me, whispering thanks for a ship that taught me how to rest again."
        "target_persona_id": "p1-harper",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p1-harper",
        "label": "Port: a solo teacher who found rest in the northern light."
      },
      "nav_starboard": {
        "target_persona_id": "p4-desmond",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p4-desmond",
        "label": "Starboard: Vancouver sailaway to Seward with a camera and a prayer."
      }
    },
    {
      "id": "p3-nora",
      "persona_label": "Daughter keeping a promise. Southbound Alaska, gentle pacing, and the courage to let wonder land.",
      "title": "Southbound for Mom: Radiance of the Seas and the Long Look Back",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nWe chose **southbound Alaska** in **September 2024** (Seward → Vancouver): **Hubbard Glacier**, **Skagway**, **Juneau**, **Icy Strait Point**, **Ketchikan**, then the quiet slide home through the **Inside Passage**. It was Mom’s dream; mine was to keep up.\n\n## The Rhythm We Needed\nRadiance’s **solarium** felt built for tenderness: warm air, soft light, crew who lowered their voices without being asked. In **Skagway**, we did the **White Pass** train—she pressed her palm to the glass at the trestle and whispered, “Imagine building that.” In **Juneau**, we watched a whale sound and vanish like a shared secret.\n\n## Dining & Ease\nWe alternated **Main Dining** with **Chops Grille** (she called the filet “Sunday best”). Elevators were close, theater aisles forgiving. I pushed the pace only once and learned my lesson.\n\n## Tear-Tug\nAt **Ketchikan**, rain stitched the docks into a watercolor. Mom slipped her arm into mine and said, “Your dad would have teased this weather and loved it anyway.” We laughed and stood there in it. A crew member handed us towels with a grin like family.\n\n## Practical Links\n• **Search southbound sailings** → https://www.royalcaribbean.com/cruise-search  \n• **Specialty dining** → https://www.royalcaribbean.com/experience/cruise-dining/specialty-restaurants  \n• **Packing: rain-ready** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p5-lianna",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p5-lianna",
        "label": "Port: just-married and glacier-struck."
      },
      "nav_starboard": {
        "target_persona_id": "p1-harper",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p1-harper",
        "label": "Starboard: a teacher’s northbound quiet."
      }
    },
    {
      "id": "p4-desmond",
      "persona_label": "Photographer with a tiny budget and a big lens. Northbound one-way and faith like a quiet hum.",
      "title": "Frames of Grace: Vancouver to Seward with a Camera on Radiance",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nI grabbed a shoulder-season **northbound** in **early June 2024** (Vancouver → Seward), praying for whales and workable Wi-Fi. The ship felt like a greenhouse set to awe—glass everywhere, mountains everywhere else.\n\n## The Hunt\nAt **Icy Strait Point**, I learned patience is half the shot: five minutes watching water, then the sudden breath and plume. **Hubbard Glacier** calved like a drumline. Onboard, the **Viking Crown Lounge** made a perfect editing bay between sunlight and sockets.\n\n## Food & Frugal\n**Windjammer** breakfasts, **Main Dining** dinners; I splurged once at **Giovanni’s** and lingered too long over espresso. Crew slipped me ship-side ginger tea when I looked green returning from a skiff—love them for that.\n\n## Tear-Tug\nA woman on deck asked if I ever put the camera down. I said I try. We watched a seal ride a floe like a couch and I didn’t take the shot. It was better that way.\n\n## Practical Links\n• **Search one-way sailings** → https://www.royalcaribbean.com/cruise-search  \n• **Drink packages** → https://www.cruisinginthewake.com/drink-packages.html  \n• **Packing: camera + cold** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p6-owen",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p6-owen",
        "label": "Port: buddy trip from Tampa that healed more than we planned."
      },
      "nav_starboard": {
        "target_persona_id": "p3-nora",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p3-nora",
        "label": "Starboard: southbound, slower, truer."
      }
    },
    {
      "id": "p5-lianna",
      "persona_label": "Newlyweds trading confetti for glaciers. Soft luxury, big windows, and room for vows to breathe.",
      "title": "Honeymoon in Motion: Glaciers & Slow Mornings on Radiance of the Seas",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nWe chose **southbound Alaska** in **July 2025** (Seward → Vancouver) because we wanted the world to look like a cathedral. **Skagway**, **Juneau**, **Icy Strait Point**, **Ketchikan**, and a date with **Hubbard Glacier** gave us pews made of mountains.\n\n## Days Afloat\nBreakfast in our **balcony** robes, coffee steam tangling with cold air. Afternoons in the **solarium**, reading until the sea asked us to look up. Evenings: **Giovanni’s Table** and long walks under glass.\n\n## Ashore\n**Juneau**: helicopter canceled; we pivoted to a walk to **Mendenhall Glacier** and ended up loving the blue in the lake ice. **Ketchikan**: rain on cedar, hand-in-hand on **Creek Street**.\n\n## Tear-Tug\nAt **Hubbard**, we read our private vows again, voices shaking when the glacier cracked. A stranger cheered softly—just one clap—and then silence returned like a blessing.\n\n## Practical Links\n• **Search Alaska honeymoons** → https://www.royalcaribbean.com/cruise-search  \n• **Specialty dining** → https://www.royalcaribbean.com/experience/cruise-dining/specialty-restaurants  \n• **Packing: dress + down** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p7-yasmin",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p7-yasmin",
        "label": "Port: multigen Alaska where Nana set the pace."
      },
      "nav_starboard": {
        "target_persona_id": "p8-caleb",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p8-caleb",
        "label": "Starboard: Tampa, tacos, and a second chance."
      }
    },
    {
      "id": "p6-owen",
      "persona_label": "Two friends, one hard year. Short Tampa sailing that felt like a deep breath.",
      "title": "Short, Sunny, Necessary: A Tampa Reset on Radiance of the Seas",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nWe grabbed a **4–5 night** **Western Caribbean** from **Tampa** in **March 2025**: **Cozumel** and **Costa Maya**, plus sea days to remember how to laugh. Radiance is sized like a thought you can hold—easy to cross, impossible to tire of the views.\n\n## What Helped\nWe lived at the **pool**, refueled at **Park Café**, and watched sunsets in the **Schooner Bar** windows. Staff clocked the mood and made room without making a fuss.\n\n## Ashore\n**Cozumel**: bike + beach; **Costa Maya**: hammocks and a limeade that reset my brain chemistry.\n\n## Tear-Tug\nMy friend said, “I wasn’t sure I knew how to be happy anymore,” and then we were—just for a while—floating in warm water with nothing to solve.\n\n## Practical Links\n• **Search Tampa short breaks** → https://www.royalcaribbean.com/cruise-search  \n• **Refreshment Package** → https://www.cruisinginthewake.com/drink-packages.html#refreshment  \n• **Packing: light + easy** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p9-sahana",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p9-sahana",
        "label": "Port: southbound science teacher with kids in tow."
      },
      "nav_starboard": {
        "target_persona_id": "p2-mateo",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p2-mateo",
        "label": "Starboard: another Tampa take—father and son."
      }
    },
    {
      "id": "p7-yasmin",
      "persona_label": "Three generations, one Alaska calendar. Slow choices, big views, and easy wins for all ages.",
      "title": "Nana Sets the Pace: Multigen Alaska on Radiance of the Seas",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nWe booked **Vancouver round-trip** in **August 2024**—a classic loop: **Ketchikan**, **Icy Strait Point**, **Juneau**, scenic **Endicott Arm/Dawes Glacier** (schedule shift from Hubbard that week), and home via the **Inside Passage**. Radiance gave us glass, greenery, and time.\n\n## The Plan\nMornings in **Windjammer** near the aft windows (wheelchair-friendly layout), afternoons swapping **kids’ club** and **solarium** time, evenings in **Main Dining** where servers turned the lemon tart into theater.\n\n## Ashore\n**Juneau**: whale-watch + Mendenhall lookout—gentle walking, giant payoff. **Icy Strait Point**: boardwalk ease, bonfire scent, and an eagle that seemed hired.\n\n## Tear-Tug\nNana whispered grace over salmon chowder while mountains slid by. My teen—who rolls eyes for sport—said “Amen” like a reflex. I blinked fast and blamed the wind.\n\n## Practical Links\n• **Search RT Vancouver** → https://www.royalcaribbean.com/cruise-search  \n• **Accessibility at sea** → https://www.cruisinginthewake.com/disability-at-sea.html  \n• **Packing: multigen** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p10-margot",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p10-margot",
        "label": "Port: Tampa + Belize with a sketchbook and a second act."
      },
      "nav_starboard": {
        "target_persona_id": "p5-lianna",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p5-lianna",
        "label": "Starboard: honeymoon vows and glacier thunder."
      }
    },
    {
      "id": "p8-caleb",
      "persona_label": "Young couple, small budget, big hearts. Tampa warmth and simple joys.",
      "title": "Warm Water, Warmer Words: A Radiance Weekend from Tampa",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nA **late 2024** long-weekend from **Tampa**—**Cozumel** plus sea days—fit between rent and reality. Radiance’s windows taught us to look up again.\n\n## Onboard Rhythm\n**Park Café** paninis, quiet corners in **Schooner**, and a star-soaked stroll on deck where we planned a year without interrupting each other.\n\n## Ashore\n**Cozumel**: bikes to a beach shack, guacamole the size of a small dream, and a swim where the water forgave us both.\n\n## Tear-Tug\nBack onboard, we wrote notes to future us and slid them into the inside pocket of my jacket. We open them on hard days. It helps.\n\n## Practical Links\n• **Search quick Tampa getaways** → https://www.royalcaribbean.com/cruise-search  \n• **Drinks & non-alcoholic** → https://www.cruisinginthewake.com/drink-packages.html  \n• **Packing: sunny shorty** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p7-yasmin",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p7-yasmin",
        "label": "Port: Nana’s Alaska—room for everyone."
      },
      "nav_starboard": {
        "target_persona_id": "p9-sahana",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p9-sahana",
        "label": "Starboard: teacher-mom, glaciers, and science in the wild."
      }
    },
    {
      "id": "p9-sahana",
      "persona_label": "Science teacher + two kids. Southbound Alaska that made biology personal.",
      "title": "Field Notes from the Rail: Southbound Alaska with Kids on Radiance",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nWe sailed **southbound** in **June 2025** (Seward → Vancouver). Ports: **Hubbard Glacier**, **Skagway**, **Juneau**, **Icy Strait Point**, **Ketchikan**. Homework was banned, curiosity wasn’t.\n\n## Shipboard Classroom\nThe **Observation areas** turned into labs: cloud types, tidal notes, gull IDs. Crew taught the kids napkin-folding and kindness; both stuck.\n\n## Ashore\n**Juneau**: a whale-watch where my son gasped loud enough for the boat to laugh. **Skagway**: stories of the **Klondike** and a lesson in why people chase hard things. **Ketchikan**: totems and rain that made its own music.\n\n## Tear-Tug\nAt **Hubbard**, my daughter asked if ice can be alive. I said not like us, but it moves and sings and changes. She tucked her hand in mine and we listened.\n\n## Practical Links\n• **Search southbounds** → https://www.royalcaribbean.com/cruise-search  \n• **Kid-friendly drinks** → https://www.cruisinginthewake.com/drink-packages.html#soda  \n• **Packing: kid edition** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p4-desmond",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p4-desmond",
        "label": "Port: camera, prayer, northbound light."
      },
      "nav_starboard": {
        "target_persona_id": "p10-margot",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p10-margot",
        "label": "Starboard: Tampa, Belize, and a sketchbook full of blues."
      }
    },
    {
      "id": "p10-margot",
      "persona_label": "Recent empty-nester, watercolorist. Warm-water Tampa loop with gentle adventure and time to think.",
      "title": "Blue Notes: Belize & Back on Radiance of the Seas",
      "markdown": "Full disclosure: I have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## Intro\nA **Western Caribbean** itinerary from **Tampa** in **February 2024**: sea day → **Belize City** → **Roatán** → **Cozumel** → sea day. I brought travel brushes and left the to-do list at home.\n\n## Onboard Ease\n**Solarium** light for sketching, **Schooner Bar** for live piano and people studies, **Main Dining** for meals that arrived like punctuation marks.\n\n## Ashore\n**Belize**: river cruise where a guide pointed out manatees like old friends. **Roatán**: a beach with shade that understood knees. **Cozumel**: market colors I couldn’t finish painting.\n\n## Tear-Tug\nA pianist played “What a Wonderful World” as we sailed. A crew member noticed my sketchbook and asked to see. We both cried, then laughed at ourselves.\n\n## Practical Links\n• **Search Belize itineraries** → https://www.royalcaribbean.com/cruise-search  \n• **Packages & add-ons** → https://www.cruisinginthewake.com/drink-packages.html  \n• **Packing: art-friendly** → https://www.cruisinginthewake.com/packing-lists.html\n",
      "nav_port": {
        "target_persona_id": "p6-owen",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p6-owen",
        "label": "Port: short Tampa reset with a friend."
      },
      "nav_starboard": {
        "target_persona_id": "p1-harper",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p1-harper",
        "label": "Starboard: northbound light and classroom quiet."
      }
    }
  ]
}
