{
  "version": "v2.256",
  "ship_name": "Radiance of the Seas",
  "cruise_line": "Royal Caribbean",
  "personas": [
    {
      "id": "p1-harper",
      "persona_label": "A solo teacher learning to walk again—literally and figuratively. Her week aboard Radiance of the Seas becomes an unexpected lesson in healing and grace.",
      "title": "Harper’s Northbound Journey: Learning to Walk Again on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nWhen I stepped aboard in Vancouver, the cast boot around my ankle drew more attention than my smile. I’d sprained it three months earlier—nothing heroic, just a tumble on the school steps after chasing a seventh-grader who’d forgotten his trombone. But for a woman who lives by the bell schedule, being forced to slow down felt like punishment. The crew didn’t see it that way. From the first greeting—“Welcome home, Miss Harper”—to the way the stateroom attendant quietly left an extra ice pack in my mini-fridge, I was reminded that kindness moves faster than pain. One barista learned my order (“half-sweet mocha, extra patience”) by day two. The ship itself seemed to conspire in my healing.\n\n## Embarkation & Disembarkation\nBoarding at Canada Place was smoother than my own stride. The pier staff guided me to the accessibility lane, and within twenty minutes I was leaning on the rail, watching seaplanes lift off like prayers over the harbor. Disembarkation in Seward a week later felt harder—not physically, but emotionally. There’s something about the final morning at sea, the slow rotation of the ship into the fjord light, that makes you realize the horizon was never the point. It was learning to look up again.\n\n## The Real Talk\nNot every moment was picture-perfect. There were times I caught my reflection in the elevator mirror and hated the limp. The jogging track mocked me. And yes, sometimes the Wi-Fi vanished like motivation on a Monday. But one evening near Hubbard Glacier, I sat alone on Deck 12 as the captain swung us broadside to the ice. The ship fell utterly silent—no announcements, no chatter—just the groan of ancient ice cracking open. A stranger, maybe late sixties, eased into the chair beside me. He didn’t offer a drink; he offered a story. Thirty years married, first cruise since his wife’s chemo ended. He said, “You never realize how loud healing is until you hear it echo.” We sat there in shared quiet until a slab calved and thundered into the sea. For the first time in months, I didn’t wince at the sound of breaking. I whispered, mostly to myself, “This is what grace sounds like.”\n\n## Accessibility on the Seas\nRadiance is one of the easier ships I’ve navigated—wide corridors, elevators at every turn, and crew who don’t treat accessibility like charity. The spa arranged a short-duration massage suited for limited mobility. Even tender-style days like Icy Strait Point were managed with thoughtful ramps and steady hands. My favorite detail? Crew members never hovered—they simply appeared when needed, like well-timed commas in a long sentence.\n\n## A Female Crewmate’s Perspective\nOn day four, a housekeeper named Lila found me sketching glaciers in the Solarium. She sat down on break and said, “We all come to sea for something. Some to run, some to rest.” She told me she sends most of her paycheck home to Cebu and hasn’t seen her children in two years. Then she smiled: “But I still get to watch people heal.” There was no sermon in her words, yet I felt one forming in my chest. Grace again—steady, unspectacular, holy.\n\n## Closing Thoughts\nBy the time we reached Seward, I no longer cared how fast I walked. I cared that I could stand on my own deck and breathe without rushing the view. Radiance didn’t cure me; it recalibrated me. It taught me that healing isn’t about getting back to normal—it’s about finding beauty in the limp. If you see a woman on the next sailing, camera in one hand and a slow step in the other, say hello. I might just tell you what grace sounds like in glacier light."
      ,
      "nav_port": {
        "target_persona_id": "p2-mateo",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p2-mateo",
        "label": "Port: a dad’s Tampa escape where small wins added up to big rest."
      },
      "nav_starboard": {
        "target_persona_id": "p3-nora",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p3-nora",
        "label": "Starboard: southbound glaciers and a promise kept to Mom."
      }
    },
    {
      "id": "p2-mateo",
      "persona_label": "A single father from Tampa learning that rest can be redemptive, not earned. His five-night sailing on Radiance became a quiet turning point.",
      "title": "Mateo’s Gulf Escape: Finding Still Waters on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nI boarded in Tampa with more tension than luggage. Divorce papers finalized six months earlier, two kids back home with my sister, and a silence in my life I didn't know how to fill. My stateroom attendant, Dinesh, greeted me with a grin and a simple line: "You look like a man who needs the sea." Each day he left a towel animal holding a note—quotes about rest, hope, and patience. By the third day, I started looking forward to them more than breakfast. At the [Schooner Bar](/restaurants/schooner-bar.html), Eleni from Thessaloniki swapped my first whiskey for pineapple juice and winked: "Start soft, sir. You'll taste more of life that way." Somehow, she was right. *(Planning your [beverage package](/drink-calculator.html)? Our calculator shows exactly what's worth it.)*\n\n## Embarkation & Disembarkation\nA five-night loop in March 2025—Cozumel and Costa Maya, with sea days stitched between. Boarding took less than half an hour, but emotionally it felt longer, like stepping out of the past one footprint at a time. Disembarkation was the opposite: too quick. When the port came back into view, I realized I wasn’t returning to the same shore I’d left.\n\n## The Real Talk\nDay two hit hard. Families everywhere—matching shirts, inside jokes, small hands gripping soft-serve. Mine weren’t there. I almost retreated to my cabin, but a trivia host roped me into a team called “The Unsinkables.” We lost every round, but laughter filled the space loneliness had hollowed out. On night four, the captain dimmed the decks for stargazing off Mexico’s coast. An older couple beside me said they were celebrating fifty years. The wife told me, “Healing doesn’t happen on calendars—it happens on waves.” I watched her rest her head on his shoulder, and for the first time, I prayed—not for my marriage to return, but for peace to stay.\n\n## Accessibility on the Seas\nRadiance might be one of Royal’s smaller ships, but she’s big on compassion. I saw crew offering an arm to a man with a cane on the gangway, staff quietly clearing space for a wheelchair at trivia, and elevators that never felt like an afterthought. Accessibility here isn’t just physical—it’s emotional. There’s room to breathe, to walk slowly, to be seen without being explained.\n\n## A Female Crewmate’s Perspective\nMid-voyage, I found Eleni again. She’s been at sea nine years, sending money home for her mother’s dialysis. “The ocean gives, but it also takes,” she said, stirring soda water. “Our job is to keep giving anyway.” I asked how she stayed hopeful. She tapped the counter: “Every sunrise out here feels like a second chance.” The ship’s glow wasn’t just lighting the waves—it was reflecting off people like her.\n\n## Closing Thoughts\nWhen we docked back in Tampa, I didn’t rush off. I stood on Deck 12 until the last passenger left, breathing in the salt like I was learning to live again. Radiance didn’t erase my losses; she reframed them. Calm isn’t something you wait for—it’s something you choose, moment by moment. If you spot a dad at sunrise with coffee in one hand and gratitude in the other, that’s probably me, whispering thanks for a ship that taught me how to rest again."
      ,
      "nav_port": {
        "target_persona_id": "p1-harper",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p1-harper",
        "label": "Port: a solo teacher who found rest in the northern light."
      },
      "nav_starboard": {
        "target_persona_id": "p4-desmond",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p4-desmond",
        "label": "Starboard: Vancouver sailaway to Seward with a camera and a prayer."
      }
    },
    {
      "id": "p3-nora",
      "persona_label": "Daughter keeping a promise. Southbound Alaska, gentle pacing, and the courage to let wonder land.",
      "title": "Southbound for Mom: Radiance of the Seas and the Long Look Back",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nWe sailed southbound in September 2024 so Mom could see Alaska the way she'd imagined. Our dining team slowed their pace without making it a production. The [Solarium](/restaurants/solarium-bistro.html) crew lowered their voices like a hush in a chapel. Even the barista learned Mom's half-caf and added a cinnamon dash she never knew she liked.\n\n## Embarkation & Disembarkation\nWe began in Seward under mountain silhouettes and ended in Vancouver’s glass glow. Embarkation was unhurried; a pier agent saw Mom’s cane and guided us past the knots of lines. Disembarkation felt like closing a favorite book—satisfying, reluctant, complete.\n\n## The Real Talk\nSkagway’s White Pass train made her teary (“Imagine building that,” she whispered). In Juneau we watched a whale sound and vanish like a shared secret. I pushed our pace once in Ketchikan, and she winced. Lesson learned—Alaska rewards the lingerers.\n\n## Accessibility on the Seas\nElevators near the venues we used most, wide theater aisles, and patient tenders where needed. At Icy Strait Point, the boardwalk’s gentle grade made the day feel possible before it even started.\n\n## A Female Crewmate’s Perspective\nA headwaiter named Alina told Mom, “My grandmother taught me that slowness is a kind of wealth.” She refilled tea and asked for nothing but a story in return. Mom gave her three.\n\n## Closing Thoughts\nAt Hubbard Glacier, rain stitched the deck into watercolor. Mom slipped her arm into mine and said, “Your dad would have teased this weather and loved it anyway.” We laughed and stood there in it. A crew member handed us towels with a grin like family. Promise kept, gently."
      ,
      "nav_port": {
        "target_persona_id": "p5-lianna",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p5-lianna",
        "label": "Port: just-married and glacier-struck."
      },
      "nav_starboard": {
        "target_persona_id": "p1-harper",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p1-harper",
        "label": "Starboard: a teacher’s northbound quiet."
      }
    },
    {
      "id": "p4-desmond",
      "persona_label": "A midlife professional burning out quietly who booked a northbound sailing to remember what unhurried feels like. His camera, a notebook, and Radiance helped him trade noise for presence.",
      "title": "Desmond’s Northbound Reset: A Camera, a Quiet Prayer, and Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nI boarded in Vancouver with a backpack full of lenses and a calendar full of unfinished conversations. Burnout makes everything feel loud, even the quiet parts. Marlon, a stateroom attendant from Manila, noticed my camera and asked what I hoped to capture. "Proof I can still see," I said. He set an extra kettle in my room for evening tea. At [Café Latte-tudes](/restaurants/latte-tudes.html), Kahili from Oahu swapped my second espresso for hot chocolate—"Photographers shoot better on soft edges," she said. Small mercies, early and often.\n\n## Embarkation & Disembarkation\nCanada Place framed sailaway with the Lions Gate Bridge like a benediction. A week later in Seward, leaving felt like tearing a page out mid-sentence—orderly, reluctant, a little sacred.\n\n## The Real Talk\nKetchikan, Icy Strait Point, Juneau, Skagway, Hubbard Glacier—names that sound like exhale. But the mind doesn’t unclench on command. In Juneau I rode the tram to Mount Roberts, found a boardwalk smelling of rain, and a child pointed out a cloud breathing off the mountain. That night at Hubbard, the ship rotated until the ice became a cathedral wall. A woman near me whispered a prayer I didn’t catch. When the glacier calved, it sounded like an organ’s low register. I took one photo, then put the camera down and counted breaths. I wasn’t saving time anymore; I was letting time save me.\n\n## Accessibility on the Seas\nI came aboard able-bodied but watched Radiance make room for bodies unlike mine—ramps at Icy Strait Point, steady hands on tender steps, seating that didn’t feel like an apology. Welcome, by design.\n\n## A Female Crewmate's Perspective\nDuring a quiet hour in [Schooner](/restaurants/schooner-bar.html), Anya from Varna showed me tiny watercolors she paints between shifts—wake lines and moonlight. “People think the sea is blue,” she said. “Mostly, it’s silver if you pay attention.” She misses first times with her son back home, so she collects quiet seconds here. I started my own short list of reasons to keep showing up.\n\n## Closing Thoughts\nBy Skagway I walked the promenade with pockets empty—no phone, no plan. On the last morning, Seward’s mountains felt like counsel. Radiance didn’t hand me a different life; she gave me better language for the one I have—slower, truer, enough."
      ,
      "nav_port": {
        "target_persona_id": "p6-owen",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p6-owen",
        "label": "Port: buddy trip from Tampa that healed more than we planned."
      },
      "nav_starboard": {
        "target_persona_id": "p3-nora",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p3-nora",
        "label": "Starboard: southbound, slower, truer."
      }
    },
    {
      "id": "p5-lianna",
      "persona_label": "Newlyweds trading confetti for glaciers. Soft luxury, big windows, and room for vows to breathe.",
      "title": "Honeymoon in Motion: Glaciers & Slow Mornings on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nServers learned our names by dessert and tucked a congratulatory note under a plate like a secret. Our attendant kept the balcony window spotless because he said vows deserve a clear view.\n\n## Embarkation & Disembarkation\nWe chose southbound in July 2025 (Seward → Vancouver) to let the world look like a cathedral. Embarkation in Seward was crisp and unhurried; disembarkation in Vancouver felt like stepping out of stained glass.\n\n## The Real Talk\nHelicopter plans in Juneau were canceled by weather; we pivoted to Mendenhall’s trails and found blue light knitting the lake. Ketchikan rained on cedar and on us; we laughed under the hood of one jacket made for two.\n\n## Accessibility on the Seas\nElevators near venues, theater aisles forgiving, crew pacing service to the way we lingered. Radiance is sized for easy choices that feel like care.\n\n## A Female Crewmate’s Perspective\nA sommelier named Priyanka told us she keeps a tiny notebook of “astonishments”—one for every sailing. She wrote “Hubbard vows, 2 voices, thunder” and showed us the page later, a smile like a toast.\n\n## Closing Thoughts\nAt Hubbard Glacier we read our private vows again. A crack, a roar, then silence returned like a blessing. We didn’t plan a perfect honeymoon; we received a generous one. That felt better."
      ,
      "nav_port": {
        "target_persona_id": "p7-yasmin",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p7-yasmin",
        "label": "Port: multigen Alaska where Nana set the pace."
      },
      "nav_starboard": {
        "target_persona_id": "p8-caleb",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p8-caleb",
        "label": "Starboard: Tampa, tacos, and a second chance."
      }
    },
    {
      "id": "p6-owen",
      "persona_label": "Two friends, one hard year. Short Tampa sailing that felt like a deep breath.",
      "title": "Short, Sunny, Necessary: A Tampa Reset on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nWe arrived with gallows humor and bad sleep. The pool bar team learned our names and our pace—slow for stories, quick for water. Our attendant left extra hangers for the hope we’d unpack more than clothes.\n\n## Embarkation & Disembarkation\nA 4–5 night Western Caribbean from Tampa in March 2025—Cozumel and Costa Maya. Boarding was a shrug of relief; disembarkation felt like a promise to keep practicing the lighter version of ourselves.\n\n## The Real Talk\nRadiance is sized like a thought you can hold. We lived at the pool, refueled at [Park Café](/restaurants/park-cafe.html), and watched sunsets in [Schooner](/restaurants/schooner-bar.html)'s windows. In Cozumel we biked to a beach shack; in Costa Maya we napped in hammocks until the world made sense again. My friend said, “I wasn’t sure I knew how to be happy anymore,” and then we were—floating in warm water with nothing to solve.\n\n## Accessibility on the Seas\nCrew cleared space without fanfare, elevators were dependable, and tender lines felt guided rather than policed. The ship made room for the pace we could manage.\n\n## A Female Crewmate’s Perspective\nA bar server named Jovie told us she keeps her grandmother’s recipe for limeade taped inside her locker. “For days when the sea is heavy,” she said, handing us two. It tasted like a reset.\n\n## Closing Thoughts\nNecessary can be beautiful. We came for sun and left with sleep, inside jokes, and enough courage to try a kinder rhythm at home."
      ,
      "nav_port": {
        "target_persona_id": "p9-sahana",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p9-sahana",
        "label": "Port: southbound science teacher with kids in tow."
      },
      "nav_starboard": {
        "target_persona_id": "p2-mateo",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p2-mateo",
        "label": "Starboard: another Tampa take—father and son."
      }
    },
    {
      "id": "p7-yasmin",
      "persona_label": "Three generations, one Alaska calendar. Slow choices, big views, and easy wins for all ages.",
      "title": "Nana Sets the Pace: Multigen Alaska on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nOur servers turned lemon tart into theater for the kids and brought Nana hot tea unasked. Adventure feels bigger when someone remembers your smallest comforts.\n\n## Embarkation & Disembarkation\nWe booked Vancouver round-trip in August 2024—Ketchikan, Icy Strait Point, Juneau, scenic Endicott Arm/Dawes Glacier (a schedule swap that week), then home via the Inside Passage. Embarkation was stroller-and-wheelchair friendly; disembarkation gave us time to say slow goodbyes to big windows.\n\n## The Real Talk\nWe planned one big thing per port and let the rest be gravy. Juneau whale-watch + Mendenhall lookout; Icy Strait Point boardwalk ease; Ketchikan rain that made its own music. Teens rolled their eyes at first and then at the eagles for being show-offs.\n\n## Accessibility on the Seas\nAft Windjammer tables with space for Nana’s chair, elevators close to venues, and crew who took their cues from her—not from a script.\n\n## A Female Crewmate’s Perspective\nAlina, our headwaiter, said, “Slowness is a kind of wealth.” She refilled tea and asked Nana for a story about courting Papa. The table got quiet in the best way.\n\n## Closing Thoughts\nNana whispered grace over salmon chowder while mountains slid by. My teen—who rolls eyes for sport—said “Amen” like a reflex. I blinked fast and blamed the wind."
      ,
      "nav_port": {
        "target_persona_id": "p10-margot",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p10-margot",
        "label": "Port: Tampa + Belize with a sketchbook and a second act."
      },
      "nav_starboard": {
        "target_persona_id": "p5-lianna",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p5-lianna",
        "label": "Starboard: honeymoon vows and glacier thunder."
      }
    },
    {
      "id": "p8-caleb",
      "persona_label": "Young couple, small budget, big hearts. Tampa warmth and simple joys.",
      "title": "Warm Water, Warmer Words: A Radiance Weekend from Tampa",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nOur attendant celebrated our “got-through-a-hard-year” trip like it was a milestone—and it was. Park Café remembered our paninis and our names.\n\n## Embarkation & Disembarkation\nA late-2024 long weekend from Tampa—Cozumel plus sea days—fit between rent and reality. Boarding was a sigh; disembarkation was a promise to keep being gentle back on land.\n\n## The Real Talk\nWe found quiet corners in the Schooner Bar and a star-soaked stroll on deck where we planned a year without interrupting each other. In Cozumel we biked to a beach shack, shared guacamole the size of a small dream, and swam until the water forgave us both.\n\n## Accessibility on the Seas\nRadiance’s scale made moving around intuitive, and crew were quick to adjust seating so everyone nearby fit—us included.\n\n## A Female Crewmate’s Perspective\nA server named Mara told us she writes postcards to her future self on turnaround day. “You’ll want proof you kept choosing hope,” she said, handing us two blank cards. We wrote them, sealed them, and dated the back for hard days.\n\n## Closing Thoughts\nWe slid those notes into the inside pocket of my jacket. Back home, we open them when we need them. It helps."
      ,
      "nav_port": {
        "target_persona_id": "p7-yasmin",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p7-yasmin",
        "label": "Port: Nana’s Alaska—room for everyone."
      },
      "nav_starboard": {
        "target_persona_id": "p9-sahana",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p9-sahana",
        "label": "Starboard: teacher-mom, glaciers, and science in the wild."
      }
    },
    {
      "id": "p9-sahana",
      "persona_label": "Science teacher + two kids. Southbound Alaska that made biology personal.",
      "title": "Field Notes from the Rail: Southbound Alaska with Kids on Radiance",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nThe staff turned napkin-folding into a lab for little hands and remembered my son’s apple juice and my daughter’s endless questions.\n\n## Embarkation & Disembarkation\nSouthbound in June 2025 (Seward → Vancouver): Hubbard Glacier, Skagway, Juneau, Icy Strait Point, Ketchikan. Boarding with kids was kinder than expected; disembarkation was organized enough that nobody cried—small miracle.\n\n## The Real Talk\nObservation decks became classrooms: cloud types, tidal notes, gull IDs. Juneau’s whale-watch made my son gasp loud enough for the boat to laugh. Skagway’s Klondike stories turned into a lesson on why people chase hard things. Ketchikan’s totems and rain made their own music.\n\n## Accessibility on the Seas\nStrollers fit, elevators arrived, and crew kneeled to talk to the kids at eye level. That’s design, not luck.\n\n## A Female Crewmate’s Perspective\nA youth staffer named Pilar said she keeps a box of “found smiles” (drawings and notes kids leave behind). She added my daughter’s doodle of a humpback and promised it would cheer someone on a harder day.\n\n## Closing Thoughts\nAt Hubbard, my daughter asked if ice can be alive. “Not like us,” I said, “but it moves and sings and changes.” She tucked her hand in mine and we listened. Science, met wonder."
      ,
      "nav_port": {
        "target_persona_id": "p4-desmond",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p4-desmond",
        "label": "Port: camera, prayer, northbound light."
      },
      "nav_starboard": {
        "target_persona_id": "p10-margot",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p10-margot",
        "label": "Starboard: Tampa, Belize, and a sketchbook full of blues."
      }
    },
    {
      "id": "p10-margot",
      "persona_label": "Recent empty-nester, watercolorist. Warm-water Tampa loop with gentle adventure and time to think.",
      "title": "Blue Notes: Belize & Back on Radiance of the Seas",
      "markdown": "## Full disclosure\nI have not yet sailed Radiance of the Seas. Until I do, this Logbook is an aggregate of vetted guest soundings, taken in their own wake, trimmed and edited to our standards.\n\n## The Crew and Staff\nPiano in the Schooner Bar at dusk, and a server who brought extra hot water for my travel brushes. Dinner arrived like punctuation—exactly where I needed a pause.\n\n## Embarkation & Disembarkation\nWestern Caribbean from Tampa in February 2024: sea day → Belize City → Roatán → Cozumel → sea day. Boarding was sunlight and ease; disembarkation felt like leaving a studio mid-painting.\n\n## The Real Talk\nBelize: a river cruise where the guide pointed out manatees like old friends. Roatán: a beach with shade that understood knees. Cozumel: market colors I couldn’t finish painting before all-aboard.\n\n## Accessibility on the Seas\nCrew made space at railings when they saw my sketchbook, and theater seating worked without choreography.\n\n## A Female Crewmate’s Perspective\nA pianist named Irena said she keeps a list of songs people cry to and plays one each sailing at sailaway. “It’s a kindness to let feelings onboard,” she told me. She was right.\n\n## Closing Thoughts\nAs we left Belize, she played “What a Wonderful World.” A crew member noticed my watercolor and asked to see. We both cried, then laughed at ourselves. I packed a bluer blue for home."
      ,
      "nav_port": {
        "target_persona_id": "p6-owen",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p6-owen",
        "label": "Port: short Tampa reset with a friend."
      },
      "nav_starboard": {
        "target_persona_id": "p1-harper",
        "url": "https://www.cruisinginthewake.com/ships/rcl/radiance-of-the-seas.html?view=persona&id=p1-harper",
        "label": "Starboard: northbound light and classroom quiet."
      }
    }
  ]
}
