{
  "ship": "Regatta",
  "ship_class": "",
  "cruise_line": "Oceania Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "mJE1weJyoFU",
        "provider": "youtube",
        "title": "Oceania Regatta | Aft Concierge Veranda Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Aft Concierge Veranda Stateroom aboard Oceania Regatta. These Concierge Staterooms are great if you're looking for the great concierge service and a beautiful vera"
      },
      {
        "videoId": "yU50GUe0LTU",
        "provider": "youtube",
        "title": "Oceania Regatta | Concierge Veranda Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Concierge Veranda Stateroom aboard Oceania Regatta. These Concierge Staterooms are great if you're looking for the great concierge service and a beautiful veranda b"
      },
      {
        "videoId": "2-qXqme5DFY",
        "provider": "youtube",
        "title": "Oceania Regatta | Deluxe Oceanivew Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Deluxe Oceanivew Stateroom aboard Oceania Regatta. Coming with a picture window to provide the natural light and being able to sleep up to 3 guests this is great fo"
      },
      {
        "videoId": "z9HvpWC_ROM",
        "provider": "youtube",
        "title": "Oceania Regatta | Forward Concierge Veranda Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Forward Concierge Veranda Stateroom aboard Oceania Regatta. These Concierge Staterooms are great if you're looking for the great concierge service and a beautiful v"
      },
      {
        "videoId": "YT8JTmnGCmE",
        "provider": "youtube",
        "title": "Oceania Regatta | Full Ship Walkthrough Tour & Review 4K | Oceania Cruises",
        "description": "Join Danny and Taylor as they tour through the Oceania Regatta. This remarkable ship has been completely redesigned. Every surface of every suite and stateroom is entirely new, while in the public spa"
      },
      {
        "videoId": "KzKZaYAe-OI",
        "provider": "youtube",
        "title": "Oceania Regatta | Inside Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Inside Stateroom aboard Oceania Regatta. These Inside Staterooms are some of the best value in the cruise industry when you consider the service that comes with th"
      },
      {
        "videoId": "pehU_ABYPak",
        "provider": "youtube",
        "title": "Oceania Regatta | Oceanivew Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Oceanview Stateroom aboard Oceania Regatta. These Staterooms have a port hole window to let all the natural light come in. Also being able to sleep up to 3 guests "
      },
      {
        "videoId": "PVDkQNMvgPI",
        "provider": "youtube",
        "title": "Oceania Regatta | Owners Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Owners Suite aboard Oceania Regatta. This Suite is the top on board with a large amount of space between both the cabin and balcony. Coming with concierge services "
      },
      {
        "videoId": "Qt0wTxMjB08",
        "provider": "youtube",
        "title": "Oceania Regatta | Penthouse Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Penthouse Suite aboard Oceania Regatta. With a great amount of space this Suite is perfect for a family depending on the configuration. Also coming with concierge s"
      },
      {
        "videoId": "Bp_jESow_co",
        "provider": "youtube",
        "title": "Oceania Regatta | Solo Oceanivew Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Solo Oceanview Stateroom aboard Oceania Regatta. These Staterooms have a port hole window to let all the natural light come in. Also being able to sleep up to 3 gue"
      },
      {
        "videoId": "XTkSFWT4cFc",
        "provider": "youtube",
        "title": "Oceania Regatta | Veranda Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Veranda Stateroom aboard Oceania Regatta. This room is actually identical to the Concierge Veranda toured in a separate video, the only difference is the Concierge"
      },
      {
        "videoId": "ZHtLSadP7lY",
        "provider": "youtube",
        "title": "Oceania Regatta | Vista Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Vista Suite aboard Oceania Regatta. These forward facing suites are some of our favorite staterooms aboard the Regatta. But the room is just the beginning, the ser"
      }
    ]
  }
}