{
  "ship": "Riviera",
  "ship_class": "",
  "cruise_line": "Oceania Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "w9c7pRf8XDc",
        "provider": "youtube",
        "title": "Junior Suite Ocean Front (Preferred Club) | Secrets Akumal Riviera Maya | Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Preferred Club Junior Suite Ocean Front located at the beautiful Secrets Akumal Riviera Maya. As an added bonus these \"Preferred Club\" room options come with a bunch of added "
      },
      {
        "videoId": "Al2hawV_nwg",
        "provider": "youtube",
        "title": "Junior Suite Ocean Front Swim Out | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Junior Suite Swim Out Ocean Front located at the beautiful Secrets Akumal Riviera Maya. We absolutely love swim out rooms here at Harr Travel and this is no exception! Located"
      },
      {
        "videoId": "pM4xxByplfo",
        "provider": "youtube",
        "title": "Junior Suite Ocean View (Preferred Club) | Secrets Akumal Riviera Maya | Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Preferred Club Junior Suite Ocean View located at the beautiful Secrets Akumal Riviera Maya. As an added bonus these \"Preferred Club\" room options come with a bunch of added a"
      },
      {
        "videoId": "U-EbtSPcj2w",
        "provider": "youtube",
        "title": "Junior Suite Partial Ocean View | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Junior Suite Partial Ocean View located at the beautiful Secrets Akumal Riviera Maya. Keep in mind the views can vary greatly on this category, you could get lucky or possibly"
      },
      {
        "videoId": "ALPdtn6xQTA",
        "provider": "youtube",
        "title": "Junior Suite Swim Out (Preferred Club) | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Junior Suite Swim Out Preferred Club located at the beautiful Secrets Akumal Riviera Maya. We love swim out rooms here at Harr Travel and Secrets does an amazing job of design"
      },
      {
        "videoId": "Mq18GLVH9CU",
        "provider": "youtube",
        "title": "Junior Suite Swim Out | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Junior Suite Swim Out located at the beautiful Secrets Akumal Riviera Maya. We absolutely love swim out rooms here at Harr Travel and Secrets does an amazing job of designing "
      },
      {
        "videoId": "-zjXZn_5VRM",
        "provider": "youtube",
        "title": "Junior Suite Tropical View | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Preferred Club Junior Suite Tropical View located at the beautiful Secrets Akumal Riviera Maya. This is the entry level room here on the property and the views can vary drasti"
      },
      {
        "videoId": "lbtnYIUtTp0",
        "provider": "youtube",
        "title": "Presidential Suite | Secrets Akumal Riviera Maya | Complete Walkthrough Room Tour & Review 4K",
        "description": "Join Danny as he tours the Presidential Suite at the beautiful Secrets Akumal Riviera Maya. This is the top suite on the property, and it is easy to see why. Their location right on the beach has amaz"
      },
      {
        "videoId": "Ol9KSPIKL08",
        "provider": "youtube",
        "title": "Romance Master Suite Ocean Front | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Romance Master Suite Ocean Front located at the beautiful Secrets Akumal Riviera Maya. These Master Suite layouts are such a great option for those who want a little extra spa"
      },
      {
        "videoId": "Cbcefhrjgiw",
        "provider": "youtube",
        "title": "Romance Master Suite Ocean View | Secrets Akumal Riviera Maya | Full Walkthrough Room Tour 4K",
        "description": "Join Danny as he tours a Romance Master Suite Ocean View located at the beautiful Secrets Akumal Riviera Maya. These Master Suite layouts are such a great option for those who want a little extra spac"
      },
      {
        "videoId": "OmvyVjP3fD0",
        "provider": "youtube",
        "title": "Secrets Akumal Riviera Maya | Complete Walkthrough Tour | All Public Spaces Explained 4K",
        "description": "Welcome to the beautiful Secrets Akumal Riviera Maya. Join Danny on a tour walk though of this new iconic property in glorious 4k resolution. Secrets Akumal is unique in so many ways, from the amazing"
      }
    ],
    "top ten": [
      {
        "videoId": "pfyGsl8PX8Q",
        "provider": "youtube",
        "title": "Carnival Splendor Mexican Riviera Vlog - Day 3",
        "description": "Hey Cruisers, It's day 3 of our Carnival Splendor Mexican Riviera Cruise, and we're heading out for an awesome Carnival excursion in Cabo. If you are researching cruises for yourself, please remember "
      },
      {
        "videoId": "BHIl9cE50L0",
        "provider": "youtube",
        "title": "Carnival Splendor Mexican Riviera Vlog: Puerto Vallarta Resort Day Pass",
        "description": "Hi Cruisers! It's day 5 of our Carnival Splendor Mexican Riviera cruise, and we've got a full day of fun, adventure, and new cruise experiences ahead of us. Check out our sponsor CruiseLine.com https:"
      }
    ]
  }
}