{
  "ship": "Sirena",
  "ship_class": "",
  "cruise_line": "Oceania Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "xcI7ojQegXQ",
        "provider": "youtube",
        "title": "Oceania Sirena | Concierge Veranda Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Concierge Veranda Stateroom aboard Oceania Sirena. This room is actually identical to the Veranda toured in a separate video, the only difference is the Concierge s"
      },
      {
        "videoId": "8SBa5i9WnK4",
        "provider": "youtube",
        "title": "Oceania Sirena | Full Ship Walkthrough Tour & Review | 4K | All Public Spaces Toured & Explained",
        "description": "In a dramatic re-inspiration process, Sirena is a completely redesigned ship without peer. Every surface of every suite and stateroom is entirely new, while in the public spaces, a refreshed color pal"
      },
      {
        "videoId": "1JChcRhavtY",
        "provider": "youtube",
        "title": "Oceania Sirena | Inside Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Inside Stateroom aboard Oceania Sirena. These Inside Staterooms are some of the best value in the cruise industry when you consider the service that comes with the"
      },
      {
        "videoId": "alY0Uc-Vojs",
        "provider": "youtube",
        "title": "Oceania Sirena | Ocean View Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Deluxe Ocean View stateroom aboard Oceania Sirena. Although they don't have the full floor-to-ceiling windows that are featured on its big sisters, Marina and Rivie"
      },
      {
        "videoId": "xWXtYMi8fbQ",
        "provider": "youtube",
        "title": "Oceania Sirena | Owners Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Owner's Suite aboard Oceania Sirena. This aft-facing stateroom is probably our favorite stateroom aboard the Sirena. And now that it has been fully \"re-inspired\" i"
      },
      {
        "videoId": "Ut-fgfVkMqw",
        "provider": "youtube",
        "title": "Oceania Sirena | Penthouse Full Walkthrough Suite Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Penthouse Suite aboard Oceania Sirena. These outward-facing staterooms are some of the most beautiful staterooms aboard the Sirena. And now that they have been full"
      },
      {
        "videoId": "2oLQ063N860",
        "provider": "youtube",
        "title": "Oceania Sirena | Veranda Stateroom Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around a Veranda Stateroom aboard Oceania Sirena. This room is actually identical to the Concierge Veranda toured in a separate video, the only difference is the Concierge s"
      },
      {
        "videoId": "MFowejgd-3Q",
        "provider": "youtube",
        "title": "Oceania Sirena | Vista Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Vista Suite aboard Oceania Sirena. These forward facing suites are some of our favorite staterooms aboard the Sirena. And now that it has been fully \"re-inspired\" "
      }
    ]
  }
}