{
  "ship": "Vista",
  "ship_class": "",
  "cruise_line": "Oceania Cruises",
  "last_updated": "2026-01-03",
  "videos": {
    "ship walk through": [
      {
        "videoId": "bIqG9jrZ9Js",
        "provider": "youtube",
        "title": "Corner Suite Ocean View (Preferred Club) | Dreams Vista Cancun | Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he tours a Preferred Club Corner Suite Ocean View located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. This unique layout provides amazing views out to ocean, as well as the "
      },
      {
        "videoId": "trICpgb2ARs",
        "provider": "youtube",
        "title": "Deluxe Family Suite Ocean View Preferred Club | Dreams Vista Cancun | Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he tours a Preferred Club Deluxe Family Suite Ocean View located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. For a family looking for separate spaces for the \"kiddos\" this i"
      },
      {
        "videoId": "O5aZe2tbMBc",
        "provider": "youtube",
        "title": "Deluxe Family Suite Ocean View With Plunge Pool | Dreams Vista Cancun | Walkthrough Tour & Review 4K",
        "description": "Join Danny as he tours a Preferred Club Deluxe Family Suite Ocean View With Plunge Pool located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. For a family looking for separate spaces for th"
      },
      {
        "videoId": "ZSGiipK1uyY",
        "provider": "youtube",
        "title": "Deluxe Ocean View Plunge Pool | Dreams Vista Cancun | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he tours a Deluxe Ocean View Plunge Pool Room located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. Combine a beautiful view with a refreshing plunge pool and Danny is \"in\". H"
      },
      {
        "videoId": "djoJuFb8W40",
        "provider": "youtube",
        "title": "Deluxe Ocean View | Dreams Vista Cancun | Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he tours a Deluxe Ocean View located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. This is the entry level room at the property, and is offered in a preferred and standard var"
      },
      {
        "videoId": "dyPLadjpjyE",
        "provider": "youtube",
        "title": "Dreams Vista Cancun Golf & Spa Resort | Complete Walkthrough Tour & Review 4K",
        "description": "Welcome to the beautiful Dreams Vista Cancun Golf & Spa Resort. Join Danny on a walkthrough tour of this beautiful property in glorious 4k resolution. With the vertical layout this resort is perfect f"
      },
      {
        "videoId": "-JzY5AqAaFM",
        "provider": "youtube",
        "title": "Honeymoon Suite Ocean View (Preferred Club) | Dreams Vista Cancun | Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he tours a Preferred Club Honeymoon Suite Ocean View located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. This is the perfect room for any couple that wants a private getaway"
      },
      {
        "videoId": "bOheseFSqKg",
        "provider": "youtube",
        "title": "Master Suite Ocean Front (Preferred Club) | Dreams Vista Cancun | Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he tours a Preferred Club Master Ocean Front located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. This is the perfect room to maximize the views, all while having a private a"
      },
      {
        "videoId": "ZHtLSadP7lY",
        "provider": "youtube",
        "title": "Oceania Regatta | Vista Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Vista Suite aboard Oceania Regatta. These forward facing suites are some of our favorite staterooms aboard the Regatta. But the room is just the beginning, the ser"
      },
      {
        "videoId": "MFowejgd-3Q",
        "provider": "youtube",
        "title": "Oceania Sirena | Vista Suite Full Walkthrough Tour & Review | 4K",
        "description": "Join Danny as he shows you around an Vista Suite aboard Oceania Sirena. These forward facing suites are some of our favorite staterooms aboard the Sirena. And now that it has been fully \"re-inspired\" "
      },
      {
        "videoId": "_5Ps8jP85bg",
        "provider": "youtube",
        "title": "Sapphire Princess | Vista Suite Full Walkthrough Tour | 4k",
        "description": "Join Danny as he tours a Vista Suite on the beautiful Sapphire Princess. When you book this suite you are given a few suite perks including priority embarkation and disembarkation privileges, as well "
      }
    ],
    "suite": [
      {
        "videoId": "2fYb2mmyTCQ",
        "provider": "youtube",
        "title": "Master Family Suite Ocean View (Preferred Club) | Dreams Vista Cancun | Full Room Tour & Review | 4K",
        "description": "Join Danny as he tours a Preferred Club Master Family Suite Ocean View located at the beautiful Dreams Vista Cancun, Golf & Spa Resort. This is the perfect room for a family that wants to maximize the"
      }
    ]
  }
}