{
  "title": "File:Rocky beach looking east from survey station 199, Alaska Midland Railway survey, probably along the Chilkat River, Alaska, 1909 (AL+CA 3032).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Rocky_beach_looking_east_from_survey_station_199%2C_Alaska_Midland_Railway_survey%2C_probably_along_the_Chilkat_River%2C_Alaska%2C_1909_%28AL%2BCA_3032%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/3/33/Rocky_beach_looking_east_from_survey_station_199%2C_Alaska_Midland_Railway_survey%2C_probably_along_the_Chilkat_River%2C_Alaska%2C_1909_%28AL%2BCA_3032%29.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "<div class=\"fn value\">\nUnknown author<span style=\"display: none;\">Unknown author</span></div>",
  "description": "<p>This album contains photos from the 1909 survey expedition for the first section of the Alaska Midland Railway line from Haines to the White River, Yukon Territory. \nPH Coll 230.11b</p>\n<p>The Alaska Midland Railway a venture of John Rosene, a Seattle entrepreneur, was planned and surveyed to run from the port town of Haines (near Skagway), north through what is now Yukon Territory, ending at Fairbanks, Alaska. Rosene and his team of engineers chose this route because they believed its flat grade and connection of rich mineral, timber, and agricultural lands to the sea would make it a lucrative site. The company's original ambitions included connecting to other railways at Fairbanks and continuing the line westward into Siberia by  bridge or tunnel across the Bering Strait. The railway  was never completed, however. During World War I, the U.S. government completed a similar railway line from Fairbanks to Seward, Alaska, and the momentum for  Rosene's project evaporated. \n\n The photographer of this album is unknown, but the 1909 survey team may have included H.R. Robbins, H.P.M. Birkinbine, Steve Sheldon, and Gus  Klaney, all of whom were involved in a later survey of the route.</p>\n<ul><li>Subjects (LCTGM): Beaches--Alaska; Rivers--Alaska</li></ul>",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3ARocky%20beach%20looking%20east%20from%20survey%20station%20199%2C%20Alaska%20Midland%20Railway%20survey%2C%20probably%20along%20the%20Chilkat%20River%2C%20Alaska%2C%201909%20%28AL%2BCA%203032%29.jpg"
}