{
  "title": "File:Thomas Butler Gunn Diaries- Volume 20, page 190 (loose newspaper clipping), ca. 1888 - DPLA - 661410fc63f47618c6a8dbdef435becf.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/49/Thomas_Butler_Gunn_Diaries-_Volume_20%2C_page_190_%28loose_newspaper_clipping%29%2C_ca._1888_-_DPLA_-_661410fc63f47618c6a8dbdef435becf.jpg/1280px-Thomas_Butler_Gunn_Diaries-_Volume_20%2C_page_190_%28loose_newspaper_clipping%29%2C_ca._1888_-_DPLA_-_661410fc63f47618c6a8dbdef435becf.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/4/49/Thomas_Butler_Gunn_Diaries-_Volume_20%2C_page_190_%28loose_newspaper_clipping%29%2C_ca._1888_-_DPLA_-_661410fc63f47618c6a8dbdef435becf.jpg",
  "width": 1200,
  "height": 2478,
  "license": "Public domain",
  "license_url": "",
  "author": "Unknown",
  "description": "<div class=\"description\">\nNewspaper clipping reviewing a book by Charles Reynolds on the history of St. Augustine, Florida. Transcription: Old St. Augustine: A Story of Three Centuries. By Charles B. Reynolds. St. Augustine: E.H. Reynolds. IT is hardly necessary to have seen the quaint old town of which Mr. Reynolds writes, to feel interested in his narrative of its \"changing fortunes\" — \"unstable as the shifting sands of its harbor bar.\" He tells us graphically of its founding in 1565 by the Spanish bigot Menendez, who enforced his claims to Florida by that terrible slaughter of French Huguenots which gave name to Matanzas inlet. Many were the vicissitudes of massacre, sack, conflagration, and siege, to which different foes, the Frenchman, the Englishman, the Indian, the Boucanier (Buccaneer), subjected St. Augustine before it was ceded to England in 1763. During our Revolutionary War it was loyal to the British crown, but the enterprising Englishmen who had infused new vigor into it received a poor reward for their loyalty, when its retrocession to Spain in 1783 compelled them to seek other homes. From that date St. Augustine remained in Spanish hands until Florida passed into the possession of the United States in 1821. All these changes are exhibited by our author in a series of well-selected historic pictures, on which he has succeeded in throwing a strong light. Various characters of greater or less note enliven his pages, from Admiral Sir Francis Drake to Coacoochee and Osceola, heroes of the Seminole war. The story of Fort Marion—of the first building of San Juan de Pinos, of its destruction, its rebuilding, its resistance as San Marco to obstinate siege, its rechristening as Fort Marion—is an interesting one. The book is graced by various illustrations, some being copies of drawings made three centuries ago, and the remainder mostly artotypes of old buildings, the Cathedral, City Gate, Fort Marion, etc. A list of dates and a full index add to the value of the little volume.</div>",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AThomas%20Butler%20Gunn%20Diaries-%20Volume%2020%2C%20page%20190%20%28loose%20newspaper%20clipping%29%2C%20ca.%201888%20-%20DPLA%20-%20661410fc63f47618c6a8dbdef435becf.jpg"
}