{
  "ship": "MSC World America",
  "ship_class": "World Class",
  "cruise_line": "MSC Cruises",
  "last_updated": "2026-01-20",
  "content_protocol": "ICP-Lite v1.4",
  "stories": [
    {
      "title": "World Class Comes to Miami",
      "persona_label": "Fleet Preview",
      "persona": "preview",
      "intended_reader": "Travelers planning future Caribbean cruises on MSC's newest vessel",
      "core_insight": "World America brings proven World Class innovation to the Caribbean market",
      "markdown": "**When MSC World America arrives in Miami in April 2025, she'll bring the revolutionary World Class platform to Caribbean waters for the first time.**\n\nEverything that made [MSC World Europa](/ships/msc/msc-world-europa.html) a Mediterranean sensation—the Europa Promenade, the seven distinct neighborhoods, the LNG propulsion, the purpose-built Cirque du Soleil theater—crosses the Atlantic with enhancements specifically designed for the American market.\n\nWorld America will feature the largest MSC Yacht Club ever built, expanding the luxury ship-within-a-ship concept that European guests have embraced. The family programming has been enhanced for American school vacation schedules. And the dining options have been refined based on two years of World Europa feedback.\n\nThe ship will homeport in Miami, offering Caribbean itineraries year-round. For cruisers who've watched World Europa from afar, this represents the opportunity to experience World Class innovation without flying to Europe.\n\nMSC's expansion strategy is clear: bring their European flagship experience to North America's largest cruise market. World America represents their most ambitious American investment to date—a genuine flagship for the Western Hemisphere.",
      "author": {
        "name": "Fleet Development Team",
        "location": "MSC Cruises"
      }
    },
    {
      "title": "Seven Neighborhoods, One Caribbean Paradise",
      "persona_label": "Design Innovation",
      "persona": "design",
      "intended_reader": "Cruisers interested in ship architecture and layout innovations",
      "core_insight": "World America's neighborhood design creates distinct experiences within one vessel",
      "markdown": "**MSC World America will organize its 6,762-passenger capacity into seven distinct neighborhoods—each with its own character, crowd, and purpose.**\n\nThe concept, proven on [MSC World Europa](/ships/msc/msc-world-europa.html), transforms how guests experience mega-ships. Rather than competing for the same pool deck or dining venues, passengers naturally gravitate to neighborhoods that match their travel style.\n\n**Family Aventura** will feature the signature Cliffhanger swing, water parks, and dedicated family dining. **Zen District** offers adults-only pools and quieter programming. **The Promenade** becomes the social heart—boutiques, bars, and that spectacular LED ceiling cycling through Caribbean themes.\n\nFor World America, MSC has enhanced the neighborhood concept based on World Europa operations. Wayfinding has been simplified. Traffic flow between districts has been optimized. The neighborhoods function more independently while remaining easy to explore.\n\nThis design philosophy matters for Caribbean cruising, where ship time often exceeds port time. World America's neighborhoods ensure that variety exists within the vessel itself—you can have a different experience each day without leaving the ship.",
      "author": {
        "name": "Fleet Development Team",
        "location": "MSC Cruises"
      }
    },
    {
      "title": "Caribbean Dining, World-Class Standards",
      "persona_label": "Culinary Preview",
      "persona": "foodie",
      "intended_reader": "Food enthusiasts planning their World America experience",
      "core_insight": "World America's dining program combines World Class variety with Caribbean influences",
      "markdown": "**MSC World America will debut with thirteen specialty restaurants—matching World Europa's count while introducing Caribbean-inspired additions.**\n\nThe signature venues return: Butcher's Cut for premium steaks, Kaito for Japanese cuisine, Hola! for Mexican flavors. These restaurants have been refined through two years of World Europa operations, with menus adjusted and service polished.\n\nNew for World America: expanded Caribbean and American options designed for the Miami homeport market. The specific concepts remain under development, but MSC has confirmed that local culinary influences will shape the offerings.\n\nThe specialty dining package remains the smart approach—thirteen restaurants across a week-long cruise means you'll want access to everything. Early bookers should purchase packages before sailing to guarantee availability.\n\nFor foodies considering World America's inaugural season, expect the excitement that accompanies any new flagship—the chefs eager to impress, the menus at their most ambitious, the service striving for perfection. First seasons often deliver dining experiences that become more routine over time. There's value in being early.",
      "author": {
        "name": "Fleet Development Team",
        "location": "MSC Cruises"
      }
    }
  ]
}
