{
  "title": "File:Iceberg A23a is Stuck Once Again (MODIS 2025-03-06).jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ee/Iceberg_A23a_is_Stuck_Once_Again_%28MODIS_2025-03-06%29.jpg/1280px-Iceberg_A23a_is_Stuck_Once_Again_%28MODIS_2025-03-06%29.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/e/ee/Iceberg_A23a_is_Stuck_Once_Again_%28MODIS_2025-03-06%29.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "MODIS Land Rapid Response Team, NASA GSFC",
  "description": "The largest and oldest iceberg currently on Earth’s oceans has once again ground to a halt, this time off of the remote South Georgia Island. On March 4, 2025, The Moderate Resolution Imaging Spectroradiometer (MODIS) on NASA’s Aqua satellite acquired this true-color image of the massive mega-iceberg known as A23a aground near the island. Clouds cover a portion of both South Georgia Island and A23a.\n<p>The iceberg first calved from Antarctica’s Filchner Ice Shelf in 1986, where it promptly grounded. After sitting still in the Weddell Sea for more than 30 years, A23a broke free in 2020 and has been drifting on the currents that sweep many icebergs from the icy Antarctic to warmer waters of the Southern Ocean. This drift was interrupted in 2024, when A23a got stuck again—this time, captured in a swirling column of water over a mountain on the sea floor. After a short spin, A23a escaped and began a leisurely drift towards South Georgia Island.\n</p><p>According to satellite images, the iceberg has been sitting in place since March 1. The British Antarctic Survey (BAS) confirmed that the iceberg now appears to be grounded on the continental shelf of the sub-Antarctic Island and sits about 90 kilometers (56 miles) from land. This location is not expected to interfere with breeding of penguins or harm wildlife found on the island—a real possibility had the iceberg grounded closer to or on the shoreline of South Georgia Island.\n</p>\nDr. Andre Meijers, an oceanographer at British Antarctic Survey, was quoted in a press release as saying, “It will be interesting to see what will happen now.  From a scientific perspective we are keen to see how the iceberg will affect the local ecosystem. Nutrients stirred up by the grounding and from its melt may boost food availability for the whole regional ecosystem, including for charismatic penguins and seals. We have several ongoing studies looking at exactly how ‘megabergs’ influence the ocean circulation, its chemistry, and the ecosystems they support.”",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3AIceberg%20A23a%20is%20Stuck%20Once%20Again%20%28MODIS%202025-03-06%29.jpg"
}