{
  "title": "File:Deceptionisland oli 201882 lrg.jpg",
  "url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Deceptionisland_oli_201882_lrg.jpg/1280px-Deceptionisland_oli_201882_lrg.jpg",
  "original_url": "https://upload.wikimedia.org/wikipedia/commons/2/2f/Deceptionisland_oli_201882_lrg.jpg",
  "license": "Public domain",
  "license_url": "",
  "author": "NASA Earth Observatory images by Lauren Dauphin, using Landsat data from the U.S. Geological Survey. Story by Kasha Patel.",
  "description": "Approximately 4,000 years ago, a volcano in the South Ocean launched massive amounts of rock and magma—between 30 and 60 cubic kilometers—into the sky. The eruption had the same severity as the cataclysmic {<a rel=\"nofollow\" class=\"external free\" href=\"https://pubs.usgs.gov/fs/1997/fs113-97/\">https://pubs.usgs.gov/fs/1997/fs113-97/</a> 1991 eruption] of Mount Pinatubo. It was the biggest eruption around Antarctica in the past 12,000 years.\n<p>As the volcano’s magma chamber emptied, the sudden drop in pressure inside the volcano caused the top to collapse and form a caldera. The caldera had a diameter of eight to ten kilometers (five to six miles). A collapse at this magnitude is large enough to induce multiple, intense high-magnitude earthquakes, according to <a rel=\"nofollow\" class=\"external text\" href=\"https://doi.org/10.1038/s41598-018-35460-x\">researchers</a>.\n</p><p>In the process, the caldera gave the island its unusual horseshoe shape. When explorer Nathaniel Palmer approached the island in 1820, he named it “Deception Island” for its deceptive appearance; it appeared as a normal island from one angle, but a narrow passage actually revealed a harbor (the flooded caldera) that explorers could sail into.\n</p><p>These natural-color images show Deception Island in early autumn and early spring, as observed by the <a rel=\"nofollow\" class=\"external text\" href=\"https://landsat.gsfc.nasa.gov/operational-land-imager-oli/\">Operational Land Imager</a> on Landsat 8. The left image shows the island on March 23, 2018, when the top of the volcano was visible. The right image, taken on September 21, 2017, shows the volcano and caldera covered in snow and ice.\n</p><p>Deception Island is one of <a rel=\"nofollow\" class=\"external text\" href=\"https://earthobservatory.nasa.gov/images/87444/mount-erebus-antarctica\">two active</a> volcanoes around Antarctica, and it has erupted more than twenty times since the 19th century. The most recent eruptions occurred between 1967 and 1970, while seismic activity occurred as recently as 2014-2015. Deception Island remains the one of the only places in the world where ships can sail directly into the center of a restless volcano.\n</p><p>Despite the island’s eruptive history, its harbor—Port Foster—is considered one of the safest in Antarctica due to the absence of large glaciers. At the beginning of the 19th century, people began visiting the island to hunt seals, a popular commercial frenzy at the time. When the seals were nearly hunted to extinction by the early 1900s, seafarers switched to whaling and set up operations at Whalers Bay on the east side of the port.\n</p>\nToday, Deception Island is home to scientific research stations, although some have been wiped away by past volcanic activity. The island is also a popular place for tourists, who can haul out on the beach and sit in geothermal baths. Visitors can also see one of the world’s largest rookeries of chinstrap penguins located on the island.",
  "commons_url": "https://commons.wikimedia.org/wiki/File%3ADeceptionisland%20oli%20201882%20lrg.jpg"
}