{
  "ship": "Carnival Liberty",
  "ship_class": "Conquest Class",
  "cruise_line": "Carnival Cruise Line",
  "last_updated": "2025-12-03",
  "content_protocol": "ICP-Lite v1.0",
  "stories": [
    {
      "title": "Movies Under the Stars",
      "persona_label": "Pioneer Experience",
      "intended_reader": "Families curious about shipboard entertainment evolution",
      "core_insight": "The Seaside Theater created something that didn't exist before — cinema at sea",
      "markdown": "**I remember when cruise ships didn't have outdoor movies. Carnival Liberty changed that.**\n\nWe'd sailed three times before Liberty — other lines, other ships. Entertainment was limited to theaters and lounges. If you wanted a movie, you watched it on your cabin's tiny TV.\n\nThen Liberty launched in 2005 with the first Seaside Theater.\n\nThe concept seemed ridiculous when I read about it. A giant LED screen by the pool? Who would sit outside watching movies when they could be doing cruise activities?\n\nEveryone. The answer was everyone.\n\nOur first night aboard, we stumbled upon a showing of some action movie I don't even remember. What I remember is the scene: hundreds of people in deck chairs, the screen glowing against the darkness, the ocean beyond the ship's railings, and stars overhead that no theater could replicate.\n\nMy husband brought popcorn from the nearby station. The servers brought hot chocolate — it was a Caribbean cruise, but the evening had cooled enough to make it welcome.\n\nMy daughter, seven at the time, looked up at me with wonder.\n\n'Mom,' she whispered, 'we're watching a movie on a boat. In the ocean.'\n\n'I know, sweetheart.'\n\n'Is this magic?'\n\nIt felt like it.\n\nThe Seaside Theater became our nightly ritual that cruise. After dinner, after the shows, we'd settle into loungers with blankets and watch whatever was playing. The movies weren't always great. It didn't matter.\n\nWhat mattered was the combination: the gentle motion of the ship, the salt air, the warmth of family beside me, and images flickering on a screen that had no business existing in the middle of the Caribbean.\n\nYears later, my daughter wrote her college essay about that cruise. Not about the ports or the food or any of the things I'd expected to stick with her. About the Seaside Theater. About the magic of something impossible made real.\n\n'Liberty showed me that the world could be surprising,' she wrote. 'That someone could invent something that didn't need to exist but made everything better.'\n\nShe's an engineer now. Designs experiences at a theme park company. Says she's chasing the feeling she had that first night on Liberty, watching movies in a place movies didn't belong.\n\n**The lesson:** Sometimes innovation isn't about necessity. It's about asking 'what if?' and building the answer. The first Seaside Theater didn't solve a problem. It created a possibility no one knew they wanted.",
      "author": {
        "name": "Patricia H.",
        "location": "Orlando, FL"
      }
    },
    {
      "title": "The Fun Ship 2.0 Revelation",
      "persona_label": "Return Visitor",
      "intended_reader": "Cruisers who sailed Liberty before the 2011 refurbishment",
      "core_insight": "Being first at anything means pioneering for everyone who follows",
      "markdown": "**I cruised Carnival Liberty twice — 2008 and 2013. They were different ships.**\n\nNot literally, of course. Same hull, same basic structure. But the 2011 Fun Ship 2.0 refurbishment transformed Liberty in ways that later became standard across the entire fleet.\n\nMy first cruise was pleasant but forgettable. Good food in the main dining room. Basic pool deck activities. Standard Carnival entertainment.\n\nFour years later, I almost didn't recognize her.\n\nGuy's Burger Joint had appeared poolside — fresh burgers cooked to order, signature sauces, no additional charge. BlueIguana Cantina offered Mexican fare that rivaled restaurants at home. RedFrog Rum Bar had created an entirely new category of cruise venue.\n\n'When did this happen?' I asked a crew member.\n\n'2011,' she said. 'Liberty was the first. The test ship. Everything you're seeing started here.'\n\nI explored with new eyes. The Alchemy Bar with its craft cocktails. The modified pool deck layout. The enhanced entertainment schedule.\n\nLiberty had been Carnival's laboratory. The place where they tried new concepts before rolling them fleet-wide. And everything had worked.\n\n'You're cruising history,' my husband said as we ate burgers by the pool. 'This is where Guy's Burger Joint was born.'\n\nI thought about being first at anything. The risk of it. The chance that experiments fail, that passengers complain, that the whole concept gets scrapped.\n\nLiberty took that risk. Or rather, Carnival took it with Liberty. And twenty years later, you can't find a Fun Ship without Guy's burgers and BlueIguana tacos.\n\nThe Venetian Palace theater still anchors the entertainment, but the surrounding venues have multiplied. Where there was once 'the buffet,' there's now a food court of possibilities.\n\n'Would you have cruised Carnival without these additions?' I asked my husband.\n\n'Honestly? Probably not. The food options sold us.'\n\n'So Liberty made our cruise possible.'\n\n'Liberty made Carnival what it is.'\n\nMaybe that's overstating. But every revolution starts somewhere. Every innovation has a first location, a first test, a first group of passengers who experienced something that would become industry standard.\n\nWe were lucky enough to see it twice: before and after. The comparison made us grateful for the pioneers who said yes to untested ideas.\n\n**The lesson:** Being first is brave. It means accepting that what you're trying might not work, that you're guinea pigs as much as guests. But sometimes guinea pigs get to witness something becoming legend.",
      "author": {
        "name": "Jennifer and Mark R.",
        "location": "Tampa, FL"
      }
    },
    {
      "title": "Port Canaveral's Perfect Location",
      "persona_label": "Theme Park Integration",
      "intended_reader": "Families combining cruise and Orlando theme parks",
      "core_insight": "Port Canaveral's proximity to Orlando creates vacation combinations unavailable anywhere else",
      "markdown": "**We spent three days at Disney, four nights on Carnival Liberty, and came home exhausted but whole.**\n\nThe combination seemed ambitious: young children, theme parks, cruise ship, multiple transitions. Every parent friend warned us.\n\n'Too much,' they said. 'They'll melt down.'\n\nThey didn't know Port Canaveral.\n\nThe proximity to Orlando — about an hour's drive — means you can end a theme park vacation and start a cruise the same day. We walked off Disney property at 10 AM and walked onto Liberty by 2 PM.\n\nThe kids, overstimulated from three days of mouse ears and roller coasters, found immediate relief. The ship was structured but calm. Activities available but not mandatory. The pool deck offered lazy rivers instead of queues.\n\n'Is this a hotel?' my four-year-old asked.\n\n'Sort of. A hotel that floats.'\n\n'Cool.'\n\nHe napped for three hours that first afternoon. Best money we ever spent.\n\nThe cruise itself offered recovery that a resort never could. No driving. No planning. No entrance tickets or dining reservations or FastPass strategies. Just... floating.\n\nThe kids swam. We read books by the pool. The Seaside Theater showed movies they'd already seen, and they watched them anyway because watching movies on a boat is different than watching movies anywhere else.\n\nCozumel and Grand Cayman provided adventure without overwhelm. Beach days. Snorkeling. Ice cream in foreign currencies.\n\n'This is better than Disney,' my seven-year-old announced on day three.\n\n'It's different,' I corrected. 'Disney is energy. This is calm.'\n\n'I like calm.'\n\nSo did we.\n\nWe've repeated the combination three more times since. Different theme parks, same ship, same principle. Use Orlando's attractions to generate excitement, then use Liberty to recover.\n\nPort Canaveral makes it possible. An hour from the magic, but distant enough to feel like escape. Close to everything and connected to the Caribbean.\n\n'Why doesn't everyone do this?' my wife asked on our fourth combination trip.\n\n'Maybe they don't know. Maybe they haven't tried.'\n\n'Their loss.'\n\n**The lesson:** The best vacations don't require choosing. Theme parks AND cruise ships. Excitement AND recovery. Orlando AND the Caribbean. Port Canaveral is the comma in that sentence.",
      "author": {
        "name": "The Thompson Family",
        "location": "Atlanta, GA"
      }
    },
    {
      "title": "The Godmother's Blessing Held",
      "persona_label": "Ship Heritage",
      "intended_reader": "Travelers curious about ship naming traditions",
      "core_insight": "Godmothers bless ships once, but the blessing echoes forever",
      "markdown": "**Mira Sorvino named Carnival Liberty in Civitavecchia, Italy. Her blessing saved my honeymoon.**\n\nI know that sounds dramatic. Let me explain.\n\nWe'd planned a Mediterranean honeymoon: Rome to Barcelona, multiple ports, the romantic trip we'd dreamed about for years. Then my husband got sick.\n\nFood poisoning from a Rome restaurant, three days before the cruise. By embarkation day, he could barely walk. The ship's medical center became our first stop.\n\nThe doctor was kind but direct. 'He needs rest. Fluids. Probably two days in the cabin.'\n\nTwo days. Nearly half our honeymoon. I wanted to cry.\n\nThe purser found us that afternoon. 'I heard about your situation,' she said. 'We'd like to help.'\n\nHelp came in forms I hadn't expected. Room service at no extra charge, delivered whenever we wanted. A private tour of the ship when my husband felt well enough, avoiding the crowds. Priority dining reservations for our first real meal together. A bottle of champagne 'with the ship's compliments.'\n\n'Why?' I asked the purser. 'We're just regular passengers.'\n\nShe smiled. 'Liberty has a tradition. When Mira Sorvino named this ship, she talked about freedom — not just the name, but the reality. Freedom to celebrate, to recover, to be cared for. We try to honor that.'\n\nI didn't know if the tradition was real or if she'd invented it on the spot to make me feel better. Either way, it worked.\n\nBy day three, my husband had recovered enough to walk the deck. By day four, we were eating in the main dining room, laughing about the disaster that had become an unexpected gift.\n\n'We'll remember this cruise forever,' he said.\n\n'Because you got sick?'\n\n'Because the ship took care of us when we couldn't take care of ourselves.'\n\nMira Sorvino blessed Carnival Liberty in 2005. She spoke words about freedom and joy and the adventures that awaited passengers. She smashed a bottle of champagne against the hull.\n\nSomewhere in that blessing, maybe she prayed for couples like us. Honeymooners whose plans fell apart. Guests who needed grace when they'd paid for celebration.\n\nI'll never know if the tradition the purser mentioned was real. But the care was real. The champagne was real. The recovery, physical and emotional, was real.\n\n**The lesson:** Ships carry their naming ceremonies forward. When a godmother blesses a vessel, that blessing doesn't end with the champagne. It echoes through every crew member who says 'we try to honor that' and means it.",
      "author": {
        "name": "Amanda K.",
        "location": "Richmond, VA"
      }
    },
    {
      "title": "What Eastern Caribbean Taught Me",
      "persona_label": "Itinerary Appreciation",
      "intended_reader": "Cruisers debating Eastern vs Western Caribbean routes",
      "core_insight": "Eastern Caribbean ports offer different gifts than their Western counterparts",
      "markdown": "**I'd always cruised Western Caribbean. Liberty's Eastern route showed me what I'd been missing.**\n\nCozumel. Costa Maya. Roatan. These were my ports — familiar, comfortable, beloved. Western Caribbean from Galveston or New Orleans was home.\n\nThen we cruised Liberty from Port Canaveral. Eastern Caribbean. Ports I'd only seen on maps.\n\nSt. Thomas stopped me in my tracks.\n\nThe harbor was different — steep hills rising directly from the water, houses painted in colors no subdivision would permit. The history was different — Charlotte Amalie with its Danish colonial architecture and centuries of trade. The feeling was different — less resort, more place.\n\n'This feels like somewhere,' I told my husband.\n\n'We're always somewhere.'\n\n'No, I mean — this feels like it exists without us. Not built for tourists. Just... existing.'\n\nSan Juan reinforced the feeling. We walked Old San Juan's cobblestone streets, touched the walls of El Morro fort, stood where conquistadors had stood and where history had happened.\n\n'This isn't a cruise port,' my husband said. 'This is a city with a cruise port attached.'\n\nExactly.\n\nWestern Caribbean ports are wonderful. But many feel purpose-built — destinations designed around cruise ships, experiences curated for limited time. Eastern Caribbean ports feel like places you're briefly allowed to visit.\n\nLiberty sailed us through Turks and Caicos, St. Maarten, San Juan, St. Thomas. Each one deeper than expected. Each one teaching me something about history, about Caribbean culture, about the difference between 'tourist destination' and 'place that accepts tourists.'\n\nI haven't abandoned Western Caribbean. Those ports still hold memories. But I've added Eastern to my vocabulary now. Both languages, both experiences, both versions of what Caribbean cruising can mean.\n\n**The lesson:** Different itineraries teach different things. Western Caribbean offers accessible adventure. Eastern Caribbean offers glimpses of places that existed before cruise ships and will exist after. Both are worthy. Both deserve exploration.",
      "author": {
        "name": "Sandra M.",
        "location": "Jacksonville, FL"
      }
    },
    {
      "title": "The Retractable Roof Revelation",
      "persona_label": "Weather Adaptation",
      "intended_reader": "Cruisers worried about weather ruining pool days",
      "core_insight": "Liberty's retractable roof pool offers swimming whatever the weather",
      "markdown": "**Rain on sea days used to ruin cruises. Then I discovered Liberty's retractable roof pool.**\n\nFlorida weather is unpredictable. Caribbean weather more so. Every cruise brings the risk of days when the pool deck becomes uninhabitable — rain driving everyone indoors, the main attraction suddenly off-limits.\n\nLiberty changed that calculation.\n\nOur cruise hit weather on day three. Tropical system to the east, moving our direction. The captain announced rough seas and rain for at least 24 hours.\n\nI groaned. My kids groaned. Another sea day trapped indoors, watching movies in the cabin, waiting for weather to clear.\n\n'Have you been to the midship pool?' another passenger asked at breakfast. 'It has a roof.'\n\nI'd seen it in the brochures but hadn't processed what it meant. A retractable Magrodome roof that could close over the pool area, creating an indoor space that was still technically poolside.\n\nWe went. We swam. The rain poured outside the closed roof while we splashed in warm water, protected but still feeling like part of the ship.\n\n'This is cheating,' my daughter said happily.\n\n'How so?'\n\n'It's raining but we're swimming. That's not supposed to work.'\n\nThe pool area filled quickly — every family who'd had the same revelation. But even full, it felt like celebration. We'd beaten the weather. We'd found the loophole. The storm raged and we swam anyway.\n\nThat evening, the rain stopped. The crew opened the roof, revealing stars where glass had been. The transition was seamless — indoor to outdoor in minutes, weather no longer the determining factor.\n\n'I'm only booking ships with retractable pools from now on,' my husband declared.\n\n'That limits options.'\n\n'Worth it.'\n\nHe's right. The freedom to swim regardless of weather transforms the cruise experience. No more checking forecasts anxiously. No more adjusting expectations based on clouds. Just... swimming.\n\n**The lesson:** Innovation isn't always dramatic. Sometimes it's a roof that moves. A pool that works in any weather. A solution so elegant you wonder why every ship doesn't have it.",
      "author": {
        "name": "Lisa and Tom F.",
        "location": "Charlotte, NC"
      }
    },
    {
      "title": "When the Wheelchair Didn't Fit",
      "persona_label": "Accessibility Navigation",
      "intended_reader": "Wheelchair users researching cruise accessibility",
      "core_insight": "Accessibility challenges are real, but crew creativity is realer",
      "markdown": "**My husband's wheelchair was too wide for the cabin bathroom. The crew found solutions I hadn't imagined.**\n\nWe'd booked an accessible cabin on Liberty. Researched the specs. Called ahead. Did everything right.\n\nWhat we didn't anticipate was that my husband's particular wheelchair — a specialized model for his condition — was wider than standard. The bathroom doorway in our 'accessible' cabin couldn't accommodate it.\n\nI felt my heart sink when we realized. A week on a cruise ship where my husband couldn't use the bathroom independently. The vacation was over before it started.\n\n'Let me make some calls,' our cabin steward said. 'Wait here.'\n\nThirty minutes later, the chief purser appeared with options.\n\n'We have three possibilities,' she explained. 'First, we have a narrower wheelchair we can loan you for cabin use. Second, we can relocate you to a cabin with a wider doorway — it's on a different deck, but it would solve the problem. Third, we can bring a commode into your current cabin if you prefer to stay put.'\n\nI was stunned. Not by the options — by the speed. In thirty minutes, they'd assembled a team, identified solutions, and presented them without once making us feel like a problem.\n\nWe chose the cabin relocation. Within two hours, we'd moved to a slightly different accessible cabin with a doorway that accommodated the chair.\n\n'How often does this happen?' I asked the purser.\n\n'More than you'd think. Wheelchair sizes vary. What the industry calls \"accessible\" doesn't always mean what passengers need. We've learned to adapt.'\n\n'You were so fast.'\n\n'Because we care. Your husband deserves a vacation. Our job is to make that happen.'\n\nThe rest of the cruise was smooth. The new cabin worked perfectly. The crew throughout the ship had clearly been briefed — everyone from the dining room staff to the pool attendants seemed to know my husband's name and his needs.\n\n'They're treating me like a VIP,' he said on day four.\n\n'You are a VIP.'\n\n'I'm a guy in a wheelchair.'\n\n'On this ship, same thing.'\n\nLiberty's crew didn't make disability disappear. The challenges remained: doorways to navigate, elevators to wait for, transfers that required help. But they made those challenges feel manageable. Solvable. Part of the vacation rather than obstacles to it.\n\n**The lesson:** Accessibility isn't just about specs and doorway widths. It's about crews who see problems as puzzles rather than impossibilities, who move cabins in hours rather than apologizing for limitations. The ship's design might have gaps; the people fill them.",
      "author": {
        "name": "Martha R.",
        "location": "Gainesville, FL"
      }
    },
    {
      "title": "Five Pools, Five Lessons",
      "persona_label": "Ship Exploration",
      "intended_reader": "Cruisers who stick to one area and miss the rest",
      "core_insight": "Large ships reward exploration; each pool area has its own personality",
      "markdown": "**I spent our first Liberty cruise at one pool. Our second cruise, I discovered four more.**\n\nThe Lido pool is obvious. Center of the ship, surrounded by Guy's Burger Joint and the buffet, always crowded, always energetic. It's where first-time cruisers end up because it's where the signs point.\n\nI stayed there our entire first cruise. I didn't know there were alternatives.\n\nThe second cruise, my husband went exploring on sea day. He came back with a revelation.\n\n'There are other pools. Empty ones.'\n\n'What?'\n\n'Follow me.'\n\nHe led me to the aft pool — quieter, smaller, overlooking the wake. Maybe twenty people compared to the hundreds at Lido. Adults reading books instead of kids shrieking.\n\n'How did we miss this?'\n\nWe found the retractable roof pool next. Different vibe again — more controlled environment, less chaos, popular with families who wanted swimming without sun exposure.\n\nThen Serenity. The adults-only retreat I'd seen mentioned in brochures but assumed was just another deck. It wasn't. It was a sanctuary: padded loungers, dedicated bar service, hot tubs that weren't overflowing with teenagers.\n\nEach pool area had its own personality:\n\n- Lido: Party central. Energy. Music. The cruise ship experience travel ads show.\n- Aft pool: Quieter. Wake watching. Conversations possible without shouting.\n- Retractable: Climate controlled. Swimmers regardless of weather. Families with small children.\n- Serenity: Peace. Adults. Books. Cocktails delivered to your lounger.\n- Forward deck: Sometimes available, usually empty. Best sunrise views.\n\n'We were doing it wrong,' I told my husband after our exploration day.\n\n'We were doing it narrow. There's more ship than we knew.'\n\nWe now cruise Liberty differently. Morning at Serenity with coffee and books. Afternoon at Lido when we want energy. Sunset at the aft pool, watching our wake trail toward the horizon.\n\nThe ship is the same. Our experience of it has expanded.\n\n**The lesson:** Large ships hide their secrets. The obvious spot isn't always the best spot. The crowds cluster where signs point; the exploration reveals where peace lives.",
      "author": {
        "name": "Carol and Dan S.",
        "location": "Miami, FL"
      }
    },
    {
      "title": "What the Venetian Palace Taught My Daughter",
      "persona_label": "Arts Appreciation",
      "intended_reader": "Parents wondering if cruise ship entertainment has cultural value",
      "core_insight": "Cruise ship shows can spark lifelong appreciation for performing arts",
      "markdown": "**My daughter saw her first live musical in the Venetian Palace theater. She's now a theater major.**\n\nEmma was eight when we cruised Liberty. She'd never seen a Broadway show, never been inside a real theater. Our small town didn't offer those opportunities, and trips to New York were beyond our budget.\n\nThe Venetian Palace changed everything.\n\nThe venue itself impressed her — 1,500 seats, multi-deck theater, lights and sound systems that rivaled any land-based space I'd visited. But it was the show that captured her.\n\nPlaylist Productions had created something called 'Piano Bar: The Show' — a musical revue featuring songs, stories, and performers who could actually perform. The talent was professional. The production was polished. The experience was transformative.\n\nI watched Emma's face more than the stage. The way her eyes widened during the dance numbers. The way she mouthed along to songs she somehow already knew. The way she leaned forward during quiet moments, completely absorbed.\n\nAfter the show, she wanted to know everything.\n\n'How do they learn all those songs?'\n'Do they live on the ship?'\n'Can you make money doing that?'\n'Can I try someday?'\n\nWe saw every show that cruise. Three different productions, each one feeding her growing fascination. She asked the performers for autographs. She asked the house manager how the lights worked. She asked me if there were jobs where people got to do this.\n\n'Yes,' I said. 'It's called theater.'\n\n'I want to do theater.'\n\nShe meant it. Middle school led to drama club. High school led to musicals. College led to a theater major at a state university.\n\nShe performed in her first college production last fall. I flew out to see it. Sitting in the audience, watching her on stage, I remembered the Venetian Palace. The moment something sparked. The beginning of a path she's still walking.\n\n'Did you know?' I asked her after the show. 'Back on that cruise? Did you know this is where you were headed?'\n\n'I knew I wanted to feel what those performers felt. The rest just... followed.'\n\nCarnival Liberty's entertainment program isn't the Metropolitan Opera. But it's live. It's professional. It's accessible to an eight-year-old girl from a small town who might never have discovered her passion without it.\n\n**The lesson:** Don't skip the shows because they're 'cruise ship entertainment.' Someone's child might be watching who needs to see that path exists. The Venetian Palace made a theater major. That's not nothing.",
      "author": {
        "name": "Michelle T.",
        "location": "Knoxville, TN"
      }
    },
    {
      "title": "The Liberty of Letting Go",
      "persona_label": "Control Release",
      "intended_reader": "Type-A planners struggling to relax on vacation",
      "core_insight": "The ship's name is an invitation to practice what it preaches",
      "markdown": "**I'm a planner. Carnival Liberty taught me to stop.**\n\nEvery vacation before the cruise had been scheduled to the hour. Museums at 9 AM. Lunch reservations at 12:30. Tours at 2 PM. Dinner at 7. The itinerary was the vacation; spontaneity was failure.\n\nMy wife had endured this for twenty years of marriage. She finally staged an intervention.\n\n'One cruise,' she said. 'No plans. None. We get on the ship and see what happens.'\n\n'But the specialty dining—'\n\n'No.'\n\n'And the excursions—'\n\n'No.'\n\n'What if we miss something important?'\n\nShe looked at me with that expression I'd learned to recognize. 'What if missing something is the point?'\n\nWe boarded Liberty with nothing scheduled. No dining reservations. No excursion bookings. No daily activity plan highlighted and timed.\n\nThe anxiety hit immediately.\n\n'What do we do now?' I asked as we stood in the atrium.\n\n'I don't know. Let's find out.'\n\nWe wandered. Found the pool deck. Sat down. Stayed for two hours. No schedule pushing us forward.\n\nAt lunch, we ate when we were hungry rather than when the reservation demanded. At dinner, we chose the main dining room on a whim, without the safety net of confirmed seating.\n\nIn Nassau, we walked off the ship with no plan. Found a beach. Stayed until we didn't want to anymore. Returned when we felt like it.\n\nThe transformation happened slowly. Day one, I kept checking my phone for the schedule that didn't exist. Day two, I stopped checking. Day three, I forgot I'd ever needed a schedule.\n\n'You're smiling,' my wife noticed at dinner that night.\n\n'I don't know what we're doing tomorrow.'\n\n'And?'\n\n'And I don't care. For the first time in my life, I genuinely don't care what we're doing tomorrow.'\n\nLiberty. The ship's name became instruction. Liberty from my compulsive planning. Liberty from the anxiety that had made vacations feel like work. Liberty from the belief that experiences needed to be captured, scheduled, and controlled to count.\n\nWe've cruised Liberty twice more since then. Each time, I practice letting go. Each time, it's a little easier.\n\n**The lesson:** The ship is named Liberty. Maybe that's not accident. Maybe it's invitation. Maybe every embarkation on this ship is a chance to practice what the name preaches — freedom from the chains we put on ourselves.",
      "author": {
        "name": "Robert L.",
        "location": "Nashville, TN"
      }
    }
  ]
}
