{
  "ship": "Carnival Luminosa",
  "ship_class": "Spirit Class",
  "cruise_line": "Carnival Cruise Line",
  "last_updated": "2026-01-20",
  "content_protocol": "ICP-Lite v1.0",
  "stories": [
    {
      "title": "Australia Got Its Own Carnival Ship",
      "persona_label": "Australian Cruiser",
      "intended_reader": "Australian passengers evaluating year-round Brisbane options",
      "core_insight": "Luminosa's Brisbane homeporting delivers genuine Carnival experience to Queensland",
      "markdown": "**We've cruised from Sydney. We've cruised from Melbourne. Brisbane is finally ours.**\n\nAustralian cruisers have watched Carnival operate seasonally for years. Ships would visit during Australian summer, then sail away. Queensland never had dedicated presence.\n\nLuminosa changed that. Year-round Brisbane homeporting means Queensland finally has a proper cruise ship. We can cruise from our local port without traveling to other cities first.\n\nThe convenience transformation is substantial. Drive to Brisbane, board, explore the South Pacific. No flights to Sydney, no hotels before embarkation, no interstate logistics.\n\nLuminosa feels like our ship now. Brisbane passengers recognize each other. The crew knows our preferences. The community built around dedicated service.\n\n**For Queensland cruisers:** Luminosa is yours. Year-round service from Brisbane means no more seasonal hunting. Book directly without interstate complications.",
      "author": {
        "name": "David and Sarah M.",
        "location": "Gold Coast, QLD"
      }
    },
    {
      "title": "Spirit-Class Ships Feel Right for Australia",
      "persona_label": "Size Evaluator",
      "intended_reader": "Australian cruisers comparing ship sizes for regional waters",
      "core_insight": "Spirit-class dimensions suit Australian ports and itineraries",
      "markdown": "**Mega-ships can't visit half our ports. Luminosa can.**\n\nAustralian port infrastructure varies dramatically. Some ports handle massive ships; others have size restrictions. Spirit-class ships navigate that reality.\n\nLuminosa at 92,000 GT fits ports that larger ships can't reach. More destination options, more diverse itineraries, better exploration of Australia's coast and Pacific islands.\n\nThe size also feels appropriate for Australian cruise culture. We're not looking for floating cities; we're looking for ship experiences that complement shore experiences. Luminosa balances those priorities.\n\nSea days on Spirit-class ships feel less crowded. The pool deck isn't chaos. The restaurants don't require early reservations. The space-to-passenger ratio works.\n\n**For Australian cruisers:** Spirit-class serves our market well. Luminosa's size opens destinations mega-ships can't reach while providing comfortable cruising.",
      "author": {
        "name": "Peter J.",
        "location": "Brisbane, QLD"
      }
    },
    {
      "title": "The Light Theme Lives Up to Its Name",
      "persona_label": "Design Appreciator",
      "intended_reader": "Cruisers interested in ship design and atmosphere",
      "core_insight": "Luminosa's 'luminous' theming creates genuinely brighter, more open atmosphere",
      "markdown": "**Luminosa means luminous. The ship delivers brightness.**\n\nThe naming could have been marketing fluff. Instead, the design team apparently took 'luminous' seriously. The public spaces feel brighter, more open, more inviting than darker-themed ships.\n\nCrystal elements throughout catch and reflect light. The atrium uses natural illumination effectively. Evening lighting creates warmth without gloom. The atmosphere lives up to the name.\n\nI noticed the brightness most at breakfast. Morning light floods the restaurants, creating cheerful atmosphere that darker ships lack. The design choices affect mood.\n\nThe Costa heritage shows in European attention to lighting design. Italian sensibility about illumination — something American ship design sometimes ignores — shapes passenger experience.\n\n**For atmosphere-sensitive cruisers:** Luminosa's brightness is deliberate. If you prefer light over dark, open over enclosed, this ship delivers the named promise.",
      "author": {
        "name": "Rebecca T.",
        "location": "Sydney, NSW"
      }
    },
    {
      "title": "South Pacific Itineraries Exceeded Expectations",
      "persona_label": "Destination Seeker",
      "intended_reader": "Cruisers interested in South Pacific island destinations",
      "core_insight": "Brisbane positioning enables exceptional South Pacific access",
      "markdown": "**Brisbane to Fiji is closer than I realized. Luminosa exploited that geography.**\n\nSouth Pacific cruising from American ports requires transoceanic sailing. From Brisbane, it's a short hop. Luminosa's itineraries leverage that advantage.\n\nOur cruise visited Vanuatu, New Caledonia, and multiple ports with substantial time at each. The sailing-to-port ratio favored exploration over transit. We saw more, sailed less.\n\nThe destinations themselves captivated. Port Vila's markets, Noumea's French-influenced culture, island beaches that rival anywhere in the world. South Pacific delivers what Caribbean cruises promise.\n\nLuminosa handles the Pacific well. The ship's stability through open ocean passages impressed. Spirit-class seakeeping works for real ocean cruising.\n\n**For destination-focused cruisers:** South Pacific itineraries from Brisbane are underrated. Luminosa accesses islands most American cruises can't reach efficiently.",
      "author": {
        "name": "Michelle K.",
        "location": "Brisbane, QLD"
      }
    },
    {
      "title": "Phoenix Theatre Rose to Entertainment Expectations",
      "persona_label": "Entertainment Evaluator",
      "intended_reader": "Cruisers prioritizing production shows and onboard entertainment",
      "core_insight": "Phoenix Theatre delivers quality entertainment with mythological naming",
      "markdown": "**The phoenix rises from ashes. Luminosa's theater rises to occasions.**\n\nThe naming choice intrigued me. A theater named Phoenix on a ship transferred between brands? The rebirth symbolism seemed intentional.\n\nThe theater delivers. Spirit-class proportions create intimate entertainment venue. Performers connect with audiences directly. The energy exchange that makes live shows special happens naturally.\n\nAustralian entertainment preferences shaped the programming. Different comedians than American ships, different music selections, different cultural references. The adaptation showed Carnival's market awareness.\n\nI attended four shows during our cruise. Each felt tailored for Australian audiences without sacrificing production quality. Phoenix Theatre earned its mythological name.\n\n**For entertainment seekers:** Phoenix Theatre proves Spirit-class can deliver show quality. The intimate scale enhances rather than limits. Australian programming adds local flavor.",
      "author": {
        "name": "Andrew C.",
        "location": "Melbourne, VIC"
      }
    },
    {
      "title": "Piazza Venezia Anchored Ship Life",
      "persona_label": "Public Space Appreciator",
      "intended_reader": "Cruisers who prioritize communal gathering spaces",
      "core_insight": "The Italian-named atrium creates genuine community gathering space",
      "markdown": "**Every ship needs a heart. Piazza Venezia is Luminosa's.**\n\nThe atrium concept works when done well. Luminosa's Piazza Venezia — named for Rome's famous square — succeeds at creating community hub.\n\nPassengers naturally gravitate there. Morning coffee while watching ocean through massive windows. Afternoon drinks while entertainment performs. Evening gathering before dinner or shows. The space draws people.\n\nThe Costa heritage shows in the piazza design. European sensibility about public gathering space shaped the proportions, the seating, the flow. The result feels lived-in, comfortable, welcoming.\n\nBy cruise end, I knew Piazza Venezia regulars. We'd wave across the atrium, share tables during entertainment, form the casual community cruising creates. The space enabled those connections.\n\n**For community-oriented cruisers:** Piazza Venezia facilitates the social aspects of cruising. The space invites gathering. Find your spot and become a regular.",
      "author": {
        "name": "Linda S.",
        "location": "Perth, WA"
      }
    },
    {
      "title": "My Wheelchair Explored Australia By Sea",
      "persona_label": "Mobility Accessibility",
      "intended_reader": "Australian wheelchair users evaluating cruise options",
      "core_insight": "Luminosa delivers genuine accessibility for Australian wheelchair cruisers",
      "markdown": "**Australian accessibility laws apply at sea. Luminosa complies.**\n\nCruise ship accessibility varies wildly. International ships operating in Australian waters face different regulatory environments. Not all ships meet Australian expectations.\n\nLuminosa exceeded my requirements. The ship was built to European standards, transferred to American brand, now serving Australian market. The combination of regulatory influences created comprehensive accessibility.\n\nMy accessible cabin was properly sized with Australian-standard bathroom facilities. Public spaces accommodated my power wheelchair throughout. The crew understood disability etiquette — professional assistance without condescension.\n\nThe tender ports presented typical challenges. Isle of Pines required beach wheelchair assistance. But docked ports worked perfectly. Brisbane embarkation was seamless.\n\n**For Australian wheelchair users:** Luminosa handles accessibility well. International maritime standards align with Australian expectations. The cruise experience works.",
      "author": {
        "name": "James R.",
        "location": "Sunshine Coast, QLD"
      }
    },
    {
      "title": "Taurus Restaurant Delivered Every Night",
      "persona_label": "Main Dining Enthusiast",
      "intended_reader": "Traditional cruisers who prioritize main dining room experience",
      "core_insight": "Taurus Restaurant provides consistent quality with Australian market adaptations",
      "markdown": "**Main dining is where cruise experiences are made. Taurus delivered.**\n\nSome cruisers chase specialty restaurants. We build vacations around main dining — the assigned seating, the developing relationships with waiters, the nightly anticipation.\n\nTaurus Restaurant on Luminosa honored that tradition. The room's proportions felt right for Spirit-class intimacy. The service showed Carnival training with Australian warmth. The food quality held steady every night.\n\nOur waiter Roberto learned our preferences immediately. My husband's dietary restrictions were accommodated without fuss. My cocktail appeared before I ordered. The personalization that makes cruising special.\n\nMenu adaptations for Australian tastes showed market awareness. Lamb featured prominently. The wine list included Australian options. The little adjustments accumulated into appropriate experience.\n\n**For main dining devotees:** Taurus Restaurant delivers. Request traditional seating for best service. Build relationships with your waiters — it's how cruising works best.",
      "author": {
        "name": "Margaret and Robert T.",
        "location": "Adelaide, SA"
      }
    },
    {
      "title": "The Costa Transfer Created Something Unique",
      "persona_label": "Transfer Ship Observer",
      "intended_reader": "Cruise enthusiasts interested in inter-brand ship transfers",
      "core_insight": "Costa-to-Carnival transfer created distinctively European-influenced Carnival ship",
      "markdown": "**Luminosa was built as Costa Luminosa. The Italian heritage persists.**\n\nCarnival added their signatures — Guy's Burger Joint, BlueIguana Cantina, the Fun Ship programming. But underneath, Costa's European design sensibility remains.\n\nThe spaces feel different than American-built Carnival ships. The proportions reflect European preferences. The lighting shows Italian attention to illumination. The details demonstrate Continental craftsmanship.\n\nThe blend creates something neither Costa nor Carnival would build independently. European sophistication with American fun. The combination works better than either component alone.\n\nAustralian cruisers benefit from this cultural mixture. We're neither fully American nor fully European in our preferences. Luminosa's hybrid identity suits our market.\n\n**For design-curious cruisers:** Notice the Costa heritage beneath Carnival additions. The European influence enriches the experience in subtle ways.",
      "author": {
        "name": "Christopher L.",
        "location": "Canberra, ACT"
      }
    },
    {
      "title": "Brisbane Finally Has Year-Round Cruising",
      "persona_label": "Industry Perspective",
      "intended_reader": "Australian cruise enthusiasts following market developments",
      "core_insight": "Luminosa's dedicated Brisbane service transforms Queensland cruise market",
      "markdown": "**Queensland has wanted dedicated cruise capacity for years. Luminosa finally delivers.**\n\nThe Australian cruise market has grown substantially. Sydney and Melbourne got year-round ships years ago. Brisbane remained seasonal — ships visiting summer, departing for winter.\n\nLuminosa's year-round Brisbane commitment changes Queensland cruising fundamentally. Dedicated capacity means market development investment, local crew familiarity, itinerary optimization for regional preferences.\n\nThe Spirit-class choice suits Australian realities. Port infrastructure, market size, destination requirements — the 92,000 GT platform fits better than mega-ships would.\n\nExpect Brisbane cruise culture to develop now. Local travel agencies building cruise specialties, port facilities improving, passenger volume justifying expansion. Luminosa anchors regional market maturation.\n\n**For Queensland cruise watchers:** This is the beginning, not the peak. Year-round service enables market development that seasonal deployment couldn't support.",
      "author": {
        "name": "Dr. Marcus W.",
        "location": "Brisbane, QLD"
      }
    },
    {
      "title": "Solo in the South Pacific Changed Everything",
      "persona_label": "Solo Traveler",
      "intended_reader": "Single travelers considering solo cruising from Australia",
      "core_insight": "Luminosa's intimate Spirit-class size creates natural connections for solo travelers",
      "markdown": "**I booked this cruise to escape. I found something unexpected instead.**\n\nAfter my divorce finalized, I needed to be somewhere that wasn't home. Somewhere the walls didn't echo with arguments. My therapist suggested travel. My bank account suggested a cruise from Brisbane would be more affordable than flying halfway around the world.\n\nLuminosa was my first solo cruise. I worried constantly during the boarding process. Would I look pathetic eating alone? Would couples stare? Would the loneliness I was fleeing simply follow me onto the ship?\n\nThe first dinner in Taurus Restaurant tested every fear. The maitre d' seated me at a table for two by the window. I ordered wine I couldn't really afford and pretended to study the menu while fighting back tears.\n\nThen she appeared. A crew member named Rosa noticed my distress without me saying a word. She didn't hover or make a scene. She simply stopped by my table between courses, shared stories about her home in the Philippines, asked about my plans for Vanuatu. By dessert, I'd laughed more than I had in months.\n\nPiazza Venezia became my morning ritual. Coffee, ocean views, watching other passengers wake up to vacation. The space invites lingering without judgment. Solo travelers blend naturally into the community there.\n\nBy day three, I'd found my people. A widow from Melbourne who'd been cruising alone for years. A retired teacher from Perth celebrating her sixtieth birthday with herself. A young professional from Sydney taking a break between jobs. We claimed our corner of the pool deck and shared our stories.\n\nThe service recovery moment came in Noumea. I'd booked a shore excursion alone, then panicked at the meeting point when I realized I'd be the only single person on a couples' snorkeling tour. The excursion coordinator noticed my hesitation and quietly moved me to a smaller group — other solo travelers she'd identified from the manifest.\n\nLuminosa's Spirit-class intimacy made the difference. On a mega-ship, I'd have been anonymous, lost in crowds. On this ship, the crew learned my name. The bartenders remembered my order. The dining staff noticed when I needed company and when I needed solitude.\n\nI returned to Brisbane different. Not healed — that takes longer than a week — but reminded that connection is possible. That strangers can become friends. That being alone doesn't mean being lonely.\n\n**For solo travelers:** Luminosa's size works for us. The ship is small enough that you'll be seen, large enough that you can disappear when needed. Book it. Let the South Pacific show you who you are without someone else defining it.",
      "author": {
        "name": "Jennifer S.",
        "location": "Brisbane, QLD"
      }
    },
    {
      "title": "Three Generations Discovered the Pacific Together",
      "persona_label": "Family Traveler",
      "intended_reader": "Australian families considering multigenerational cruise vacations",
      "core_insight": "Luminosa accommodates diverse family needs while creating shared experiences",
      "markdown": "**Mum wanted relaxation. The kids wanted waterslides. I wanted everyone to stop arguing.**\n\nPlanning a holiday with my mother, my husband, and our two kids aged eight and twelve felt like negotiating a peace treaty. Everyone had different needs. Everyone had strong opinions. The caravan trip last year had nearly ended in divorce.\n\nLuminosa offered something different. Everyone could have what they wanted without forcing compromise.\n\nThe kids discovered Camp Ocean immediately. Within hours, they'd made friends from Perth and formed an alliance for mini-golf tournaments. They'd disappear after breakfast and return exhausted at dinner, full of stories about activities I'd never have organised myself.\n\nMum claimed her spot on the Serenity deck. At seventy-two, she wanted quiet reading, ocean views, and cocktails delivered to her lounger. The adults-only space gave her exactly that while we managed the children elsewhere.\n\nMy husband found Guy's Burger Joint and the sports deck. His definition of vacation involves eating without guilt and shooting basketball. Luminosa provided both.\n\nTaurus Restaurant brought us together each evening. The staff handled our complicated family dynamics with grace. The kids got meals they'd actually eat. Mum got wine recommendations. We got a table large enough for three generations without feeling cramped.\n\nThe service recovery story involves my son's meltdown on day three. Overstimulated, overtired, melting down spectacularly in Piazza Venezia. I was mortified. My mother was judging. My husband was useless.\n\nA crew member named Marco appeared like magic. He didn't scold or stare. He asked my son's name, complimented his dinosaur t-shirt, and invited him to see the bridge. Twenty minutes later, my son returned calm, clutching a certificate declaring him Junior Navigator.\n\nThe port stops created shared memories. Snorkeling in Vanuatu with all three generations. Exploring Noumea's markets together. My mother holding my daughter's hand as they selected souvenirs. Moments I couldn't have manufactured at home.\n\nLuminosa's Spirit-class size meant we were never overwhelmed. The ship felt navigable even for Mum, whose knees aren't what they were. The elevators actually arrived. The dining room wasn't a twenty-minute walk.\n\n**For Australian families:** Luminosa works for everyone because it doesn't force everyone together. The ship gives each generation their space while creating moments of connection. Book it before the kids are too old to care about Camp Ocean.",
      "author": {
        "name": "Catherine and David M.",
        "location": "Melbourne, VIC"
      }
    },
    {
      "title": "Our Honeymoon in the Coral Sea",
      "persona_label": "Honeymoon Traveler",
      "intended_reader": "Australian newlyweds planning honeymoon cruises",
      "core_insight": "Luminosa delivers romantic South Pacific honeymoon without overseas flight complications",
      "markdown": "**We couldn't afford Fiji. Luminosa took us there anyway.**\n\nOur wedding ate the budget. By the time the last invoice cleared, the elaborate overseas honeymoon we'd imagined had shrunk to whatever we could manage within driving distance of Sydney.\n\nThen James found Luminosa's South Pacific itineraries from Brisbane. Fly to Brisbane — cheap. Seven nights exploring islands we'd dreamed about — surprisingly affordable. Return home having actually honeymooned somewhere beautiful — priceless.\n\nThe balcony cabin made every dollar worth it. Waking up next to my new husband with the Pacific Ocean outside our window. Morning coffee watching flying fish skip across waves. Sunset champagne as we sailed toward our next destination.\n\nLuminosa understood we were honeymooners without us announcing it. The dining staff noticed our rings immediately. Our waiter in Taurus Restaurant, Emmanuel, brought us complimentary dessert wine on our second night. 'For the newlyweds,' he said with a wink. Small gesture, enormous impact.\n\nThe emotional pivot happened in Port Vila. We'd booked a beach excursion, imagining postcard-perfect romance. What we got was rain. Torrential, tropical, vacation-ruining rain.\n\nI wanted to cry. James wanted to return to the ship. Then our tour guide, a local woman named Grace, redirected the whole group to her family's restaurant. We spent the afternoon eating fresh seafood, learning to cook coconut bread, hearing stories about island life during cyclone seasons.\n\nWe returned to Luminosa with a recipe, a new perspective, and a story better than any beach photo. The ship's guest services team had already arranged for our wet clothes to be laundered, complimentary, waiting in our cabin when we returned.\n\nCloud 9 Spa became our honeymoon indulgence. Couples massage overlooking the ocean. Thermal suite passes for sea days. Time together, deliberately, without screens or schedules.\n\nThe European design heritage from Luminosa's Costa origins added romance the American-built ships might lack. The lighting felt intentional. The spaces felt intimate. The atmosphere suggested European café culture more than Las Vegas excess.\n\n**For Australian honeymooners:** Luminosa delivers the South Pacific honeymoon without South Pacific prices. The balcony cabin is worth the upgrade. The crew will celebrate your new marriage without prompting. Book it before real life resumes.",
      "author": {
        "name": "Emma and James T.",
        "location": "Sydney, NSW"
      }
    },
    {
      "title": "Seventy-Five and Finally Seeing the Islands",
      "persona_label": "Elderly Traveler",
      "intended_reader": "Older Australian travelers considering their first or return cruise",
      "core_insight": "Luminosa's manageable size and attentive crew serve elderly passengers exceptionally",
      "markdown": "**My husband promised we'd see the Pacific islands when we retired. He passed before we could go.**\n\nTwenty years of retirement. Twenty years of saying 'next year' and 'when we're ready' and 'after we sort out the house.' Then Barry was gone, and the Pacific islands remained unseen.\n\nMy daughter convinced me to try. 'Mum, you're seventy-five, not dead. Dad would want you to go.' She helped me book Luminosa, arranged the accessible cabin even though I don't use a wheelchair yet, and drove me to Brisbane herself.\n\nI was terrified. First cruise alone. First major trip without Barry. First time relying on strangers to help an old woman navigate something new.\n\nLuminosa's crew became my temporary family.\n\nMy cabin steward, Dante, checked on me daily. Not intrusively — just a gentle knock, a quick hello, making sure the room temperature was comfortable and I had everything I needed. He learned that Barry had passed recently. He shared stories about his own grandmother in the Philippines. Small connections that made the loneliness bearable.\n\nPhoenix Theatre surprised me. I hadn't been to a show in years — Barry always chose the television. The production quality impressed, but more importantly, the crew noticed me sitting alone and ensured I had an aisle seat, easy to exit if needed.\n\nThe service recovery moment came on the tender to Isle of Pines. The small boat felt unstable. My balance isn't what it was. Panic rose in my chest.\n\nTwo crew members materialised immediately. They helped me board with dignity, seated me in the most stable section, and one stayed beside me for the entire crossing. When we arrived at that impossibly beautiful beach, they helped me to a shaded chair and brought me a cold drink without being asked.\n\n'Mrs. Morrison, is there anything else you need?' one asked.\n\nI needed Barry. I needed twenty more years with my husband. But what I said was 'no, this is perfect,' and in that moment, it was.\n\nLuminosa's Spirit-class size meant I never felt lost. The ship is large enough for variety but small enough to learn. By day four, I knew my routes. By day six, I knew the staff. By disembarkation, I'd promised to return.\n\n**For older travelers:** Luminosa handles us gently. The crew notices. The size works. The destinations are worth seeing while we still can. Don't wait another twenty years.",
      "author": {
        "name": "Dorothy M.",
        "location": "Toowoomba, QLD"
      }
    },
    {
      "title": "My First Journey Without Him",
      "persona_label": "Widow Traveler",
      "intended_reader": "Widowed travelers navigating grief while considering travel",
      "core_insight": "Luminosa provides gentle support for passengers traveling after loss",
      "markdown": "**Robert died fourteen months ago. I booked this cruise to prove I still existed.**\n\nGrief counseling suggested finding activities that were mine, not ours. Travel had always been ours. Every trip, every destination, every adventure — we'd done them together for forty-three years. Could I travel without him?\n\nMy counselor asked: 'Did you travel before Robert?' I had. Barely remembered it, but yes. 'Then you're not learning something new. You're remembering something old.'\n\nLuminosa became my test case. Close enough that failure wouldn't strand me far from home. Long enough that success would mean something. Different enough that I wouldn't be haunted by memories of trips we'd taken together.\n\nI almost didn't board. Standing in the Brisbane terminal, watching couples check in together, I nearly turned around. This was a mistake. What was I thinking?\n\nThe embarkation staff member who processed my documents noticed something. She asked if I was traveling alone. When I said yes, she made a quick note and smiled. 'You're going to love it. Our solo travelers always do.'\n\nThat note mattered. Throughout the cruise, staff checked on me without smothering. The dining room placed me at a table with other solo women — widows mostly, who understood the specific loneliness of traveling without your person.\n\nPiazza Venezia became my grief space. Early mornings, coffee, watching the ocean that Robert would never see. The crew gave me privacy during those moments. They seemed to understand that some passengers need the view more than the activity.\n\nThe emotional pivot happened during the napkin-folding demonstration. Ridiculous, yes. But the instructor was teaching a design Robert would have loved — he'd always insisted on properly folded napkins at home. I burst into tears in front of twenty strangers.\n\nThe instructor paused, came to my side, and quietly said, 'Someone taught you to care about these details, didn't they?' I nodded. 'Then let's make sure you learn this one to honour them.'\n\nI learned. I've folded napkins that way at every meal since. Robert would be proud.\n\nLuminosa didn't ask me to stop grieving. The ship made space for my grief while gently inviting me back to living. The South Pacific sparkled regardless of my sorrow. The food was delicious regardless of who wasn't there to share it.\n\n**For widowed travelers:** Luminosa won't replace what you've lost. Nothing will. But the ship will remind you that you're still here, still capable, still deserving of beauty. Book it when you're ready. The crew will meet you where you are.",
      "author": {
        "name": "Margaret K.",
        "location": "Sunshine Coast, QLD"
      }
    }
  ]
}
